[
{"imdbId": "tt0114709", "storyLine": "\nA little boy named Andy loves to be in his room, playing with his toys, especially his doll named \"Woody\". But, what do the toys do when Andy is not with them, they come to life. Woody believes that he has life (as a toy) good. However, he must worry about Andy's family moving, and what Woody does not know is about Andy's birthday party. Woody does not realize that Andy's mother gave him an action figure known as Buzz Lightyear, who does not believe that he is a toy, and quickly becomes Andy's new favorite toy. Woody, who is now consumed with jealousy, tries to get rid of Buzz. Then, both Woody and Buzz are now lost. They must find a way to get back to Andy before he moves without them, but they will have to pass through a ruthless toy killer, Sid Phillips."},
{"imdbId": "tt0113497", "storyLine": "\nAfter being trapped in a jungle board game for 26 years, a Man-Child wins his release from the game. But, no sooner has he arrived that he is forced to play again, and this time sets the creatures of the jungle loose on the city. Now it is up to him to stop them."},
{"imdbId": "tt0113228", "storyLine": "\nThings don't seem to change much in Wabasha County: Max and John are still fighting after 35 years, Grandpa still drinks, smokes, and chases women , and nobody's been able to catch the fabled \"Catfish Hunter\", a gigantic catfish that actually smiles at fishermen who try to snare it. Six months ago John married the new girl in town (Ariel), and people begin to suspect that Max might be missing something similar in his life. The only joy Max claims is left in his life is fishing, but that might change with the new owner of the bait shop."},
{"imdbId": "tt0114885", "storyLine": "\nThis story based on the best selling novel by Terry McMillan follows the lives of four African-American women as they try to deal with their very lives. Friendship becomes the strongest bond between these women as men, careers, and families take them in different directions. Often light-hearted this movie speaks about some of the problems and struggles the modern women face in today's world."},
{"imdbId": "tt0113041", "storyLine": "\nIn this sequel to \"Father of the Bride\", George Banks must accept the reality of what his daughter's ascension from daughter to wife, and now, to mother means when placed into perspective against his own stage of life. As the comfortable family unit starts to unravel in his mind, a rapid progression into mid-life crisis is in his future. His journey to regain his youth acts as a catalyst for a kind of \"rebirth\" of his attitude on life when he and his wife, Nina, find how their lives are about to change as well."},
{"imdbId": "tt0113277", "storyLine": "\nHunters and their prey--Neil and his professional criminal crew hunt to score big money targets (banks, vaults, armored cars) and are, in turn, hunted by Lt. Vincent Hanna and his team of cops in the Robbery/Homicide police division. A botched job puts Hanna onto their trail while they regroup and try to put together one last big 'retirement' score. Neil and Vincent are similar in many ways, including their troubled personal lives. At a crucial moment in his life, Neil disobeys the dictum taught to him long ago by his criminal mentor--'Never have anything in your life that you can't walk out on in thirty seconds flat, if you spot the heat coming around the corner'--as he falls in love. Thus the stage is set for the suspenseful ending...."},
{"imdbId": "tt0114319", "storyLine": "\nWhile she was growing up, Sabrina Fairchild spent more time perched in a tree watching the Larrabee family than she ever did on solid ground. As the chauffeur's daughter on their lavish Long Island estate, Sabrina was invisible behind the branches, but she knew them all below... There is Maude Larrabee, the modern matriarch of the Larrabee Corporation; Linus Larrabee, the serious older son who expanded a successful family business into the world's largest communications company; and David, the handsome, fun-loving Larrabee, who was the center of Sabrina's world until she was shipped off to Paris. After two years on the staff of Vogue magazine, Sabrina has returned to the Larrabee estate but now she has blossomed into a beautiful and sophisticated woman. And she's standing in the way of a billion dollar deal."},
{"imdbId": "tt0112302", "storyLine": "\nA mischievous young boy, Tom Sawyer ("},
{"imdbId": "tt0114576", "storyLine": "\nSome terrorists kidnap the Vice President of the United States and threaten to blow up the entire stadium during the final game of the NHL Stanley Cup. There is only one way and one man to stop them..."},
{"imdbId": "tt0113189", "storyLine": "\nWhen a deadly satellite weapon system falls into the wrong hands, only Agent 007 can save the world from certain disaster. Armed with his license to kill, Bond races to Russia in search of the stolen access codes for \"Goldeneye,\" an awesome space weapon that can fire a devastating electromagnetic pulse toward Earth. But 007 is up against an enemy who anticipates his every move: a mastermind motivated by years of simmering hatred. Bond also squares off against Xenia Onatopp, an assassin who uses pleasure as her ultimate weapon."},
{"imdbId": "tt0112346", "storyLine": "\nAndrew Shepherd is approaching the end of his first term as President of the United States. He's a widower with a young daughter and has proved to be popular with the public. His election seems assured. That is until he meets Sydney Ellen Wade, a paid political activist working for an environmental lobby group. He's immediately smitten with her and after several amusing attempts, they finally manage to go on a date (which happens to be a State dinner for the visiting President of France). His relationship with Wade opens the door for his prime political opponent, Senator Bob Rumson, to launch an attack on the President's character, something he could not do in the previous election as Shepherd's wife had only recently died."},
{"imdbId": "tt0112896", "storyLine": "\nAnother spoof from the mind of Mel Brooks. This time he's out to poke fun at the Dracula myth. Basically, he took \"Bram Stoker's Dracula,\" gave it a new cast and a new script and made a big joke out of it. The usual, rich English are attacked by Dracula and Dr. Van Helsing is brought in to save the day."},
{"imdbId": "tt0112453", "storyLine": "\nA half-wolf, half-husky named Balto gets a chance to become a hero when an outbreak of diphtheria threatens the children of Nome, Alaska in the winter of 1925. He leads a dog team on a 600-mile trip across the Alaskan wilderness to get medical supplies. The film is based on a true story which inspired the Iditarod dog sled race."},
{"imdbId": "tt0113987", "storyLine": "\nDirector Oliver Stone's exploration of former president Richard Nixon's strict Quaker upbringing, his nascent political strivings in law school, and his strangely self-effacing courtship of his wife, Pat. The contradictions in his character are revealed early, in the vicious campaign against Helen Gahagan Douglas and the oddly masochistic Checkers speech. His defeat at the hands of the hated and envied John F. Kennedy in the 1960 presidential election, followed by the loss of the 1962 California gubernatorial race, seem to signal the end of his career. Yet, although wholly lacking in charisma, Nixon remains a brilliant political operator, seizing the opportunity provided by the backlash against the antiwar movement to take the presidency in 1968. It is only when safely in office, running far ahead in the polls for the 1972 presidential election, that his growing paranoia comes to full flower, triggering the Watergate scandal."},
{"imdbId": "tt0112760", "storyLine": "\nMorgan Adams and her slave, William Shaw, are on a quest to recover the three portions of a treasure map. Unfortunately, the final portion is held by her murderous uncle, Dawg. Her crew is skeptical of her leadership abilities, so she must complete her quest before they mutiny against her. This is made yet more difficult by the efforts of the British crown to end her piratical raids."},
{"imdbId": "tt0112641", "storyLine": "\nThis Martin Scorsese film depicts the Janus-like quality of Las Vegas--it has a glittering, glamorous face, as well as a brutal, cruel one. Ace Rothstein and Nicky Santoro, mobsters who move to Las Vegas to make their mark, live and work in this paradoxical world. Seen through their eyes, each as a foil to the other, the details of mob involvement in the casinos of the 1970's and '80's are revealed. Ace is the smooth operator of the Tangiers casino, while Nicky is his boyhood friend and tough strongman, robbing and shaking down the locals. However, they each have a tragic flaw--Ace falls in love with a hustler, Ginger, and Nicky falls into an ever-deepening spiral of drugs and violence."},
{"imdbId": "tt0114388", "storyLine": "\nWhen Mr. Dashwood dies, he must leave the bulk of his estate to the son by his first marriage, which leaves his second wife and their three daughters (Elinor, Marianne, and Margaret) in straitened circumstances. They are taken in by a kindly cousin, but their lack of fortune affects the marriageability of both practical Elinor and romantic Marianne. When Elinor forms an attachment for the wealthy Edward Ferrars, his family disapproves and separates them. And though Mrs. Jennings tries to match the worthy (and rich) Colonel Brandon to her, Marianne finds the dashing and fiery John Willoughby more to her taste. Both relationships are sorely tried."},
{"imdbId": "tt0113101", "storyLine": "\nThis movie features the collaborative directorial efforts of four new filmmakers, each of whom directs a segment of this comedy. It's New Year's Eve at the Mon Signor Hotel, a former grand old Hollywood hotel, now fallen upon hard times. Often using physical comedy and sight gags, this movie chronicles the slapstick misadventures of Ted, the Bellhop. He's on his first night on the job, when he's asked to help out a coven of witches in the Honeymoon Suite. Things only get worse when he delivers ice to the wrong room and ends up in a domestic argument at a really bad time. Next, he foolishly agrees to watch a gangster's kids for him while he's away. Finally, he finishes off the night refereeing a ghastly wager."},
{"imdbId": "tt0112281", "storyLine": "\nAce Ventura, emerging from self-imposed exile in a remote Himalayan hideaway, travels to Africa with explorer Fulton Greenwall to find a sacred bat which is told will avert a war between with Wachootoo and Wachati tribes. Of course, when Ace gets involved, all hell breaks loose..."},
{"imdbId": "tt0113845", "storyLine": "\nTwo foster brothers work as transit cops. While one's life is as good as it gets, the other's is a pit. After losing his job, getting dumped by his brother, and getting the crap kicked out of him by a loan shark for the umpteenth time, He implements his plan to steal the \"money train,\" a train carrying the New York Subway's weekly revenue. But when things go awry, will his brother be able to save him in time?"},
{"imdbId": "tt0113161", "storyLine": "\nSome guys get all the luck, whether they like it or not. Chili Palmer happens to be in Hollywood collecting a gambling debt when he's struck by lightning (not literally). Called a natural for the movie business, he's snagged up by a producer. The rest is history."},
{"imdbId": "tt0112722", "storyLine": "\nIn San Francisco, the criminal psychologist Helen Hudson is specialized in serial-killers. During a trial, the accused Daryll Lee Cullum kills a police officer and tries to kill her and she becomes agoraphobic. Now Helen lives a reclusive life with her gay friend Andy that helps her. Sometime later, there is a wave of crimes and Detectives M.J. Monahan and Reuben Goetz are investigating the murder cases. Helen identifies that the murderer is copycatting notorious serial-killers and she anonymously contacts the Police Department. After fourteen phone calls, she is identified by the police. Detectives M.J. and Reuben visit her and Helen teams up with them and prepares the profile of the killer that wants to be famous. But soon the copycat killer Peter Foley contacts and stalks Helen and M.J. and Reuben give protection to her. Will they be capable to stop Foley before the next murder?"},
{"imdbId": "tt0112401", "storyLine": "\nRobert Rath is a seasoned hitman who just wants out of the business with no back talk. But, as things go, it ain't so easy. A younger, peppier assassin named Bain is having a field day trying to kill said older assassin. Rath teams up with a computer hacker named Electra to defeat the obsessed Bain."},
{"imdbId": "tt0114168", "storyLine": "\nWhen sheriff Barnum investigates the death of an elderly rural resident, he discovers a teenage grandson living in the basement. Raised by his grandparents, he has experienced the world only through books, never leaving the family farm. He is sent to a state home for boys where he has trouble fitting in socially. His odd appearance and unusual abilities cause the small town residents to fear and ridicule him. However, not all are afraid. Some begin to view his potential and gifts with wonderment."},
{"imdbId": "tt0113627", "storyLine": "\nBecause his wife left him and took his son with her, screenwriter Ben Sanderson has started drinking, a lot. He's getting more and more isolated and he troubles women in bars because he wants to have sex with them. When he gets fired, he decides to leave everything behind and move to Las Vegas and drink himself to death. In Las Vegas he meets Sera, a prostitute with some problems as well who he moves in with."},
{"imdbId": "tt0114057", "storyLine": "\nIago convinces Othello, The Moor of Venice that his wife, Desdemona has been unfaithful. Iago is an evil, manipulative character with his own agenda. A plot of jealousy and rage transpires in this classic Shakespearean tale."},
{"imdbId": "tt0114011", "storyLine": "\nRoberta, Teeny, Samantha and Chrissy have been busy growing up, but they always remembered the promise they made to be there for each other. Now they're together again to relive the greatest summer of their lives."},
{"imdbId": "tt0114117", "storyLine": "\nEight years earlier, Anne Elliot, the daughter of a financially troubled aristocratic family, was persuaded to break off her engagement to Frederick Wentworth, a young seaman, who, though promising, had poor family connections. When her father rents out the family estate to Admiral Croft, Anne is thrown into company with Frederick, because his sister is Mrs. Croft. Frederick is now a rich and successful Captain, and a highly eligible bachelor. Whom will he marry? One of Anne's sister's husband's sisters? Or will he and Anne rekindle the old flame?"},
{"imdbId": "tt0112682", "storyLine": "\nSet in a dystopian society, someone is kidnapping the children. Krank and his band of clones are using the children to harvest their dreams. Then they kidnap Denree, the brother of One, a fairground strongman. One sets out to find his brother."},
{"imdbId": "tt0115012", "storyLine": "\nUncle Liu brings his cousin to Shanghai to work for 'Boss,' the leader of a powerful drug empire in the 1930's. Shuisheng, a simple country boy is awed and overwhelmed by the opulence and immense wealth he is suddenly surrounded by. He is to be the attendant of Xiao Jingbao, the new mistress of 'Boss.' While he fumbles with the demands of his new role, much intrigue is going on around him, well beyond his bewildered perception. Xiao Jingbao is having a tumultuous affair, Fat Yu is starting a gang war, and 'Boss' is beginning to suspect that one of his trusted men is not loyal."},
{"imdbId": "tt0112792", "storyLine": "\nLouanne Johnson is an ex-marine, hired as a teacher in a high-school in a poor area of the city. She has recently separated from her husband. Her friend, also teacher in the school, got the temporary job for her. After a terrible reception from the students, she tries unconventional methods of teaching (using karate, Bob Dylan lyrics etc) to gain the trust of the students."},
{"imdbId": "tt0114746", "storyLine": "\nAn unknown and lethal virus has wiped out five billion people in 1996. Only 1% of the population has survived by the year 2035, and is forced to live underground. A convict (James Cole) reluctantly volunteers to be sent back in time to 1996 to gather information about the origin of the epidemic (who he's told was spread by a mysterious \"Army of the Twelve Monkeys\") and locate the virus before it mutates so that scientists can study it. Unfortunately Cole is mistakenly sent to 1990, six years earlier than expected, and is arrested and locked up in a mental institution, where he meets Dr. Kathryn Railly, a psychiatrist, and Jeffrey Goines, the insane son of a famous scientist and virus expert."},
{"imdbId": "tt0112431", "storyLine": "\nGentle farmer Arthur Hoggett wins a piglet named Babe at a county fair. Narrowly escaping his fate as Christmas dinner when Farmer Hoggett decides to show him at the next fair, Babe bonds with motherly border collie Fly and discovers that he too can herd sheep. But will the other farm animals, including Fly's jealous husband Rex, accept a pig who doesn't conform to the farm's social hierarchy?"},
{"imdbId": "tt0112637", "storyLine": "\nThe story of the relationship between painter Dora Carrington and author Lytton Strachey in a World War One England of cottages and countryside. Although platonic due to Strachey's homosexuality, the relationship was nevertheless a deep and complicated one. When Carrington did develop a more physical relationship with soldier Ralph Partridge, Strachey was able to welcome him as a friend, although Partridge remained somewhat uneasy, not so much with Strachey's sexual orientation as with the fact that he was a conscientious objector."},
{"imdbId": "tt0112818", "storyLine": "\nA convicted murderer on Death Row and the nun who befriends him. Through the portrayal of finely drawn characters and their interactions as the days, hours, and minutes tick down to the condemned man's execution, powerful emotions are unleashed. While Matthew Poncelet and Sister Prejean desperately try to gain a stay of execution from the governor or the courts, scenes are intercut from the brutal crime, gradually revealing the truth about the events that transpired. In addition to her temporal help, the nun also tries to reach out spiritually and assist as a guide to salvation."},
{"imdbId": "tt0112286", "storyLine": "\nA young Russian boy, Thomas Minton, travels to New York as a passenger on a Russian freighter. Close to Ellis Island he gets off and thus starts his journey to America the same way as all immigrants in former times. Thomas is searching for the family of one of his ancestors, who had emigrated decades ago, but once sent a letter home together with a sample of his new profession: 3D-Photography. The boy follows his relative's traces by counter-checking the old 3D-Photographs of New York (using an antique viewer) with the same places and how they look today. This way, the audience gets to see the Big Apple in former times as well as today."},
{"imdbId": "tt0113442", "storyLine": "\nAlyssa (a rich girl) and Amanda (an orphan) are two little girls who are identical, but complete strangers, that accidentally meet one day. In an attempt to stop Alyssa's father from getting married to Clarice, a conceited know-it-all, the girls get him to meet Amanda's case worker and switch lives to stop the wedding once and for all. Though things don't go exactly as planned when Amanda gets adopted and Clarice moves up the wedding..."},
{"imdbId": "tt0112697", "storyLine": "\nCher, a high school student in Beverly Hills, must survive the ups and downs of adolescent life. Her external demeanor at first seems superficial, but rather it hides her wit, charm, and intelligence which help her to deal with relationships, friends, family, school, and the all-important teenage social life."},
{"imdbId": "tt0112749", "storyLine": "\nSouth African church minister Steven Kumalo is summoned from his village to Johannesburg. There he finds that his son Absolom has been jailed in connection with a robbery in which a white man was killed. The father of the white man, James Jarvis, is a supporter of apartheid, the separation of the races which is the law of South Africa. When they encounter each other, both Kumalo and Jarvis come to unexpected realizations not only about their sons, but about the nature of their own humanity."},
{"imdbId": "tt0114279", "storyLine": "\nWilliam Shakespeare's classic play is brought into the present with the setting as Great Britian in the 1930s. Civil war has erupted with the House of Lancaster on one side, claiming the right to the British throne and hoping to bring freedom to the country. Opposing is the House of York, commanded by the infamous Richard who rules over a fascist government and hopes to install himself as a dictator monarch."},
{"imdbId": "tt0112819", "storyLine": "\nThis action film, directed by the Hughes brothers, depicts a heist of old bills, retired from circulation and destined by the government to be \"money to burn.\" However, more broadly, it addresses the issues of Black Americans' involvement in the Vietnam War and their subsequent disillusionment with progress in social issues and civil rights back home in the United States, during the 1960's."},
{"imdbId": "tt0114272", "storyLine": "\nAn aspiring young physician, Robert Merivel found himself in the service of King Charles II and saves the life of a spaniel dear to the King. Merivel joins the King's court and lives the high life provided to someone of his position. Merivel is ordered to marry one of the King's mistresses in order to divert the suspicions of another one of his mistresses. He is given one order by the king and that is not to fall in love. The situation worsens when Merivel finds himself in love with his new wife. Eventually, the King finds out and relieves Merivel of his position and wealth. His fall from grace leaves Merivel where he first started. And through his travels and reunions with an old friend, he rediscovers his love for true medicine and what it really means to be a physician."},
{"imdbId": "tt0113855", "storyLine": "\nBased on the popular video game of the same name \"Mortal Kombat\" tells the story of an ancient tournament where the best of the best of different Realms fight each other. The goal - ten wins to be able to legally invade the losing Realm. Outworld has so far collected nine wins against Earthrealm, so it's up to Lord Rayden and his fighters to stop Outworld from reaching the final victory..."},
{"imdbId": "tt0114681", "storyLine": "\nSuzanne Stone (Maretto) knows exactly what she wants. She wants to be a television newscaster and she is willing to do anything to get what she wants. What she lacks in intelligence, she makes up for in cold determination and diabolical wiles. As she pursues her goal with relentless focus, she is forced to destroy anything and anyone that may stand in her way, regardless of the ultimate cost or means necessary."},
{"imdbId": "tt0113347", "storyLine": "\nFinn is a young graduate student, finishing a master's thesis, and preparing for marriage to her fiance Sam. But thoughts of the end of the free life, and a potential summer fling, intrude. She goes home to her grandmother, where, over the making of her wedding gift by a group of quilting-bee friends, laughter, bickering, love, and advice lead her toward a more open-eyed examination of her course."},
{"imdbId": "tt0114369", "storyLine": "\nA film about two homicide detectives' ("},
{"imdbId": "tt0114148", "storyLine": "\nThis is the Disney animated tale of the romance between a young American Indian woman named Pocahontas and Capt. John Smith, who journeyed to the New World with other settlers to begin fresh lives. Her powerful father, Chief Powhatan, disapproves of their relationship and wants her to marry a native warrior. Meanwhile, Smith's fellow Englishmen hope to rob the Native Americans of their gold. Can Pocahontas' love for Smith save the day?"},
{"imdbId": "tt0114916", "storyLine": "\nCamille and Martin are in love and teachers at a christian college; they get the opportunity to get a better job, but they would have to marry for that. But when Camille's dog dies, she recognizes that her love for Martin is not even as big as the love for her dog. After that, Camille gets to know Petra, and Petra falls in love with Camille. They meet again, but Camille is very unsure about her feelings. When Martin is away for a weekend, Camille and Petra meet in the Circus where Petra is working as an acrobat. They spend the night together, but Martin finds out about it and is shocked. He has an argument with Camille, and she goes burying her dog in the snow, and falls asleep..."},
{"imdbId": "tt0114814", "storyLine": "\nFollowing a truck hijack in New York, five conmen are arrested and brought together for questioning. As none of them are guilty, they plan a revenge operation against the police. The operation goes well, but then the influence of a legendary mastermind criminal called Keyser Söze is felt. It becomes clear that each one of them has wronged Söze at some point and must pay back now. The payback job leaves 27 men dead in a boat explosion, but the real question arises now: Who actually is Keyser Söze?"},
{"imdbId": "tt0113819", "storyLine": "\nLenny and Amanda have an adopted son Max who turns out to be brilliant. Lenny becomes obsessed with finding Max's real parents because he believes that they too must be brilliant. When he finds that Linda Ash is Max' real mother, Lenny is disappointed. Linda is a prostitute and porn star. On top of that, she is quite possibly the dumbest person Lenny has ever met. Interwoven is a Greek chorus linking the story with the story of Oedipus."},
{"imdbId": "tt0110299", "storyLine": "\nTwo Italian racketeers come to Albania just after the fall of the communists to set up a fictive firm and pocket the grants. They need a stooge. They choose an old one in a jail : Spiro. But the youngest italian, Gino, once alone with Spiro, encounter a few problems. Far from his roots, loosing his identity in deep Albania, he begins to change..."},
{"imdbId": "tt0112499", "storyLine": "\nAnother Disney underdog sports team of misfit kids (soccer this time) learns to play a new sport and become champions, while building self-esteem, making friends and solving a variety of dramatic family crises, through the able assistance of a foreign exchange teacher and a former local sports hero as coaches."},
{"imdbId": "tt0113158", "storyLine": "\nSadie is desperately looking up to her older sister Georgia who is a famous C&W artist. Sadie wants to be a famous artist like her sister, but is always doing everything wrong. Her desperate need to be accepted by her sister is constantly complicated by her drug and alcohol problems. Georgia lives a very ordered life with husband, house and children, and Sadie does everything to get her attention."},
{"imdbId": "tt0113321", "storyLine": "\nAfter losing her job, making out with her soon to be ex-boss, and finding out that her daughter plans to spend Thanksgiving with her boyfriend, Claudia Larson has to face spending the holiday with her family. She wonders if she can survive their crazy antics."},
{"imdbId": "tt0110877", "storyLine": "\nPablo Neruda, the famous Chilean poet, is exiled to a small island for political reasons. On the island, the unemployed son of a poor fisherman is hired as an extra postman due to the huge increase in mail that this causes. Il Postino is to hand-deliver the celebrity's mail to him. Though poorly educated, the postman learns to love poetry and eventually befriends Neruda. Struggling to grow and express himself more fully, he suddenly falls in love and needs Neruda's help and guidance more than ever."},
{"imdbId": "tt0112714", "storyLine": "\nThe year is 1952, in Quebec City. Rachel, 16, unmarried, and pregnant, works in the church. Filled with shame, she unburdens her guilt to a young priest, under the confidentiality of the confessional. In the present year of 1989, Pierre Lamontagne has returned to Quebec to attend his father's funeral. He meets up with his adopted brother, Marc, who has begun questioning his identity and has embarked on a quest for his roots that would lead them to the Quebec of the 1950s. Past and present converge in a complex web of intrinque where the answer to the mystery lies."},
{"imdbId": "tt0113419", "storyLine": "\nOn his ninth birthday a boy receives many presents. Two of them first seem to be less important: an old cupboard from his brother and a little Indian figure made of plastic from his best friend. But these two presents turn out to be much more magic than the rest..."},
{"imdbId": "tt0116260", "storyLine": "\nKaren McCann's eldest daughter is raped and murdered whilst on the phone with her. When the case against Robert Doob, the perpetrator, is dismissed because of a technicality, she starts following him and sees how he checks out his next victim, a woman he delivers groceries to. She tells the police, but is only warned she must stop following Doob. When she tries to warn the woman, she is shooed out of the house. Doob, having found out that Karen is following him, threatens to do something to her youngest daughter. She then seeks help from a group of vigilantes connected to a support group, in order to shoot Doob. However, a friend from the support group turns out to be an FBI agent investigating the very vigilante activity Karen is involved in and warns her that she will go to jail for the rest of her life unless it is self-defense. In the meantime, tension grows between Karen and her husband Mack, because he finds out she has secretly been taking self-defense classes and has been ..."},
{"imdbId": "tt0113862", "storyLine": "\nGlenn Holland is a musician and composer who takes a teaching job to pay the rent while, in his 'spare time', he can strive to achieve his true goal - compose one memorable piece of music to leave his mark on the world. As Holland discovers 'Life is what happens to you while you're busy making other plans' and as the years unfold the joy of sharing his contagious passion for music with his students becomes his new definition of success."},
{"imdbId": "tt0116126", "storyLine": "\n\"Don't Be a Menace to South Central While Drinking your Juice in the Hood\" is a parody of several U.S. films about being in the 'Hood', for instance \"Boyz n the Hood\", \"South Central\", \"Menace II Society\", \"Higher Learning\" and \"Juice\". We follow Ashtray as he returns to the place he grew up in and meet his father and his basket-case friends. Crazy stuff happens. For example, Ashtray is older than his father and his best friend Loc Dog's grandmother is a trigger-happy old lady who blames her eccentric-looking kid for not being tough enough."},
{"imdbId": "tt0118002", "storyLine": "\nFrank O'Brien, a petty thief, and his 7-year-long girlfriend Roz want to put an end to their unsteady lifestyle and just do that _last_ job, which involves stealing a valuable painting. Frank takes Roz to an island on the coast of New England, where he wants to sell the painting and also hopes that their sagging relationship will get a positive push back up. Not everything goes as planned, as some thugs and the FBI try to recover the painting and Roz gets attracted not only to the landscape..."},
{"imdbId": "tt0115683", "storyLine": "\nBud and Doyle are two losers who are doing nothing with their lives. Both of their girlfriends are actively involved in saving the environment, but the two friends couldn't care less about saving the Earth. One day, when a group of scientists begin a mission to live inside a \"Bio-Dome\" for a year without outside contact, Bud and Doyle mistakenly become part of the project themselves. The two must then learn how to protect the Earth and help the scientists complete their mission."},
{"imdbId": "tt0116839", "storyLine": "\nJobe is resuscitated by Jonathan Walker. He wants Jobe to create a special computer chip that would connect all the computers in the world into one network, which Walker would control and use. But what Walker doesn't realize is a group of teenage hackers are on to him and out to stop his plan."},
{"imdbId": "tt0113149", "storyLine": "\nLaurent is the local estate agent, a job that offers easy opportunties for his womanising. His wife beautiful wife Loli looks after his home and two children unaware of his many affairs. However, their world is turned upside down by the arrival of Marijo, an itinerant lesbian whose minivan breaks down nearby. The neglected Loli is drawn to the sensitive Marijo and when she learns of Laurent's infidelities, invites Marijo to move in with them. The arrangement takes an emotional toll on each of them, exacerbated by the arrival of a figure from Marijo's past. As they struggle with the situation and each other, all of their lives are changed forever."},
{"imdbId": "tt0113118", "storyLine": "\nIt is Friday and Craig Jones (Ice Cube) is unemployed, having, yesterday, been fired. He is lounging around his house with his friend Smokey (Chris Tucker), a rather incompetent weed dealer. Smokey's problem is that he tends to smoke, rather than sell, his product. This has lead to trouble with Smokey's supplier, Big Worm, who now wants his money, or his product back, or Smokey is a dead man. Then there's Deebo, the local bully, plus Craig's jealous, psychotic girlfriend, Joi, and Debbie, the neighbour Craig has a crush on. A lot can happen while lounging around your house on a Friday."},
{"imdbId": "tt0116367", "storyLine": "\nAfter a bank heist in Abilene with several casualties, the bank robber Seth Gecko and his psychopath and rapist brother Richard Gecko continue their crime spree in a convenience store in the middle of the desert while heading to Mexico with a hostage. They decide to stop for a while in a low-budget motel. Meanwhile the former minister Jacob Fuller is traveling on vacation with his son Scott and his daughter Kate in a RV. Jacob lost his faith after the death of his beloved wife in a car accident and quit his position of pastor of his community and stops for the night in the same motel Seth and Richard are lodged. When Seth sees the recreational vehicle, he abducts Jacob and his family to help his brother and him to cross the Mexico border, promising to release them on the next morning. They head to the truck drivers and bikers bar Titty Twister where Seth will meet with his partner Carlos in the dawn. When they are watching the dancer Santanico Pandemonium, Seth and Richard fight with ..."},
{"imdbId": "tt0113010", "storyLine": "\nMax Kirkpatrick is a cop who protects Kate McQuean, a civil law attorney, from a renegade KGB team out to terminate her."},
{"imdbId": "tt0113537", "storyLine": "\nAfter college graduation, Grover's girlfriend Jane tells him she's moving to Prague to study writing. Grover declines to accompany her, deciding instead to move in with several friends, all of whom can't quite work up the inertia to escape their university's pull. Nobody wants to make any big decisions that would radically alter his life, yet none of them wants to end up like Chet, the professional student who tends bar and is in his tenth year of university studies."},
{"imdbId": "tt0113828", "storyLine": "\nHenri Fortin is poor and iliterate former boxer. Ziman is rich Jewish lawyer from Paris. During WWII they meet when Fortin agrees to drive Ziman's family to Switzerland. Intrigued by Victor Hugo's novel \"Les Miserables\", Fortin asks the Zimans to read that book to him during the travel. Before the end of movie every main character would see his character in situations similar to those in Hugo's novel."},
{"imdbId": "tt0115644", "storyLine": "\nRomantic drama about a young career girl who is swept off her feet by a shy florist, who fell in love with her after one glimpse through a shadowy window."},
{"imdbId": "tt0114367", "storyLine": "\n(SIRIUS 6B, Year 2078) On a distant mining planet ravaged by a decade of war, scientists have created the perfect weapon: a blade-wielding, self-replicating race of killing devices known as Screamers designed for one purpose only -- to hunt down and destroy all enemy life forms But man's greatest weapon has continued to evolve without any human guidance, and now it has devised a new mission: to obliterate all life. Col. Hendricksson (Peter Weller) is commander of a handful of Alliance soldiers still alive on Sirius 6B. Betrayed by his own political leaders and disgusted by the atrocities of this never-ending war, Hendricksson decides he must negotiate a separate peace with the New Economic Bloc's decimated forces. But to do so, he will have to cross a treacherous wasteland where the deadliest threat comes from the very weapons he helped to create."},
{"imdbId": "tt0113973", "storyLine": "\nA look into the many lives of Christa Päffgen, otherwise known as Nico; from cutie German mädchen to the first of the supermodels, to glamorous diva of the Velvet Underground, to cult item, junkie and hag. Many faces for the same woman, whom, you realize, just couldn't bring herself to care enough to live."},
{"imdbId": "tt0112744", "storyLine": "\nAfter his daughter died in a hit and run, Freddy Gale has waited six years for John Booth, the man responsible, to be released from prison. On the day of release, Gale visits Booth and announces that he will kill him in one week. Booth uses his time to try and make peace with himself and his entourage, and even finds romance. Gale, whose life is spiralling down because of his obsession towards Booth, will bring himself on the very edge of sanity. At the end of the week, both men will find themselves on a collision course with each other."},
{"imdbId": "tt0116731", "storyLine": "\nWhen Annie Laird is selected as a juror in a big Mafia trial, she is forced by someone known as \"The Teacher\" to persuade the other jurors to vote \"not guilty\". He threatens to kill her son if she doesn't commit. When the trial is over, he can't let her go..."},
{"imdbId": "tt0112445", "storyLine": "\nRazieh wants a fat goldfish for the Iranian New Years celebration instead of the skinny ones in her family's pond at home, because the fat fish looks like it's dancing when it swims. After many attempts she and her brother convince their mother to give them her last bit of money. Between their home and the fish store, Razieh loses the money.. She finds it, but it is temptingly just out of her reach."},
{"imdbId": "tt0114660", "storyLine": "\nJimmy the Saint's business is videotaping the terminally-ill, so that they will be around to give 'Afterlife Advice' to their survivors. He hasn't been doing too well lately and has had to turn to loan-sharks to accomodate his failing business, as well as his expensive personal tastes. When an evil gangster-overlord buys up his note and demands a favor of Jimmy, in exchange for the interest that he can't afford, Jimmy capitulates. Jimmy is to scare someone for the gangster-overlord--really rough them up. Without giving too much away (spoiler), the scene goes down badly and Jimmy and his crew all end up with contracts on their heads for their trouble."},
{"imdbId": "tt0112379", "storyLine": "\nIn an anonymous Dutch village, a sturdy, strong-willed matriarch looks back upon her life, the generations of family and friends gathered around her table, and ponders the cyclical nature of time."},
{"imdbId": "tt0114039", "storyLine": "\nThis film relates the story of a tightly connected Afro-American community informally called Colored Town where the inhabitants live and depend on each other in a world where racist oppression is everywhere, as told by a boy called Cliff who spent his childhood there. Despite this, we see the life of the community in all its joys and sorrows, of those that live there while others decide to leave for a better life north. For those remaining, things come to a serious situation when one prominent businessman is being muscled out by a white competitor using racist intimidation. In response, the community must make the decision of whether to submit meekly like they always have, or finally fight for their rights."},
{"imdbId": "tt0113612", "storyLine": "\nFilmed entirely on location in East Hampton, Long Island, \"Last Summer in the Hamptons\" concerns a large theatrical family spending the last weekend of their summer together at the decades-old family retreat which economic circumstances have forced them to put on the market. Victoria Foyt plays a young Hollywood actress whose visit wreaks havoc on the stellar group of family and friends - led by matriarch Viveca Lindfors and made up of an extraordinary mix of prominent New York actors, directors, and playwrights. In the course of a very unusual weekend, comic as well as serious situations arise, and the family's secrets - of which there are many - begin to unravel."},
{"imdbId": "tt0112365", "storyLine": "\nThe movie is a study of a family of country gentry in Victorian England. William Adamson, a young scientist, is introduced into the Alabaster family by Reverend Mr Alabaster who is also fascinated by insects. William marries the older daughter of the family and studies the amounts of insects in the garden of the villa. His - for the gentry - strange behaviors reveal at the same time their own failures and passions."},
{"imdbId": "tt0118158", "storyLine": "\nA true story about a group of American teenage boys who crew a school sailing ship to gain experience, discipline, or whatever their parents feel they lack. The voyage is a true adventure for them all but it has its downs as well as ups."},
{"imdbId": "tt0116151", "storyLine": "\nRobert's a beleaguered concierge of the luxury hotel owned by Mrs. Dubrow. She tells Robert an undercover reviewer is coming and to look sharp. If he does well he might get a promotion and some time off to take his sons, Brian and Kyle, on vacation. But then the villainous jewel-thief Rutledge checks in with his specially trained orangutan, Dunston. And when Dunston gets loose and tries to escape a life of crime with the help of Brian and Kyle, things go just a little lunatic."},
{"imdbId": "tt0115697", "storyLine": "\nComedy about the prospective Washington State Governor Al Donnelly whose only stumbling block on the road to power is his embarrassing younger brother Mike. To keep him out of mischief, Al forces one of his aides, Steve Dodds to keep an eye on him during the election. However, this is easier said than done..."},
{"imdbId": "tt0113972", "storyLine": "\nGene Watson is a public accountant who arrives on a train at Union Station in Los Angeles, accompanied by his 6-year-old daughter Lynn. Because of his ordinary looks, he is approached by a pair of sinister people named Smith and Jones. Pretending to be cops, Smith and Jones kidnap Lynn and confront Gene with a simple choice -- kill California governor Eleanor Grant in 90 minutes or less, or Lynn will die. Watson is given a gun, six bullets, and a name tag, and he is told to go to the Westin Bonaventure Hotel and kill Eleanor, who is giving an afternoon speech. While Jones is watching Lynn in a van, Smith watches Watson in order to prevent Watson from alerting the authorities. Watson must quickly find some way to get himself and Lynn out of this seemingly impossible situation."},
{"imdbId": "tt0117002", "storyLine": "\nWe are somewhere in England in the 19th century. A Pretty housemaid works in a nice house, which is Dr. Jekyll's house. Mary Reilly think she found her best job, because she is poor and the doctor is well-known and rich. The film tells the 'Dr. Jekyll and Mr. Hyde' story as a woman sees the two men, one of them is good and the other is evil. And she loves them ..."},
{"imdbId": "tt0114825", "storyLine": "\nMaximillian is the only survivor from a race of vampires on a Caribbean Island, and as a vampire, he must find a mate to keep the line from ending. He knows that a child had been born to a woman who had a vampire father, and he searches for her in Brooklyn. Rita's mother, who has died in an asylum, was that woman and Rita has nightmares that she does not understand. Not knowing that she is part vampire, Max woos her and attempts to bring her to her blood sucking destiny. Even though Rita has strange dreams and actions, Justice, her partner, has feelings for her and does not want her involved with this stranger Max. But it is Rita who must decide her destiny."},
{"imdbId": "tt0115639", "storyLine": "\nNew York based jazz pianist Willie Conway heads back to his small hometown of Knights Ridge, Massachusetts for a high school reunion. The trip is as much to go to the reunion and see his old friends - none of whom left Knights Ridge after graduation - as it is to get away from his current life, at which he is at a crossroads both personally and professionally. He is just eking out a living with his piano playing gigs, and as such he is thinking about taking a sales job. He's also not sure if he's ready to marry his long time girlfriend, lawyer Tracy Stover. Most of Willie's Knights Ridge blue collar friends' best days were in high school, they still having that \"trophy\" mentality of girlfriends and wives. Only Michael \"Mo\" Morris is happily married with a family. Paul Kirkwood, whose room is plastered with magazine pictures of models, wants his waitress ex-girlfriend Jan back only because he knows now that he can't have her. And Tommy \"Birdman\" Rowland, who was the big man in high ..."},
{"imdbId": "tt0115759", "storyLine": "\n\"Broken Arrow\" is the term used to describe a nuclear device that has been lost. In this movie, two nuclear missiles are stolen by rogue US pilot Deakins, but hot on his trail is his co-pilot Hale and a Park Ranger, Terry. The action takes place in Utah's canyon country; a high stakes game of cat and mouse."},
{"imdbId": "tt0113403", "storyLine": "\nOut of work actor Joe volunteers to help try and save his sister's local church for the community by putting on a Christmas production of Hamlet, somewhat against the advice of his agent Margaretta. As the cast he assembles are still available even at Christmas and are prepared to do it on a 'profit sharing' basis (that is, they may not get paid anything) he cannot expect - and does not get - the cream of the cream. But although they all bring their own problems and foibles along, something bigger starts to emerge in the perhaps aptly named village of Hope."},
{"imdbId": "tt0113247", "storyLine": "\nThe film follows three young men and their time spent in the French suburban \"ghetto,\" over a span of twenty-four hours. Vinz, a Jew, Saïd, an Arab, and Hubert, a black boxer, have grown up in these French suburbs where high levels of diversity coupled with the racist and oppressive police force have raised tensions to a critical breaking point. During the riots that took place a night before, a police officer lost his handgun in the ensuing madness, only to leave it for Vinz to find. Now, with a newfound means to gain the respect he deserves, Vinz vows to kill a cop if his friend Abdel dies in the hospital, due the beating he received while in police custody."},
{"imdbId": "tt0111173", "storyLine": "\nLone group of teens, led by recently released joyrider and his disenchanted Belfast girlfriend, strives to leave their mark on \"a British city in the near future\" while attempting to avoid a rival gang. Scenes of joyriding and ram-raiding, which attempt to portray the addictiveness of fast driving whilst also showing the downside (the effect on the community and ultimately death)"},
{"imdbId": "tt0113283", "storyLine": "\nA documentary crew from the BBC arrives in L.A. intent on interviewing Heidi Fleiss, a year after her arrest for running a brothel but before her trial. Several months elapse before the interview, so the crew searches for anyone who'll talk about the young woman. Two people have a lot to say to the camera: a retired madam named Alex for whom Fleiss once worked and Fleiss's one-time boyfriend, Ivan Nagy, who introduced her to Alex. Alex and Nagy don't like each other, so the crew shuttles between them with \"she said\" and \"he said.\" When they finally interview Fleiss, they spend their time reciting what Alex and Nagy have had to say and asking her reaction."},
{"imdbId": "tt0115907", "storyLine": "\nA young boy dies from a stray bullet during a shootout between a cop and mob family member who had previously been supiciously given probabtion, only to break its terms. New York's Deputy Mayor, Kevin Calhoun starts digging for information."},
{"imdbId": "tt0115734", "storyLine": "\nUpon his release from a mental hospital following a nervous breakdown, the directionless Anthony joins his friend Dignan, who seems far less sane than the former. Dignan has hatched a hare-brained scheme for an as-yet-unspecified crime spree that somehow involves his former boss, the (supposedly) legendary Mr. Henry. With the help of their pathetic neighbor and pal Bob, Anthony and Dignan pull a job and hit the road, where Anthony finds love with motel maid Inez. When our boys finally hook up with Mr. Henry, the ensuing escapade turns out to be far from what anyone expected."},
{"imdbId": "tt0117102", "storyLine": "\nMartha is a single woman working at a television talk show. When her younger sister gets married, everyone's wondering when Martha is going to meet Mr. Right and tie the knot. When by chance, Martha meets a handsome stranger named Whitman, the two fall madly in love with each other. But soon Martha discovers little quirks in Whitman... little quirks that become horrifying nightmares. But by the time Martha realizes that she must break up with him, it'll take more than subtle hints to make him go away -- she'll have to get into the most outrageous predicaments to rid herself of Mr. Wrong."},
{"imdbId": "tt0118040", "storyLine": "\nUnsuccessfully framed for his wife's murder, Dr. David Krane attempts to find the real culprit by utilizing a new drug that allows him to experience the memories of other people first-hand. As he gets closer to the truth, the injections begin to take their toll on his life. Additionally, a history of alcoholism, a career crisis, and the involvement of police officers in the murder all conspire to prevent Dr. Crane from learning what really happened. The challenge, then, is for the doctor to overcome these obstacles before his time runs out."},
{"imdbId": "tt0116483", "storyLine": "\nA Hockey player wannabe finds out that he has the most powerful golf drive in history. He joins the P.G.A. tour to make some money to save grandma's house. The downside is that his hocky player mentality doesn't really go on the P.G.A. tour. Especially with the favorite to win the championship."},
{"imdbId": "tt0112579", "storyLine": "\nThe path of Francesca Johnson's future seems destined when an unexpected fork in the road causes her to question everything she had come to expect from life. While her husband and children are away at the Illinois state fair in the summer of 1965, Robert Kincaid happens turn into the Johnson farm and asks Francesca for directions to Roseman Bridge. Francesca later learns that he was in Iowa on assignment from National Geographic magazine. She is reluctant seeing that he's a complete stranger and then she agrees to show him to the bridges and gradually she talks about her life from being a war-bride from Italy which sets the pace for this bittersweet and all-too-brief romance of her life. Through the pain of separation from her secret love and the stark isolation she feels as the details of her life consume her, she writes her thoughts of the four-day love affair which took up three journals. The journals are found by her children after the lawyer was going over Francesca's will and ..."},
{"imdbId": "tt0117110", "storyLine": "\nThe Muppets are back into action in another movie based on a novel written by Robert Louis Stevenson. Kermit the Frog and his colleagues go on a warfare against ruthless pirates. They also share their problem-solving journey on sea to rescue a treasure."},
{"imdbId": "tt0112646", "storyLine": "\nA camera follows model Christy Turlington through the spring fashion shows in Milan, Paris, and New York one year in the early 1990s, probably 1992. She and others dash from one designer's unveilings to another. Extended footage looks at Versace and Armani in Milan, Galliano, Gaultier, and Langerfeld in Paris, and Isaac Mizrahi in New York. With Kate Moss, Naomi Campbell, and Turlington, we see the nature of friendships among models. With the engaging Mizrahi in particular, there's some exploration of the relationship between designer and models."},
{"imdbId": "tt0112573", "storyLine": "\nWilliam Wallace is a Scottish rebel who leads an uprising against the cruel English ruler Edward the Longshanks, who wishes to inherit the crown of Scotland for himself. When he was a young boy, William Wallace's father and brother, along with many others, lost their lives trying to free Scotland. Once he loses another of his loved ones, William Wallace begins his long quest to make Scotland free once and for all, along with the assistance of Robert the Bruce."},
{"imdbId": "tt0075314", "storyLine": "\nTravis Bickle is an ex-Marine and Vietnam War veteran living in New York City. As he suffers from insomnia, he spends his time working as a taxi driver at night, watching porn movies at seedy cinemas during the day, or thinking about how the world, New York in particular, has deteriorated into a cesspool. He's a loner who has strong opinions about what is right and wrong with mankind. For him, the one bright spot in New York humanity is Betsy, a worker on the presidential nomination campaign of Senator Charles Palantine. He becomes obsessed with her. After an incident with her, he believes he has to do whatever he needs to make the world a better place in his opinion. One of his priorities is to be the savior for Iris, a twelve-year-old runaway and prostitute who he believes wants out of the profession and under the thumb of her pimp and lover Matthew."},
{"imdbId": "tt0113326", "storyLine": "\nKeong comes from Hong Kong to visit New York for his uncle's wedding. His uncle runs a market in the Bronx and Keong offers to help out while Uncle is on his honeymoon. During his stay in the Bronx, Keong befriends a neighbor kid and beats up some neighborhood thugs who cause problems at the market. Meanwhile, one of those petty thugs in the local gang stumbles into a criminal situation way over his head. Blinded by greed, his involvement draws his gang, the kid, Keong, and the whole neighborhood into a deadly crossfire. When the lazy cops fail to successfully resolve matters, Keong takes things into his own hands. Needless to say, much spectacular kung-fu and outrageous action sequences follow...."},
{"imdbId": "tt0115645", "storyLine": "\nWhen teenage son Jacob is being accused of murdering his girlfriend, the well-respected and close-knit Ryan family is in turmoil. Jacob flees, father Ben destroys possible evidence, the village community turns hostile and mother Carolyn is forced to temporarily close her doctor's practice. Then Jacob gets arrested and soon finds himself and his family entangled in a web of truth, trust and lies, all on his way to court."},
{"imdbId": "tt0113774", "storyLine": "\nIn a town where half the men die down the coalpit, Margaret MacNeil is quite happy being single. Until she meets Neil Currie, a charming and sincere bagpipe-playing, Gaelic-speaking dishwasher. But no matter what you do, you can't avoid the spectre of the pit forever."},
{"imdbId": "tt0112373", "storyLine": "\nUsing previously unreleased archival material in addition to contemporary interviews, this academy award-winning documentary tells the story of the Frank family and presents the first fully-rounded portrait of their brash and free-spirited daughter Anne, perhaps the world's most famous victim of the Holocaust."},
{"imdbId": "tt0115033", "storyLine": "\nThis film is based on a true story about a British teenager who allegedly poisoned family, friends, and co-workers. Graham is highly intelligent, but completely amoral. He becomes interested in science, especially chemistry, and begins to read avidly. Something of a social misfit, he is fascinated by morbid subjects such as poisons and murder. His family environment is intolerable to him and, in particular, his stepmother torments him. He decides to poison those who annoy him, first with antimony and later with thallium. He smugly thinks himself cleverer than all those around him, but nevertheless he is caught and sentenced to 'rehabilitation' at a psychiatric institution. Once there, he undertakes to deceive the new eminent psychiatrist sent there to 'cure' him, thereby securing his release."},
{"imdbId": "tt0116606", "storyLine": "\nJoe and Lucy are roommates and best friends. Lucy, whose love life is embarrassingly dull, convinces Joe, who is infatuated with a neighbor he's never met, that if they don't have stable romances within a month, they must jump off the Brooklyn Bridge."},
{"imdbId": "tt0114536", "storyLine": "\nRuben and Robby are twin brothers, adopted by Mona, one of the wealthiest - and most eccentric - women in Santa Barbara. Ruben is devoted to Mona, but Robby is more devoted to her money. So when Mona leaves her fortune and estate to Ruben it starts a battle between brothers that soon leads to madness, mayhem, and even attempted murder. On Ruben's side is Lou Perilli an ex-Chicago cop and used car dealer who knows the law - and how to get around it. On Robby's side is ruthless businessman Reed Tyler, who is out to turn a swift profit on Mona's property. Walking a shifty line between them is Eddie Agopian, the family lawyer, who doesn't care which side wins as long as he's on the winner's side. But whether they're stealing big or stealing little, they're all stealing in this hilarious comedy about greed, power... and brotherly love."},
{"imdbId": "tt0106473", "storyLine": "\nThis movie is based on actual events, but it says it is not all about one specific incident. It documents St. Vincent's Orphanage in Canada, where many of the boys suffer physical, emotional, and sexual abuse at the hands of the brothers who run the facility. When the stories are surfaced and a police investigation is begun, religious and political groups work to silence the story to keep it from reaching the public."},
{"imdbId": "tt0103859", "storyLine": "\nMarcus is a successful advertising executive who woos and beds women almost at will. After a company merger, he finds that his new boss, the ravishing Jacqueline, is treating him in exactly the same way. Completely traumatized by this, his work goes badly downhill. But then, Jacqueline's more quietly attractive assistant, Angela, who has been dating Marcus' best friend, shows herself more than a little concerned by his perilous state."},
{"imdbId": "tt0109424", "storyLine": "\nWong Kar-Wai's movie about two love-struck cops is filmed in impressionistic splashes of motion and color. The first half deals with Cop 223, who has broken up with his girlfriend of five years. He purchases a tin of pineapples with an expiration date of May 1 each day for a month. By the end of that time, he feels that he will either be rejoined with his love or that it too will have expired forever. The second half shows Cop 663 dealing with his breakup with his flight attendant girlfriend. He talks to his apartment furnishings until he meets a new girl at a local lunch counter."},
{"imdbId": "tt0114808", "storyLine": "\n\"Dottore\" Joe Moretti travels round Sicily doing screen tests for the big Roman studios. He's a conman and takes money or favours for his efforts. Beata, a young illiterate convent girl desperately wants to change her life and falls for him, belatedly he realises his feelings for her. Their love affair is doomed when he's arrested."},
{"imdbId": "tt0116324", "storyLine": "\nMel Coplin departs on a mission of discovery dragging his wife and 4 month old son behind. He and wife, Nancy, won't agree on a name for their son until adopted Mel gets in touch with his roots. He assures her that once he knows who he really is, the right name for their boy will be a snap. Enlisting the aid of student-psychologist and part-time adoption agent, Tina Kalb, they embark on a journey across the United States to find Mel's \"birth\" mother. \"The best part,\" Mel tells Nancy, \"is it's all free.\" Tina is finishing her dissertation and will film the happy reunion of mother and child as part of her research. For this privilege, she's footing the bill. His adoptive parents are left behind feeling abandoned by an ungrateful son. Clerical errors, mistaken identities, Nancy's misplaced high school friend and his gay lover, and a super-charged libido here and there are thrown into the mix along the way until -- at last -- Mel's real parents, the Schlictings (mispronounced as \"..."},
{"imdbId": "tt0110647", "storyLine": "\nBastian's dream to get a sibling becomes true when his father re-marries, but soon he has trouble with his new stepsister Nicole and with a gang of school bullies, the Nasties. Hiding in the school library, Bastian finds his favorite book of THE NEVERENDING STORY, where it is later found by Slip, the gang leader. The latter recognizes the power of the book and begins to form Fantasia after his bad intentions. When the chaos becomes worse the Child-like Empress requests Bastian to move back to the real world, get the book back and save Fantasia. Accidentally some Fantasia characters travel with him to reality, but get lost in different places. Meanwhile Slip and the other Nasties spread anarchy. Finally, Bastian gets support from Nicole, who begins to believe in the power of Fantasia."},
{"imdbId": "tt0114131", "storyLine": "\nA whimsical saga of a young man whose two life-consuming passions are unraveling traffic gridlock and an avant-garde dancer. A romantic comedy."},
{"imdbId": "tt0112364", "storyLine": "\nThe ten year-old Angela and her little sister Ellie move to an old house in the countryside with her parents Mae and Andrew. Their mother has mental illness and has just left an institution and her husband tries to keep the dysfunctional family together. Angela is an imaginative disturbed girl that might have inherited the illness of her mother and is obsessed by purification to get rid of her sins; and has visions of the fallen angel Lucifer and the Virgin Mary. She leads her little sister in her paranoia and uses a circle of toys and dolls to protect them against evil. They have a crazy neighbor that Angela believes is an angel and she asks the woman how to find the way to heaven. When Mae returns to the institution, Angela becomes uncontrollable in her quest to heaven."},
{"imdbId": "tt0113107", "storyLine": "\nThis is a story of a man (Walker), suffering from dwarfism, who writes an autobiographical account of his life. In flashbacks, we see how he was conceived to a woman (Parillaud) at the end of WWII as she attempts to smuggle herself to America on a troop ship. Caught, she is put ashore back in her homeland of Ireland where she struggles to bring up her dwarfed child. Then comes an ongoing affair with a man (Byrne) who becomes a surrogate father to the boy, teaching him about the stars and planets... and calling him \"Frankie Starlight.\" After that affair she meets with a man (Dillon) who takes her and the boy to America, but they are misfits in the prairie lands of the West and soon return home to Ireland where the boy grows to manhood as a writer."},
{"imdbId": "tt0113451", "storyLine": "\nSomeone does a nasty hatchet job on a San Fransisco big noise and the Assistant D.A. takes charge of the investigation. Through a web of blackmail and prostitution involving the Governor, an old lover of the lawman emerges as a prime suspect and he has to deal with his personal feelings as well as the case."},
{"imdbId": "tt0116130", "storyLine": "\nLt. Cmdr. Tom Dodge is assigned as Captain to the USS Stingray, an old diesel driven submarine that has seen better days. With a crew that consists only of weird guys (and a gal), he's headed against the atomic powered USS Orlando, with the mission to destroy a dummy battleship."},
{"imdbId": "tt0113756", "storyLine": "\nMockumentary look at Playgirl Magazine centerfold and 1992 Man of the Year, Dirk Shafer, who kept it a secret from the magazine that he is gay. Most of the film is a fictionalized retelling of Dirk's decision to send a photograph to Playgirl, his selection as a centerfold and then Man of the Year, his many TV interviews, his friend Vivian Paxton posing as his beard, and the pressures from his live-in lover to come out of the closet. Interspersed with this chronological narrative are a black and white look at an evening Dirk spends with Angela Lucassey, a woman from Reno who wins Playgirl's national contest to have a date with Dirk, and an interview with a stripper who tracks Dirk down."},
{"imdbId": "tt0118055", "storyLine": "\nThis is a telling of the Jessica Savitch story, the newswoman who, in the 1970's, became the \"First Woman Anchor\". Sally/Tally is taken under the wing of Warren in a Miami newsroom and becomes a news star on TV. Despite her love for Warren, she takes the big chance and moves on to Philadelphia, where he follows to rescue her faltering career at the cost of his own - as she rises he falls."},
{"imdbId": "tt0115685", "storyLine": "\nArmand Goldman owns a popular drag nightclub in South Miami Beach. His long-time lover, Albert, stars there as Starina. \"Their\" son Val (actually Armand's by his one heterosexual fling, twenty years before) comes home to announce his engagement to Barbara Keeley, daughter of Kevin Keeley, US Senator, and co-founder of the Committee for Moral Order. The Senator and family descend upon South Beach to meet Val, his father and \"mother.\" What ensues is comic chaos."},
{"imdbId": "tt0112585", "storyLine": "\nThis angst-filled tale of three Irish-Catholic brothers explores men's relationships with women. Three different situations are set up on parallel plotlines, with each brother facing a different kind of crisis. Their common bond as family, as well as close lifelong friends, allows them to express their feelings frankly and intimately, as they talk and discuss their concerns among each other. Jack finds himself in a marriage gone stale and under pressure to start a family that he does not yet feel ready for. Barry, dedicated to his film career and almost pathologically averse to any type of commitment in a relationship, is suddenly artistically successful and finds true love, both for the first time and both pulling him in opposite directions. Patrick is torn between his love for his religion and ethnic heritage and his love for Susan, his longtime Jewish girlfriend. Ultimately, they are all asked to resist temptation of one sort or another, with various poignant outcomes."},
{"imdbId": "tt0112442", "storyLine": "\nMarcus Burnett is a hen-pecked family man. Mike Lowry is a foot-loose and fancy free ladies' man. Both are Miami policemen, and both have 72 hours to reclaim a consignment of drugs stolen from under their station's nose. To complicate matters, in order to get the assistance of the sole witness to a murder, they have to pretend to be each other."},
{"imdbId": "tt0112342", "storyLine": "\nYoung American Ryan Tyler visits his zoologist father on a panda preserve in China while on summer vacation and gets involved in the rescue of a baby panda from unscrupulous poachers who want to murder the cub's mother and sell the baby to a zoo. Ling, a young Chinese girl, and her grandfather help in the rescue which, if successful, will ultimately result in saving the reserve from being shut down by officious bureaucrats."},
{"imdbId": "tt0112461", "storyLine": "\nFilm adaptation of street tough Jim Carroll's epistle about his kaleidoscopic free fall into the harrowing world of drug addiction. As a member of a seemingly unbeatable high school basketball squad, Jim's life centers around the basketball court and the court becomes a metaphor for the world in his mind. A best friend who is dying of leukemia, a coach (\"Swifty\") who takes unacceptable liberties with the boys on his team, teenage sexual angst, and an unhealthy appetite for heroin -- all of these begin to encroach on young Jim's dream of becoming a basketball star. Soon, the dark streets of New York become a refuge from his mother's mounting concern for her son. He can't go home and his only escape from the reality of the streets is heroin for which he steals, robs and prostitutes himself. Only with the help of Reggie, an older neighborhood friend with whom Jim \"picked up a game\" now and then, is he able to begin the long journey back to sanity."},
{"imdbId": "tt0112427", "storyLine": "\nSet right after World War II, a naive teenage girl joins a shabby theatre troupe in Liverpool. During a winter production of Peter Pan, the play quickly turns into a dark metaphor for youth as she becomes drawn into a web of sexual politics and intrigue."},
{"imdbId": "tt0109093", "storyLine": "\nIsabelle is an ex-nun waiting for her special mission from God. In the meantime, she is making a living writing pornography. She meets Thomas, a sweet, confused amnesiac who cannot remember that he used to be a vicious pornographer, responsible for turning his young wife, Sofia, into the world's most notorious porn queen. Sofia's on the run, convinced she's killed him. Together, Isabelle and Thomas set out to discover his past, a past waiting to catch up with him."},
{"imdbId": "tt0112384", "storyLine": "\nBased on the true story of the ill-fated 13th Apollo mission bound for the moon. Astronauts Lovell, Haise and Swigert were scheduled to fly Apollo 14, but are moved up to 13. It's 1970, and The US has already achieved their lunar landing goal, so there's little interest in this \"routine\" flight.. until that is, things go very wrong, and prospects of a safe return fade."},
{"imdbId": "tt0114287", "storyLine": "\nIn the highlands of Scotland in the 1700s, Rob Roy tries to lead his small town to a better future, by borrowing money from the local nobility to buy cattle to herd to market. When the money is stolen, Rob is forced into a Robin Hood lifestyle to defend his family and honour."},
{"imdbId": "tt0112288", "storyLine": "\nKathleen Conklin, a doctoral student in philosophy, finds herself with a new perspective on the nature of evil and humanity after being bitten by a vampire in New York City...."},
{"imdbId": "tt0112462", "storyLine": "\nThe Dark Knight of Gotham City confronts a dastardly duo: Two-Face and the Riddler. Formerly District Attorney Harvey Dent, Two-Face incorrectly believes Batman caused the courtroom accident which left him disfigured on one side; he has unleashed a reign of terror on the good people of Gotham. Edward Nygma, computer-genius and former employee of millionaire Bruce Wayne, is out to get the philanthropist; as The Riddler he perfects a device for draining information from all the brains in Gotham, including Bruce Wayne's knowledge of his other identity. Batman/Wayne is/are the love focus of Dr. Chase Meridan. Former circus acrobat Dick Grayson, his family killed by Two-Face, becomes Wayne's ward and Batman's new partner Robin the Boy Wonder."},
{"imdbId": "tt0061395", "storyLine": "\nSeverine is a beautiful young woman married to a doctor. She loves her husband dearly, but cannot bring herself to be physically intimate with him. She indulges instead in vivid, kinky, erotic fantasies to entertain her sexual desires. Eventually she becomes a prostitute, working in a brothel in the afternoons while remaining chaste in her marriage."},
{"imdbId": "tt0112495", "storyLine": "\nLaura is trying to pick up the pieces of her life after the murder of her husband and son, and goes on vacation with her sister to Burma. After losing her passport at a political rally, she is left on her own for a few days, during which time she falls in with students fighting for democracy. She and their leader, U Aung Ko, travel through Burma, whilst witnessing many bloody acts of repression by the dictatorship, in an attempt to escape to Thailand. Based on a true story."},
{"imdbId": "tt0112541", "storyLine": "\nWayne Wang's follow-up movie to Smoke presents a series of improvisational situations strung together to form a pastiche of Brooklyn's diverse ethnicity, offbeat humor, and essential humanity. Many of the same characters inhabiting Auggie Wren's Brooklyn Cigar Store in Smoke return here to expound on their philosophy of smoking, relationships, baseball, New York, and Belgian Waffles. Most of all, this is a movie about living life, off-the-cuff."},
{"imdbId": "tt0109370", "storyLine": "\nThe US economy is in a rut, and so is the president's approval rating. What we need is a good war, but the Russians aren't interested. Hey -- how about that big polite country to the north? Niagara Falls Sheriff Bud B. Boomer takes this all a bit too seriously, though."},
{"imdbId": "tt0112642", "storyLine": "\nFurious that her late father only willed her his gloomy-looking mansion rather than his millions, Carrigan Crittenden is ready to burn the place to the ground when she discovers a map to a treasure hidden in the house. But when she enters the rickety mansion to seek her claim, she is frightened away by a wicked wave of ghosts. Determined to get her hands on this hidden fortune, she hires afterlife therapist Dr. James Harvey to exorcise the ghosts from the mansion. Harvey and his daughter Kat move in, and soon Kat meets Casper, the ghost of a young boy who's \"the friendliest ghost you know.\" But not so friendly are Casper's uncles--Stretch, Fatso and Stinkie--who are determined to drive all \"fleshies\" away. Ultimately, it is up to Harvey and Kat to help the ghosts cross over to the other side."},
{"imdbId": "tt0112688", "storyLine": "\nStrike is a young city drug pusher under the tutelage of drug-lord Rodney Little, who, when not playing with model trains or drinking Moo for his ulcer, just likes to chill with his brothers near the benches outside the project houses. When a night man at a fast-food restaurant is found with four bullets in his body, Strike's older brother turns himself in as the killer. Det. Rocco Klein doesn't buy the story, however, and sets out to find the truth, and it seems that all the fingers point toward Strike & Rodney."},
{"imdbId": "tt0112715", "storyLine": "\nA megalomaniac C.E.O. sends his son into the dangerous African Congo on a quest for a source of diamonds large enough and pure enough to function as powerful laser communications transmitters (or is it laser weapons?). When contact is lost with his son and the team, his sometime daughter- in-law is sent after them. She is a former CIA operative and, accompanied by gee-whiz gadgetry and a few eccentric characters (including a mercenary, a researcher with a talking gorilla, and a a nutty Indiana-Jones-type looking for King Solomon's Mines), sets out to rescue her former fiancé. What they all discover is that often what we most want turns out to be the source of our downfall."},
{"imdbId": "tt0112740", "storyLine": "\nWhen some Russian rebels takes control of some ICBM's, the Americans mobilize. Among the vessels sent is the nuclear sub, the Alabama. But before they leave they need a new X.O. and among the choices is Commander Hunter, who hasn't seen much action. But the ship's Captain, Ramsey OK's him. While on the way, there was an incident and Hunter disagreed with how Ramsey handled it, it's evident that Ramsey doesn't think much of Hunter because Hunter was college educated while Ramsey worked his way up. They're given orders to attack but when they were in the process of receiving another order, the ship's communications were damaged, so the entire message was not received. Ramsey decides to continue with their previous order while Hunter wants to reestablish contact first. That's when the two men butt heads that ends with Hunter relieving Ramsey. Later when some men die, some of the officers feel that Hunter is not up to the task so they team up to retake control. But Hunter has taken ..."},
{"imdbId": "tt0109508", "storyLine": "\nThis movie chronicles the life and times of R. Crumb. Robert Crumb is the cartoonist/artist who drew Keep On Truckin', Fritz the Cat, and played a major pioneering role in the genesis of underground comix. Through interviews with his mother, two brothers, wife, and ex-girlfriends, as well as selections from his vast quantity of graphic art, we are treated to a darkly comic ride through one man's subconscious mind. As stream-of-consciousness images incessantly flow forth from the tip of his pen, biting social satire is revealed, often along with a disturbing and haunting vision of Crumb's own betes noires and inadequacies. As his acid-trip induced images flicker across our own retinas, we gain a little insight into this complex and highly creative individual."},
{"imdbId": "tt0112851", "storyLine": "\nWith this sequel to his prize-winning independent previous film, \"El Mariachi,\" director Robert Rodriquez joins the ranks of Sam Peckinpah and John Woo as a master of slick, glamorized ultra-violence. We pick up the story as a continuation of \"El Mariachi,\" where an itinerant musician, looking for work, gets mistaken for a hitman and thereby entangled in a web of love, corruption, and death. This time, he is out to avenge the murder of his lover and the maiming of his fretting hand, which occurred at the end of the earlier movie. However, the plot is recapitulated, and again, a case of mistaken identity leads to a very high body count, involvement with a beautiful woman who works for the local drug lord, and finally, the inevitable face-to-face confrontation and bloody showdown."},
{"imdbId": "tt0112857", "storyLine": "\nIt is 1948 in LA and Ezikeal \"Easy\" Rawlins, an African-American World War II veteran, is looking for work. At his friend's bar, he is introduced to a white man, DeWitt Albright, who is looking for someone to help him find a missing white woman assumed to be hiding somewhere in LA's Black community. This woman, Daphane Monet, happens to be the fiancée of a wealthy \"blue blood,\" Todd Carter, who is currently the favorite in the city's mayoralty race. Daphane Monet is known to frequent the Black jazz clubs in LA. Easy, innocently, accepts Albright's offer; however, he quickly finds himself amidst murder, crooked cops, ruthless politicians, and brutalizing hoodlums. This is a Chandler-esque \"who-done-it\" with an African-American theme."},
{"imdbId": "tt0112864", "storyLine": "\nJohn McClane is now almost a full-blown alcoholic and is suspended from the NYPD. But when a bomb goes off in the Bonwit Teller Department Store the police go insane trying to figure out what's going on. Soon, a man named Simon calls and asks for McClane. Simon tells Inspector Walter Cobb that McClane is going to play a game called \"Simon Says\". He says that McClane is going to do the tasks he assigns him. If not, he'll set off another bomb. With the help of a Harlem electrician, John McClane must race all over New York trying to figure out the frustrating puzzles that the crafty terrorist gives him. But when a bomb goes off in a subway station right by the Federal Reserve (the biggest gold storage in the world) things start to get heated."},
{"imdbId": "tt0112887", "storyLine": "\nJordan White and Amy Blue, two troubled teens, pick up an adolescent drifter, Xavier Red. Together, the threesome embark on a sex and violence-filled journey through an America of psychos and quickiemarts.            "},
{"imdbId": "tt0113044", "storyLine": "\nThis romantic story, based on a novel by H.E. Bates and set in late 19th century England, rests on sibling rivalry for the affections of a woman who comes to live with their family by happenstance. In time, she decides to accept the marriage proposal of the youngest of the three sons, to the surprise of all. However, a man whom she had once loved and who had abandoned her (after making false promises) comes back into her life. The appearance of this scoundrel sets into motion a tragic series of events that eventually engulfs everyone."},
{"imdbId": "tt0113071", "storyLine": "\nLancelot lives by the sword. In fact, they're next door neighbours, so teaming up to fight for money comes pretty naturally. Lady Guinevere, on her way to marry King Arthur is ambushed by the evil Sir Malagant. Fortunately Lancelot is lurking nearby and he rescues his future queen. They fall in love, but Guinevere still fancies the idea of wearing a crown, so she honours her promise to Arthur. Can Lady Guinevere remain faithful, or will this Pretty Woman become a lady of the knight?"},
{"imdbId": "tt0113114", "storyLine": "\nWilly the smart and rebellious whale and Jessie the orphaned boy team up to escape Willy's captivity and horrible owner to get back to his pod. Can they succeed with the help of Annie and Glenn Jessie's foster parents, Randolph the spiritual friend of Willy and Jessie, and Rae Willy's trainer?            "},
{"imdbId": "tt0113243", "storyLine": "\nDade Murphy was a hacker even as a kid in Seattle. He got arrested for the computer virus that he planted and was banned from using any computer until the age of 18.Then he moves to New York to meet a group of hackers. He also falls in love with Kate Libby."},
{"imdbId": "tt0113464", "storyLine": "\nJeffrey, a young gay man in New York, decides that sex is too much and decides to become celibate. He immediately meets the man of his dreams and must decide whether or not love is worth the danger of a boyfriend dying."},
{"imdbId": "tt0113481", "storyLine": "\nIn 2021, the whole world is connected by the gigantic Internet, and almost a half of the population is suffering from the Nerve Attenuation Syndrome (NAS).Johnny with an inplanted memory chip in his brain was ordered to transport the over loaded information from Beijing to Newark. While Pharmakom Industries supported by yakuza tries to capture him to get the informaiton back, the Low-tech group led by J-Bone tries to break the missing code to download the cure of NAS which Johnny carries."},
{"imdbId": "tt0113492", "storyLine": "\nIn the year 2139, the Earth has changed into a virtually uninhabitable place called the Cursed Earth. All of the Earth's population have crowded into the cities across the planet, now known as Mega-Cities. The crimes in these Mega-Cities became so violent and so powerful, that the regular justice system was powerless to contain, then it collapsed completely. However, a new justice system came from the ashes, there were three justice systems in one (police, jury and executioner), they were called Judges. In Mega-City One (formerly, New York City), there was a Judge, named Joseph Dredd, who was the toughest and most stringent Judge in history. One day, he was charged with murder, and was tried and sentenced to life in prison because of it."},
{"imdbId": "tt0113500", "storyLine": "\nWhen jobless Tommy Collins discovers that sequestered jurors earn free room and board as well as $5-a-day, he gets himself assigned to a jury in a murder trial. Once there, he does everything he can to prolong the trial and deliberations and make the sequestration more comfortable for himself."},
{"imdbId": "tt0113540", "storyLine": "\nDisturbing, dark, low-budget independent film about teen-agers in New York City. The story focuses on Telly (Leo Fitzpatrick), a teen who has a goal to de-flower as many virgins as he can. When one of his old encounters discovers that she is H.I.V.-positive, after only one encounter with a guy, Telly remains undaunted."},
{"imdbId": "tt0113677", "storyLine": "\nFilm about filmmaking. It takes place during one day on set of non-budget movie. Ultimate tribute to all independent filmmakers.            "},
{"imdbId": "tt0113690", "storyLine": "\nDuring a routine case in L.A., NY private investigator Harry D'Amour stumbles over members of a fanatic cult, who are waiting for the resurrection of their leader Nix. 13 years ago, Nix was gunned down by his best trainee Swann. In the meantime Swann is advanced to a popular illusionist like David Copperfield and is married to the charming Dorothea. She hires D'Amour to protect Swann against the evil cult members. A short time later Swann is killed by one of his own tricks and the occurrences are turning over, and it crackles between Dorothea and D'Amour."},
{"imdbId": "tt0107447", "storyLine": "\nSet in a dreary urban landscape of Edmonton, LOVE AND HUMAN REMAINS is a dark comedy about a group of twentysomethings looking for love and meaning in the '90s. The film focuses on roommates David, a gay waiter who has has given up on his acting career, and Candy, a book reviewer who is also David's ex-lover. David and Candy's lives are entangled with those of David's friends (a busboy, a psychic dominatrix, and a misogynistic civil-servant) and Candy's dates (a male bartender and a lesbian schoolteacher). Meanwhile, a serial killer menaces the concrete and asphalt neighbourhood in which David and Candy live."},
{"imdbId": "tt0113729", "storyLine": "\nThe high-school student Matt Leland lives with his twin brother and sister and his father in a house by the lake. When the teenager Casey Roberts moves to the house on the other side of the lake, Matt snoops into her room with his telescope. They meet each other and soon they fall in love with each other. One day, Matt is taking a test at school and Casey activates the fire alarm to stop the test. She is suspended and her father decides to check her into a psychiatric institution. However Matt breaks her out of the hospital. They travel in Matt's car and have lots of fun until the day Matt discovers that Casey has bipolar disorder with periods of depression and periods of elevated mood. When she tries to commit suicide, Matt realizes that she needs specialized help."},
{"imdbId": "tt0113749", "storyLine": "\nBrodie Bruce, a Sega and comic book obsessed college student, and his best friend, TS Quint, are both dumped by their girlfriends on the same day, and to deal with their loss, they both go to the local mall. Along the way, they meet up with some friends, including Willam, a guy who stares at Magic Eye pictures, desprately trying to see the hidden image; Gwen, one of TS's ex-girlfriends; and Jay & Silent Bob, of Clerks fame. Eventually, they decide to try and win back their significant others, and take care of their respective nemesises (TS's girlfriend's father, and a store clerk who hates the two for not having any shopping agenda)."},
{"imdbId": "tt0113820", "storyLine": "\nSix teenagers Tommy, Kimberly, Adam, Billy, Rocky and Aisha have discovered the power to fight the forces of evil. A giant egg is unearthed in Angel Grove. Lord Zedd and Rita Repulsa investigate the egg, and release the creature inside - Ivan Ooze, whom Zordon had trapped him inside the egg six thousand years ago. Once released, Ooze left to seek revenge on Zordon. And now Zordon in his crystalline deathbed is dying because he has no power, without the power then Zordon of Eltar will never existed. Now the fate of the universe is in their hands. But this time the Power Rangers head for a distant planet to meet up with a bikini-clad warrior babe named Dulcea who imparts ancient wisdom and power. But now that they have their powers back and becomes Power Rangers once more they will now get back to business and defeat Ivan Ooze at all costs."},
{"imdbId": "tt0110604", "storyLine": "\nBilly Hughes, a mute makeup artist working on a slasher film being shot in Moscow, is locked in the studio after hours. While there she witnesses a brutal murder, and must first escape capture at that time, then keep from being killed before convincing authorities of what she's seen. Plot twists galore follow as Billy tries to stay alive."},
{"imdbId": "tt0110620", "storyLine": "\nThis ultra-hip, post-modern vampire tale is set in contemporary New York City. Members of a dysfunctional family of vampires are trying to come to terms with each other, in the wake of their father's death. Meanwhile, they are being hunted by Dr. Van Helsing and his hapless nephew. As in all good vampire movies, forces of love are pitted against forces of destruction."},
{"imdbId": "tt0113957", "storyLine": "\nAngela Bennett's a software engineer type who works from home and has few friends outside of cyberspace. Taking her first vacation in years, she becomes embroiled in a web of computer espionage."},
{"imdbId": "tt0113986", "storyLine": "\nSamuels life is perfect. That is, until he finds out his girlfriend is pregnant. Now he must face the issues that come with being an expecting father, in a most entertaining way."},
{"imdbId": "tt0114095", "storyLine": "\nMary is a free-spirited young woman with a run-down New York apartment and a high fashion wardrobe. She calls her godmother, a librarian, for bail money after being arrested for throwing an illegal party. To repay the loan, she begins working as a library clerk. At first she hates it, but when challenged decides to master the Dewey Decimal System and become a great library clerk, while romancing a falafel vendor and helping her roommate in his goal to become a professional DJ."},
{"imdbId": "tt0114194", "storyLine": "\n\"Some people lose their faith because Heaven shows them too little,\" says Thomas Daggett. \"But how many people lose their faith because Heaven showed them too much?\" Daggett nearly became a priest; now he's a cop. He may want to put religion behind him, but one morning a weird, eyeless, hermaphroditic corpse turns up. Suddenly he is on a path that will put him right in the middle of a war in Heaven. And once again, Heaven will show him too much: gore, blood, charred flesh, living corpses and much worse. Even more central to the heavenly war effort is a young girl. This American Indian child has something Gabriel wants. And Gabriel is willing to kill her and anyone in his path - or even reanimate a corpse or two - to get it."},
{"imdbId": "tt0114241", "storyLine": "\nOn Christmas Eve, a regretful husband admits to his high-spirited wife that he has hired a contract killer to take her out. She immediately flees. A nice couple offers her shelter, but everyone have dark secrets in this wacky movie.            "},
{"imdbId": "tt0114323", "storyLine": "\n\"Safe\" has been described as a horror movie of the soul, a description that director Todd Haynes relishes. California housewife Carol White seems to have it all in life: a wealthy husband, a beautiful house, servants, beauty, and a lot of friends. The only thing she lacks is a strong personality: Carol seems timid and empty during all of her interactions with the world around her. At the beginning of the film, one would consider her to be more safe in life than just about anyone. That doesn't turn out to be the case. Starting with headaches and leading to a grandmal seizure, Carol becomes more and more sick, claiming that she's become sensitive to the common toxins in today's world: exhaust, fumes, aerosol spray, etc. She pulls back from the sexual advances of her husband and spends her nights alone by the TV or wandering around the outside of her well-protected home like an animal in a cage. Her physician examines her and can find nothing wrong. An allergist finds that she has an ..."},
{"imdbId": "tt0114345", "storyLine": "\nIn 1666 in the Massachusetts Bay colony, Puritans and Algonquian have an uneasy truce. Hester arrives from England, seeking independence. Awaiting her husband, she establishes independence, fixing up a house, befriending Quakers and other outsiders. Passion draws her to a young pastor. He feels the same; when they learn her husband has probably died at the hands of Indians, they consummate their love. A child is born, and on the day Hester is publicly humiliated and made to wear a scarlet letter, her husband appears after a year with Indians. Calling himself Chillingworth, he seeks revenge, searching out Hester's lover and stirring fears of witchcraft. Will his murderous plot succeed?"},
{"imdbId": "tt0114436", "storyLine": "\nNomi Malone, a mysterious young girl with the ambition to dance embarks on a journey to Las Vegas to become a showgirl in a high-class hotel show. There she meets Molly, a seamstress at the Stardust Hotel and the two quickly become good friends. She gets a job as a lap dancer at the seedy Cheetah Club but after a chance meeting with Cristal Connors, the star of Goddess, the current show at the hotel where Molly works, Nomi manages to secure an audition for a spot on the chorus line.However she soon realises that fame comes with a price as her friendships, her morals and her soul are put to the test as she works her way up the ladder and eventually becomes the star of the show, stealing Cristal's part. She begins to wonder if all of her work was for nothing and if she can reclaim her life back before it is too late."},
{"imdbId": "tt0114478", "storyLine": "\nThe plot of this movie, like smoke itself, drifts and swirls ethereally. Characters and subplots are deftly woven into a tapestry of stories and pictures which only slowly emerges to our view. This film tries to convince us that reality doesn't matter so much as aesthetic satisfaction. In Auggie's New York smoke shop, day by day passes, seemingly unchanging until he teaches us to notice the little details of life. Paul Benjamin, a disheartened and broken writer, has a brush with death that is pivotal and sets up an unlikely series of events that afford him a novel glimpse into the life on the street which he saw, but did not truly perceive, every day. Finally, it's Auggie's turn to spin a tale...."},
{"imdbId": "tt0114496", "storyLine": "\nGrace Bichon, who is managing her father's riding-stable, discovers that her husband Eddie deceives her with another woman. After confronting him in the middle of the night on the streets of their small home town, she decides to stay at her sister Emma Rae's house for a while, to make up her mind. Breaking out of her everyday life, she starts to question the authority of everyone, especially her father's, thus causing a stir in her parent's marriage, too."},
{"imdbId": "tt0114508", "storyLine": "\nIn 1993, the Search for Extra Terrestrial Intelligence Project receives a transmission detailing an alien DNA structure, along with instructions on how to splice it with human DNA. The result is Sil, a sensual but deadly creature who can change from a beautiful woman to an armour-plated killing machine in the blink of an eye. Government agent Xavier Fitch assembles a team of scientists and mercenaries to locate and destroy Sil before she manages to find a mate and breed."},
{"imdbId": "tt0114558", "storyLine": "\nSet in the year 1999 during the last days of the old millennium, the movie tells the story of Lenny Nero, an ex-cop who now deals with data-discs containing recorded memories and emotions. One day he receives a disc which contains the memories of a murderer killing a prostitute. Lenny investigates and is pulled deeper and deeper in a whirl of blackmail, murder and rape. Will he survive and solve the case?"},
{"imdbId": "tt0058450", "storyLine": "\nTold in four acts, the lives of Geneviève Emery and Guy Foucher of Cherbourg France are presented. Act 1 begins in November 1957, when sixteen year old Geneviève, who works in her widowed mother's umbrella shop called \"Les parapluies de Cherbourg\", and twenty year old Guy, who works as a mechanic at a gas station, are madly in love and want to get married. They are reluctant to tell anyone not only of their want to get married, but of their relationship. Geneviève believes her mother will think her too young, and would want her to marry someone with better prospects, especially considering her own tenuous financial situation. And Guy is more concerned now about not abandoning his ailing godmother, Aunt Élise, who raised him, and who he looks after along with a young woman named Madeleine. Act 2, told largely from Geneviève's perspective, begins in February 1958. Guy, drafted to fight for the French in Algeria, has been gone for two months, and is expected to be gone for two years. ..."},
{"imdbId": "tt0114666", "storyLine": "\nJohn Netherwood and his wife Leann are fugitives who are both wanted for murder. They have a young daughter named Janie. John and Leann are in the process of robbing a house when the two residents of the house show up. John kills the two residents and heads back to the car with Leann - only to discover the police waiting for them. John and Leann get away after a cop shoots John, and Janie is placed up for adoption. Janie is soon adopted by southern California carpenter Russell Clifton and his wife Dana - and what they don't know is that they're in for the fight of their lives. John and Leann are trying to locate Janie and will stop at nothing to find her, even if it means killing whoever is in their way. When John and Leann discover that Janie was adopted by Russell and Dana, they plot to kill Russell and Dana and take Janie, but one thing they don't expect is for Russell and Dana to fight back with all they've got, because Russell and Dana are willing to do whatever it takes to hold ..."},
{"imdbId": "tt0114663", "storyLine": "\nWhen Jane Holman is driving with her two sons, Tom and Gunny, she accidentally runs into a drifter, named Jack McCloud, who breaks his leg. Feeling sorry for him, Jane invites Jack and his dog Betty Jane to stay at her home until his leg has healed. After having some difficulties to adapt to this new lifestyle, Jack soon finds himself loved by the family and they all want him to stay. When he starts teaching baseball to Tom, who misses his father who's missing in the Korean War, the two of them develop a strong bond. Meanwhile Gunny believes that there's more to Jack and Betty Jane than meets the eye, and he's determined to find out!"},
{"imdbId": "tt0114702", "storyLine": "\nIn 1871, Paul Verlaine (1844-1896), an established poet, invites boy genius Arthur Rimbaud (1854-1891) to live with Paul and his young pregnant wife, Mathiltde, in her father's home in Paris. Rimbaud's uncouth behavior disrupts the household as well as the insular society of French poets, but Verlaine finds the youth invigorating. Stewed in absinthe and resentment, Verlaine abuses Mathiltde; he and Rimbaud become lovers and abandon her. There are reconciliations and partings with Mathiltde and partings and reconciliations with Rimbaud, until an 1873 incident with a pistol sends one of them to prison. Codas dramatize the poets' final meeting and last illnesses."},
{"imdbId": "tt0114682", "storyLine": "\nAfter jointly winning a local drag queen pageant in New York City, Noxeema Jackson and Vida Boheme win the right and are given the round trip airfare to compete in the Drag Queen of America pageant in Hollywood, California. Noxeema sees herself as the next "},
{"imdbId": "tt0114781", "storyLine": "\nSeal Team Commander Casey Ryback has retired from the Navy since the conclusion of the events in the first movie, and is now a chef at the Mile High Cafe in Denver, Colorado. Ryback is taking his niece Sarah Ryback on vacation, to reconnect and commiserate with her after the death of her parents. They board a train traveling westbound through the Rocky Mountains from Denver to LA. With the help of gun-for-hire Marcus Penn a couple dozen of his mercenaries, ex-CIA brain (and mentally unstable) Travis Dane commandeers the train, takes the passengers and crew hostage, and sets up a mobile control center. He hacks into the CIA database and gains control of a Top-Secret defence satellite he designed during his Agency days that has just been deployed. Funded by various foreign interests, he stands to make 1 billion dollars for using the space weapon to blow up the Eastern seaboard by targeting a nuclear reactor housed beneath the Pentagon. Dane taunts the Joint Chiefs in the Pentagon ..."},
{"imdbId": "tt0114798", "storyLine": "\nSteven Lidz, unhappy with his home life since his mother got sick, goes and lives with his two crazy Uncles. There he changes and gets closer to his Uncles, but his parents want him home even though he is finally happy and popular."},
{"imdbId": "tt0114805", "storyLine": "\nIsaac Mizrahi, one of the most successful designers in high fashion, plans his fall 1994 collection. He combines inspirations such as the Hollywood Eskimo look, the Mary Tyler Moore show, and Ouija-derived advise like \"dominatrix mixed with Hitchcock\" into a well-received collection. A behind-the-scenes look at the creative side of fashion."},
{"imdbId": "tt0114887", "storyLine": "\nA Walk in the Clouds depicted a story about a young-married US military soldier, named Paul, who returned home after the World War II. In the middle of the way back home, he accidentally met a girl named Victoria who finished her master's degree. She has not married yet but got pregnant by accident. During the journey they talked a lot. Due to her pregnancy, Victoria was afraid of her father who respected old Mexican tradition. Thus, Paul proposed to pose as her husband to help her face her dad. Paul was not intended to cheat on his wife by pretending to be Victoria's husband. However, when Paul decided to come back to his home and left Victoria, he found his wife cheating on him. Paul then headed back to Victoria's house \"Las Nubes\" and confessed his true love to Victoria."},
{"imdbId": "tt0114898", "storyLine": "\nThe polar ice caps have melted, and the earth is covered by water. The remaining people travel the seas, in search of survival. Several different societies exist. The Mariner falls from his customary and solitary existence into having to care for a woman and a young girl while being pursued by the evil forces of the Deacon."},
{"imdbId": "tt0114928", "storyLine": "\nThe story takes place in alternative America where the blacks are members of social elite, and whites are inhabitants of inner city ghettos. Louis Pinnock is a white worker in a chocolate factory, loving husband and father of two children. While delivering a package for black CEO Thaddeus Thomas, he is mistaken for a voyeur and, as a result, loses his job, gets beaten by black cops and his family gets evicted from their home. Desperate Pinnock takes a gun and kidnaps Thomas, demanding justice."},
{"imdbId": "tt0109340", "storyLine": "\nAndrew Crocker-Harris is an embittered and disliked teacher of Greek and Latin at a British public school. After nearly 20 years of service, he is being forced to retire on the pretext of his health, and perhaps may not even be given a pension. The boys regard him as a Hitler, with some justification. His wife Laura is unfaithful, and lives to wound him any way she can. Andrew must come to terms with his failed life and regain at least his own self-respect."},
{"imdbId": "tt0111579", "storyLine": "\nRussia, 1936: revolutionary hero Colonel Kotov is spending an idyllic summer in his village with his young wife and six-year-old daughter Nadia and other assorted family and friends. Things change dramatically with the unheralded arrival of Cousin Dmitri from Moscow, who charms the women and little Nadia with his games and pianistic bravura. But Kotov isn't fooled: this is the time of Stalin's repression, with telephone calls in the middle of the night spelling doom - and he knows that Dmitri isn't paying a social call..."},
{"imdbId": "tt0110882", "storyLine": "\nThe circularity of violence seen in a story that circles on itself. In Republic of Macedonia, during war in Bosnia, Christians hunt an ethnic Albanian girl who may have murdered one of their own. A young monk who's taken a vow of silence offers her protection. In London, a photographic editor who's pregnant needs to talk it out with her estranged husband and chooses a toney restaurant. She wants permanence with her lover, a prize-winning Macedonian photographer just back from Bosnia, changed by the violence. He leaves abruptly for his village; he's not visited it in 16 years. There he tries to ignore bitter divisions between his Orthodox brethren and local Albanians, then tries to transcend them."},
{"imdbId": "tt0112471", "storyLine": "\nAmerican tourist Jesse and French student Celine meet by chance on the train from Budapest to Vienna. Sensing that they are developing a connection, Jesse asks Celine to spend the day with him in Vienna, and she agrees. So they pass the time before his scheduled flight the next morning together. How do two perfect strangers connect so intimately over the course of a single day? What is that special thing that bonds two people so strongly? As their bond turns to love, what will happen to them the next morning when Jesse flies away?"},
{"imdbId": "tt0112508", "storyLine": "\nBilly Madison is a 27 year-old man whose father Brian is the head of a major hotel chain. Even though he is groomed to replace his father who is about to retire, Billy is extremely immature and unmotivated in life. When Brian considers making Eric Gordon (whom Billy despises) his new replacement, Billy decides to prove to his father that he is capable of taking over. He must repeat grade school all over again (2 weeks for each grade) in order to take over the hotel empire. The further Billy progresses, the more Eric tries to derail Billy."},
{"imdbId": "tt0112438", "storyLine": "\nA teenage girl babysits two young kids while the parents go out to a party. Her boyfriend is coerced (with the help of alcohol) by an old 'friend' into going to the house. Both boys are obsessed with the babysitter, as is the father of the two children. The story basically shows the effects drink has on different people."},
{"imdbId": "tt0112571", "storyLine": "\nJane is a night club singer, out of work. Robin is a quirky real estate agent looking for a ride-share to accompany her to California. Her advertisement is answered by Jane, who at first was uncertain about her. A stop in Pittsburgh picks up a third, Holly, escaping a violent and drug-dealing partner. Girls on the road, reaching understanding, respect, and care for each other. But this trio is different - Jane a lesbian, Robin suffering with AIDS, Holly running from her past, seeking one-night stands and a good man."},
{"imdbId": "tt0112757", "storyLine": "\nDexter, age 11, who has AIDS, and his next door neighbor Erik, a little older and much bigger, become best friends. Erik also becomes closer to Dexter's mother than to his own, who is neglectful and bigoted and violently forbids their friendship upon learning of it. When they read that a doctor in distant New Orleans claims to have found a cure for AIDS, the boys leave home on their own, planning to float down the Mississippi river and find him."},
{"imdbId": "tt0112643", "storyLine": "\nA troubled couple and their blind daughter come to Italy to visit a 12th Century castle they've inherited. Soon they are plagued by unexplained noises, mysteriously broken objects, and the daughter's claims of an unknown nocturnal visitor to her bedroom. When the housekeeper and a local prostitute and are discovered savagely murdered in the castle's dungeon, John must unlock the castle's secret to save himself from jail and his family from the castle's secret inhabitant."},
{"imdbId": "tt0112679", "storyLine": "\n'Circle Of Friends' is set in 1950's Ireland. The movie focuses on Benny Hogan and her best friend, Eve Malone. The story centers around Benny and Eve as they enter student life at University College, Dublin. Here Benny and Eve reunite with their childhood friend, the ice-cool Nan Mahon, the 'college belle'. They also encounter the handsome and charming Jack Foley, whom Benny quickly falls for."},
{"imdbId": "tt0109445", "storyLine": "\nDante Hicks is not having a good day. He works as a clerk in a small convenience store and is told to come into work on his day off. Dante thinks life is a series of down endings and this day is proving to no different. He reads in the newspaper that his ex-girlfriend Caitlin is getting married. His present girlfriend reveals to have somewhat more experience with sex that he ever imagined. His principal concerns are the hockey game he has that afternoon and the wake for a friend who died. His buddy Randal Graves works as a clerk in the video store next and he hates his job just about as much as Dante hates his."},
{"imdbId": "tt0112883", "storyLine": "\nWell-respected psychiatrist Dr. Jack Mickler is only 10 days away from his retirement. A week before he is due to leave, he encounters a young man who attempts suicide--would be a pretty straightforward case except the young man claims to be Don Juan, the fabled Spanish nobleman and world renowned seducer/lover of woman. Despite original hostility from his co-workers, Jack manages to persuade his associates to put the youth in his care for 10 days after which the youth will undergo an evaluation to be either released from psychiatric care or sent to a mental institution. However, as the 10 days progresses, Dr. Mickler and the other staff become gradually drawn into to the young man's exotic world of love, passion and pleasure as he recounts his story to them. Whilst doing so the man's philosophies and zeal for life and love begins to revive Dr. Mickler's somewhat passionless relationship with his wife, Marilyn as well as challenging his own views and ethics to the point where both he ..."},
{"imdbId": "tt0109635", "storyLine": "\nSexual harassment is the theme, but here it is the man who is harassed by his new female boss. A high-flying executive, Meredith, is out to ruin her former lover, who she's just beaten to the top job in an electronics company, using every trick in the book."},
{"imdbId": "tt0109676", "storyLine": "\nA team of skydiving crooks led by DEA-agent-turned-bad Busey specialize in landing on police roofs and breaking in so their evil computer nerd can steal undercover agents' files and sell them to drug lords. Federal Marshal Snipes lost a brother to this crew and learns skydiving with the help of tough-but-lovable instructor Butler so he can track them down. DIE HARD meets PASSENGER 57 meets CLIFFHANGER."},
{"imdbId": "tt0112854", "storyLine": "\nJohnny Destiny burns into Las Vegas in his hot Plymouth RoadRunner, stopping only to pick up a stranger stranded in the desert. But then, things aren't always as they seem. Anything can happen in that town of many possibilities...especially since there's been some weird electrical disturbances. As the stranger, fresh out of prison, tries to put his life back together--to recover his money from an old bank heist and the girl he lost in doing the job--something keeps interfering with his plans. Is it fate...or just Destiny?"},
{"imdbId": "tt0109579", "storyLine": "\nPaulina Escobar is a political activist whose husband is a prominent lawyer in an unnamed South American country just out of a dictatorship. One day a storm forces her husband to ride home with a neighbor. That chance encounter brings up demons from her past, as she is convinced that the neighbor (Dr. Miranda) was part of the old fascist regime that tortured and raped her, while blindfolded. Paulina takes him captive to determine the truth. Paulina is torn between her psychological repressions and somber memory, Gerardo is torn between his wife and the law, and Dr. Miranda is forced to endure captivity while husband and wife seek out the uncertain truth about the clouded past."},
{"imdbId": "tt0109642", "storyLine": "\nDolores Claiborne works as a maid for a wealthy woman in remote Maine. When she is indicted for the elderly woman's murder, Dolores' daughter Selena returns from New York, where she has become a big-shot reporter. In the course of working out the details of what has happened, as well as some shady questions from the past and Selena's troubled childhood, many difficult truths are revealed about their family's domestic strife. This is cleverly portrayed with present reality shot in cool blue tones blending seamlessly into flashbacks shot in vivid color. As small town justice relentlessly grinds forward, surprises lie in store for the viewers...."},
{"imdbId": "tt0109686", "storyLine": "\nHarry and Lloyd are two good friends who happen to be really stupid. The duo set out on a cross country trip from Providence to Aspen, Colorado to return a briefcase full of money to its rightful owner, a beautiful woman named Mary Swanson. After a trip of one mishap after another, the duo eventually make it to Aspen. But the two soon realize that Mary and her briefcase are the least of their problems."},
{"imdbId": "tt0111797", "storyLine": "\nSenior Master Chef Chu lives in a large house in Taipei with his three unmarried daughters, Jia-Jen, a chemistry teacher converted to Christianity, Jia-Chien, an airline executive, and Jia-Ning, a student who also works in a fast food restaurant. Life in the house revolves around the ritual of an elaborate dinner each Sunday, and the love lives of all the family members."},
{"imdbId": "tt0109759", "storyLine": "\nThis psychological thriller is true to its subjects as well as being complex, dynamic, and overly dramatic. How something so long ago, seemingly trivial, years later with more significant trauma, turns repressed emotions into a dysfunctional life and distorted thinking. This is all merged into a psychological menagerie that unfolds piece by piece to perfection."},
{"imdbId": "tt0109758", "storyLine": "\nElliot is going to the island of Eden to live out his submissive fantasies, but inadvertently photographs diamond smugglers at work. Smugglers, and detectives, follow him to the island, where they try to retrieve the film. Elliot begins falling in love with Lisa, the head mistress of the island, and Lisa must evaluate her feelings about Elliot and her own motivations."},
{"imdbId": "tt0109707", "storyLine": "\nBecause of his eccentric habits and bafflingly strange films, director "},
{"imdbId": "tt0113117", "storyLine": "\nKate and Charlie have a perfect life planned out before them: buying a house, marriage, kids, the whole works. Kate's fear of flying keeps her in Canada while Charlie goes to Paris for a medical convention. While there Charlie is smitten by the lovely Juliette. He calls off the wedding with Kate and she nervously boards a plane to get him back. She ends up sitting next to the petty French thief Luc Teyssier. He hides a stolen necklace and smuggled grape vine in her bag to get it through customs. Her bag is stolen, the necklace apparently lost, and Kate and Luc head to Cannes -- Luc to find the necklace and Kate get Charlie back. Along the way, Kate and Luc begin having feelings for each other -- which change the course of their lives."},
{"imdbId": "tt0113097", "storyLine": "\nMickey Gordon is a basketball referee who travels to France to bury his father. Ellen Andrews, an American living in Paris, works for the airline Mickey flies on. They meet and fall in love, but their relationship goes through many difficult patches. The story is told in flashback by their friends at a restaurant waiting for them to arrive."},
{"imdbId": "tt0113028", "storyLine": "\nTeenage Angus adopts a stray dog and names him Yellow. Several days later, while traveling along the coast of British Columbia with Angus' father, John, the boy and dog become stranded when turbulent waters capsize their boat. Angus's parents relentlessly badger rescue teams. Angus, schooled by his father in wilderness survival skills, and assisted by the intelligent Yellow Dog, tries to attract rescuers."},
{"imdbId": "tt0113198", "storyLine": "\nIt's the last day of school, and Max wants to catch the eye of Roxanne, one of the more attractive girls in school. But how can you be cool when your dad's Goofy? Stage an impromptu concert at the final assembly, that's how! Or at least it sounded good until Principal Mazer found out. Goofy finds out about his son's antics (sort of), and decides a fishing trip, like his dad took him on, is the solution. Of course, he doesn't know that Max finally lands a date with Roxanne for a party thrown by the class valedictorian. Through the movie, Goofy tries to bring Max out of his shell, while Max resents being taken away, and lying to Roxanne about the trip (he tells her he & his dad will be appearing on TV at the PowerLine concert in LA). Will Max sink or swim? Will Goofy goof up his son's first shot at romance? Will Bigfoot step back? And what about those nuns?"},
{"imdbId": "tt0113303", "storyLine": "\nHatch Harrison had a traffic accident with his car. At first the doctors said he was dead but then they succeeded to bring him back to life after two hours. But Hatch starts to have strange sensations in following time and discovers that he is now united with a mad killer who had entered his mind during his death."},
{"imdbId": "tt0113089", "storyLine": "\nAfter a man dies in a car crash, he is reincarnated as a dog and attempts to reconnect with his family.            "},
{"imdbId": "tt0109771", "storyLine": "\nFarinelli, is the artistic name of Carlo Broschi, a young singer in Handel's time. He was castrated in his childhood in order to preserve his voice. During his life he becomes to be a very famous opera singer, managed by his mediocre brother (Riccardo)."},
{"imdbId": "tt0113199", "storyLine": "\nThis is the story of a talking cute piglet named Gordy, who gets involved in a big quest to save his family from the slaughterhouse, where no pigs have ever returned. And it's all up to him to find and save them before they get turned into sausage!"},
{"imdbId": "tt0113234", "storyLine": "\nIn this offshoot of the 1950s \"claymation\" cartoon series, the crazy Blockheads threaten to ruin Gumby's benefit concert by replacing the entire city of Clokeytown with robots."},
{"imdbId": "tt0109906", "storyLine": "\nJ.J. is a rookie in the Sheriff's Department and the first black officer at that station. Racial tensions run high in the department as some of J.J.'s fellow officers resent his presence. His only real friend is the other new trooper, the first female officer to work there, who also suffers similar discrimination in the otherwise all-white-male work environment. When J.J. becomes increasingly aware of police corruption during the murder trial of Teddy Woods, who he helped to arrest, he faces difficult decisions and puts himself into great personal danger in the service of justice."},
{"imdbId": "tt0110057", "storyLine": "\nThis documentary follows two young African-Americans through their high school years as they perfect their skills in basketball in the hopes of getting a college scholarship and eventually play in the NBA. Arthur Agee and William Gates both show great potential and are are actively recruited as they look to enter high school. They start off at the same high school but unable to pay an unexpected bill for tuition fees, Arthur has to withdraw and go to the local public high school. The film follows them through their four years of high school and their trials and tribulations: injuries, slumps and the never ending battle to maintain their grades. Through it all, their hoop dreams continue."},
{"imdbId": "tt0110005", "storyLine": "\nBased on the true story of Juliet Hulme and Pauline Parker, two close friends who share a love of fantasy and literature, who conspire to kill Pauline's mother when she tries to end the girls' intense and obsessive relationship."},
{"imdbId": "tt0110066", "storyLine": "\nKevin Franklin is a con man whose mouth is bigger than him, but it doesn't help him much when he's in with the mob for $50,000. Trying to avoid a gambling addict boss, and his two stupid henchmen, Kevin poses as a childhood friend to Gary Young, a workaholic father whose own life is in turmoil in an affluent Pennsylvania suburb."},
{"imdbId": "tt0110116", "storyLine": "\nThe life and death of the legendary Ludwig van Beethoven. Besides all the work he is known for, the composer once wrote a famous love letter to a nameless beloved, and the movie tries to find out who this beloved was--not easy, as Beethoven has had many women in his life."},
{"imdbId": "tt0110006", "storyLine": "\n11-year-old Gerald \"Gerry\" Garner lives in Long Island, New York, and he's overweight. Gerry's parents Maury and Mrs. Garner decide to send Gerry to Camp Hope, a camp for overweight boys. The camp is owned by kindly Harvey Bushkin and his equally kind wife Alice Bushkin. When the Bushkins file for bankruptcy the camp has to be sold, it is bought by a wacko named Tony Perkis. Tony plans to force the campers to lose as much weight as they can, and he also intends to document the marathon shedding of weight and use it for an infomercial for his slenderizing program. In the eyes of the campers, Tony has made Camp Hope a living hell. As Gerry and counselor Pat Finley lead the efforts to overthrow Tony, the campers prepare for the Apache Relay against arch rival Camp MVP. The Apache Relay is a kind of race in which Camp Hope has never defeated Camp MVP before."},
{"imdbId": "tt0113360", "storyLine": "\nPaul is on a business trips to Nagoya, as a computer-chip executive from New York, when he meets a beautiful and mysterious woman. Later, he finds himself in the wrong place at the wrong time, inadvertently interrupting an assassination by a feared Ninja-cult. As he is now the only man to have seen the face of the cult's warrior-leader and lived, he soon realizes that he is facing a markedly foreshortened life-expectancy. Teaming up with a friendly samurai couple, on a two-centuries-old blood-feud with the Ninja, he struggles to survive. Finally, recuperating on an island-fortress, he learns swordsmanship, and perhaps, a little about courage, honor, love, and loyalty. The requisite final confrontation is rife with bloody swordplay and spectacular martial-arts action sequences."},
{"imdbId": "tt0110099", "storyLine": "\nEdward Walters, an auto mechanic, falls for the intelligent and beautiful Catherine Boyd. It is love at first sight. There is however a problem, she's engaged to jerk James Moreland. Fortunately, Catherine's uncle likes Ed, and with his friends they scheme to make Catherine fall for Ed. The comedy in this movie stems from the fact that Catherine's uncle is none other than Albert Einstein, who's portrayed as a fun loving genius, as are his mischievous colleagues, Nathan, Kurt and Boris."},
{"imdbId": "tt0110148", "storyLine": "\nIt hasn't even been a year since a plantation owner named Louis lost his wife in childbirth. Both his wife and the infant died, and now he has lost his will to live. A vampire named Lestat takes a liking to Louis and offers him the chance to become a creature of the night: a vampire. Louis accepts, and Lestat drains Louis' mortal blood and then replaces it with his own, turning Louis into a vampire. Louis must learn from Lestat the ways of the vampire."},
{"imdbId": "tt0113463", "storyLine": "\nOne of the obsessive speculations in American history is whether Thomas Jefferson, in the years before he became president, had an affair with (and fathered a child with) his 15-year-old slave Sally Hemings. JEFFERSON IN PARIS follows Jefferson to France (as the U.S. ambassador to the court of Louis XVI), following the death of his wife his friendships and flirtations with the French, his relationship with his daughters and slaves from home (especially Sally), against the backdrop of the beginning of the French Revolution."},
{"imdbId": "tt0110189", "storyLine": "\nWhen two unemployed telephone pranksters decide to use their vocal \"talents\" to impersonate a Chicago mob boss and curry favor with organized crime in New York, the trouble begins. It isn't long before Johnny and Kamal (the \"Jerky Boys\" of crank call fame) are wanted by the local mafia, the police, and their neighbor."},
{"imdbId": "tt0110216", "storyLine": "\nAlex Hesse and Larry Arbogast are working on a new drug which will reduce the chances of a woman's body rejecting an embryo and thus causing a miscarriage. When their research funding is withdrawn, and human experimentation is denied to them, they decide to test the drug by breifly impregnating Hesse. Hesse however becomes attached to \"his\" unborn baby."},
{"imdbId": "tt0113501", "storyLine": "\nBobby Earl is facing the electric chair for the murder of a young girl. Eight years after the crime he calls in Paul Armstrong, a professor of law, to help prove his innocence. Armstrong quickly uncovers some overlooked evidence to present to the local police, but they aren't interested - Bobby was their killer."},
{"imdbId": "tt0113538", "storyLine": "\nYoung Calvin Fuller is pulled into King Arthur's court by Merlin. His mission: to save Camelot. To do this he must overcome the villain known as Lord Belascoe, train to become a knight, and rescue the Princess Katherine, who has fallen in love with him. Ultimately, He must help Arthur regain his confidence before he can go home."},
{"imdbId": "tt0113552", "storyLine": "\nJimmy Kilmartin's an ex-con who's trying to go straight. But he can't say no to a quick driving job because his so called friend's life is threatened. The job is for Little Junior Brown, a violent and powerful villain. When things go wrong, Jimmy is left to do the time, and his whole life is turned upside-down, but if that wasn't enough, the cops won't leave Jimmy alone when he gets out... They want 'Little Junior'"},
{"imdbId": "tt0076759", "storyLine": "\nThe Imperial Forces, under orders from cruel Darth Vader, hold Princess Leia hostage in their efforts to quell the rebellion against the Galactic Empire. Luke Skywalker and Han Solo, captain of the Millennium Falcon, work together with the companionable droid duo R2-D2 and C-3PO to rescue the beautiful princess, help the Rebel Alliance and restore freedom and justice to the Galaxy."},
{"imdbId": "tt0110367", "storyLine": "\n"},
{"imdbId": "tt0113670", "storyLine": "\nWhen her father enlists to fight for the British in WWI, young Sara Crewe goes to New York to attend the same boarding school her late mother attended. She soon clashes with the severe headmistress, Miss Minchin, who attempts to stifle Sara's creativity and sense of self-worth. Sara's belief that \"every girl's a princess\" is tested to the limit, however, when word comes that her father was killed in action and his estate has been seized by the British government."},
{"imdbId": "tt0110296", "storyLine": "\nThis Ken Loach docu-drama relates the story of a British woman's fight with Social Services over the care of her children. Maggie has a history of bouncing from one abusive relationship to another. She has four children, of four different fathers, who came to the attention of Social Services when they were injured in a fire. Subsequently, Maggie was found to be an \"unfit mother\" and her children were removed from her care. She finally meets the man of her dreams, a Paraguayan expatriate, and they start a family together. Unfortunately, Social Services seems unwilling to accept that her life has changed and rends them from their new children. She and Jorge together, and separately, fight Social Services, Immigration, and other government bureaucrats in a desperate battle to make their family whole again."},
{"imdbId": "tt0109731", "storyLine": "\nPaul, an irritable and stressed-out hotel manager, begins to gradually develop paranoid delusions about his wife's infidelity. As he succumbs to green-eyed jealousy, his life starts to crumble. Each step on his downward spiral to madness seems to accelerate, driving him further along the path to a personal hell. Finally, the former shell of his personality cracks completely, with tragic consequences."},
{"imdbId": "tt0103994", "storyLine": "\nIn a forgotten Mexico village Tita and Pedro fall in love, but their marriage is forbidden as to traditions. Mother Elena sees Tita's role as her caretaker for life - no youngest daughter has ever married and her daughter will not be the first to break tradition. Tita's heart breaks when her mother offers Pedro her sister instead of her, and he accepted it just to live near Tita- he says. Now they live in the same house, and mother Elena cannot forbid their love as she did their marriage."},
{"imdbId": "tt0110322", "storyLine": "\nIn early 20th-century Montana, Col. William Ludlow lives in the wilderness with his sons, Tristan, Alfred and Samuel. Eventually, the unconventional but close-knit family encounters tragedy when Samuel is killed in World War I. Tristan and Alfred survive their tours of duty, but, soon after they return home, both men fall for Samuel's gorgeous fiancée, Susannah, and their intense rivalry begins to destroy the family."},
{"imdbId": "tt0110443", "storyLine": "\nMajor Benson Winifred Payne is being discharged from the Marines. Payne is a killin' machine, but the wars of the world are no longer fought on the battlefield. A career Marine, he has no idea what to do as a civilian, so his commander finds him a job - commanding officer of a local school's JROTC program, a bunch or ragtag losers with no hope. Using such teaching tools as live grenades and real bullets, Payne starts to instill the Corps with some hope. But when Payne is recalled to fight in Bosnia, will he leave the Corps that has just started to believe in him, or will he find out that killin' ain't much of a livin'?"},
{"imdbId": "tt0110365", "storyLine": "\nThis film tells a bitter tale of a dysfunctional family. Joshua, a cold-blooded professional killer, returns to his Brighton Beach boyhood home for a \"job.\" He knows it will be difficult to return to the Russian-immigrant community of his youth--in his eyes, we see anticipation of the inevitable emotional pain and psychic turmoil that seeing his forsaken family and estranged companions will bring him. To do his job, and try to maintain some semblence of sanity, he has had to wall off his humanity from even himself. Seeing his kid brother, who adores him, talking with his dying mother, who still loves him, and yes, arguing with his abusive father, begins to wreak havoc with his personal defenses. As his steely demeanor begins to dissolve, we are shown the soul of a hit-man crumbling away, piece by piece. Finally, all that he now allows himself to admit that he loves is agonizingly torn away from him and he is left with the ultimate punishment for his transgressions."},
{"imdbId": "tt0107566", "storyLine": "\nMousie and Sad Girl are childhood best friends in a contemporary Los Angeles poor Hispanic neighborhood. But when Sad Girl becomes pregnant by Mousie's boyfriend, a drug dealer named Ernesto, the two become bitter enemies. While their dispute escalates towards violence, the violence of the world around them soon also impacts their lives."},
{"imdbId": "tt0110391", "storyLine": "\nEx-football star Mike Gambril meets Terry McKay on a flight to Sydney, which is forced to land on a small atoll. Both engaged to others, they become romantic on board the ship sent to take the 'plane passengers to a larger island. They agree to meet in New York three months later to see if the attraction is real. One shows up, the other doesn't, but they run into each other afterwards."},
{"imdbId": "tt0113691", "storyLine": "\nAn African-American baby, abandoned by his crack addicted mother is adopted by a white social worker and her husband. Several years later, the baby's mother finds out her son is not dead, as she thought before and goes to court to get him back."},
{"imdbId": "tt0110428", "storyLine": "\nA meditation on power, and the metaphor of the body of state, based on the real episode of dementia experienced by George III (now suspected a victim of porphyria, a blood disorder). As he loses his senses, he becomes both more alive, and more politically marginalized, neither effect desirable to his Lieutenants, who jimmy the rules to avoid a challenge to regal authority, raising the question of who is really in charge."},
{"imdbId": "tt0109836", "storyLine": "\nIn 1794, in the Arctic Sea, Captain Robert Walton is a man obsessed to reach the North Pole, pushing his crew to exhaustion. When his ship hits an iceberg, it is stranded in the ice. Out of the blue, Captain Walton and his men overhear a dreadful cry and they see a stranger coming to the ship. He introduces himself and Victor Frankenstein and he tells to the captain the story of his life since he was a little boy in Geneva. Victor is a brilliant student and in love with his stepsister Elizabeth, an orphan that was raised by his father Baron Frankenstein. In 1793, Victor moves to Ingolstadt to study at the university and he promises to get married to Elizabeth. At the university, Victor befriends Henry Clerval who becomes his best friend. Victor gets close to Professor Waldman and decides to create life to cheat death, but Waldman advises him that he should not try this experiment since the result would be an abomination. When Waldman dies, Victor steals his notes and tries to create ..."},
{"imdbId": "tt0113755", "storyLine": "\nBen Archer is not happy. His mother, Sandy, has just met a man, and it looks like things are pretty serious. Driven by a fear of abandonment, Ben tries anything and everything to ruin the \"love bubble\" which surrounds his mom. However, after Ben and Jack's experiences in the Indian Guides, the two become much closer."},
{"imdbId": "tt0110538", "storyLine": "\nPhilip runs a crisis hotline with Catherine and Mrs Munchnik. That's the easy part, now it gets tricky... Stanley loves evicting people and he evicts Philip. Philip loves helping people and he is loved by Catherine. Catherine is loved by Louie who loves writing songs. Chris loves dancing to songs and loves to wear large dresses. Gracie also loves to wear large dresses because she's pregnant. She loves the baby's father, Felix, who loves to paint. That just leaves Mrs. Munchnik who hasn't been loved by anybody in a very long time."},
{"imdbId": "tt0110516", "storyLine": "\nYoung Frank and his pals get an idea for the ultimate in excitement. They decide to pool their savings, bicycle to the nearby Big City, and hire some woman of the streets to strip for them. Things do not work out that simply, but they do meet V, a Hooker With A Heart Of Gold, who ends up giving them a ride home. Soon she is living in Frank's treehouse, unbeknownst to Frank's widowed father Tom, who thinks she is one of Frank's teachers. Soon, however, the evil Waltzer comes looking for V."},
{"imdbId": "tt0110527", "storyLine": "\nA little girl discovers dreams do come true if you really believe. Six-year-old Susan has doubts about childhood's most enduring miracle - Santa Claus. Her mother told her the \"secret\" about Santa a long time ago, so Susan doesn't expect to receive the most important gifts on her Christmas list. But after meeting a special department store Santa who's convinced he's the real thing, Susan is given the most precious gift of all - something to believe in."},
{"imdbId": "tt0113808", "storyLine": "\nGwyn Marcus has always wanted a marriage like her parents. She has just accepted the proposal of her boyfriend Matt, but she has misgivings about their future together. Her fear of commitment grows as she learns of the various affairs that her family is having. With her sister getting married and her brother already married, her mother is growing concerned about Gwyn's being the last single person in the family. But the more she thinks about marriage, the more she must search for the balance between career, marriage and family."},
{"imdbId": "tt0113896", "storyLine": "\nThis epic film traces over three generations an immigrant family's trials, tribulations, tragedies and triumphs. Jose and Maria, the first generation, come to Los Angeles, meet, marry, face deportation all in the 1930s. They establish their family in East L.A., and their children Chucho, Paco, Memo, Irene, Toni, and Jimmy deal with youth culture and the L.A. police in the 1950s. As the second generation become adults in the 1960s, the focus shifts to Jimmy, his marriage to Isabel (a Salvadorian refugee), their son, and Jimmy's journey to becoming a responsible parent."},
{"imdbId": "tt0113870", "storyLine": "\nHenri Young stole five dollars from a post office and ended up going to prison - to the most famous, or infamous, prison of them all: Alcatraz. He tried to escape, failed, and spent three years and two months in solitary confinement - in a dungeon, with no light, no heat and no toilet. Milton Glenn, the assistant warden, who was given free reign by his duty-shirking superior, was responsible for Young's treatment. Glenn even took a straight razor and hobbled Young for life. After three years and two months, Young was taken out of solitary confinement and put with the rest of the prisoners. Almost immediately, Young took a spoon and stabbed a fellow prisoner in the neck, killing him. Now, Young is on trial for murder, and if he's convicted he'll go to the gas chamber. An eager and idealistic young attorney, James Stamphill, is given this impossible case, and argues before a shocked courtroom that Young had a co-conspirator. The true murderer, he says, was Alcatraz."},
{"imdbId": "tt0110684", "storyLine": "\nSully is a rascally ne'er-do-well approaching retirement age. While he is pressing a worker's compensation suit for a bad knee, he secretly works for his nemesis, Carl, and flirts with Carl's young wife Toby. Sully's long- forgotten son and family have moved back to town, so Sully faces unfamiliar family responsibilities. Meanwhile, Sully's landlady's banker son plots to push through a new development and evict Sully from his mother's life."},
{"imdbId": "tt0110638", "storyLine": "\nNell is a girl who's been brought up in an isolated world. The only people she knew were her mother and twin sister. They lived together in a cottage in the forest. Nobody has ever met Nell. After her mother's death, she's discovered by the local doctor Jerome. He's fascinated by her, since she speaks a mangled language, developed by her sister and herself growing up, \"twin speak\" if you will. But Paula, a psychology student, wants her observed in a laboratory. The judge decides they get three months to observe her in the forest, after which he'll decide about Nell's future."},
{"imdbId": "tt0113967", "storyLine": "\nJason and Midget are two young, black teenagers living in Newark,New Jersey, the unofficial car theft capital of the world. Their favourite pastime is that of everybody in their neighbourhood: stealing cars and joyriding. The trouble starts when they steal a police car and the cops launch a violent offensive that involves beating and even shooting suspects."},
{"imdbId": "tt0106402", "storyLine": "\nDr. Stephanie Lyell works for Neurological Research, and is testing a seemingly safe personality-altering drug on Marc Gilmour a notorious Serial Killer. But when a pair of bizarre suicides occur at Dr. Lyell's apartment complex, Homicide Detective Terry Hamilton connects the mysterious deaths to the drug's diabolical side effects on Gilmour. Only after they too begin to experience horrible dreams and hallucinations do Terry and Stephanie realize they are trapped in Gilmour's nightmarish world, from which there is no hope of escape."},
{"imdbId": "tt0110671", "storyLine": "\nWhen Ninas husband goes off for a few weeks to work, she meets and starts seeing a photographer. This story is told as an interview by a journalist writing about adultery who is talking with both Nina and the photographer in separate interviews. Through him, we learn much about the couple and their attitudes on adultery."},
{"imdbId": "tt0110632", "storyLine": "\nMickey Knox and Mallory Wilson aren't your typical lovers - after killing her abusive father, they go on a road trip where, every time they stop somewhere, they kill pretty well everyone around them. They do however leave one person alive at every shootout to tell the story and they soon become a media sensation thanks to sensationalized reporting. Told in a highly visual style."},
{"imdbId": "tt0110737", "storyLine": "\nDestiny. Faith (Marisa Tomei) believes that two soul-mates can be united if they find each other. From the Ouija board, she has found the name of her missing half, and it is D-A-M-O-N B-R-A-D-L-E-Y. Later, at the carnival, the fortune teller sees the name Damon Bradley in the Crystal Ball and Faith is convinced. She is told that \"You make your own destiny,...don't wait for it to come to you\", but she is looking for Damon. 14 years later, she is engaged to a dull podiatrist and plans to marry until she gets a call from one of his classmates who is on his way to Venice, Italy. The classmate is Damon Bradley. Rushing to the airport to see her soul-mate, she misses him and the plane, but decides, then and there, to go after him. So Faith and her sister-in-law Kate both board the next plane for Italy hoping to find her Damon."},
{"imdbId": "tt0110729", "storyLine": "\nSet in urban Auckland (New Zealand) this movie tells the story of the Heke family. Jake Heke is a violent man who beats his wife frequently when drunk, and yet obviously loves both her and his family. The movie follows a period of several weeks in the family's life showing Jake's frequent outburst of violence and the effect that this has on his family. The youngest son is in trouble with the police and may be put into a foster home while the elder son is about to join a street gang. Jake's daughter has her own serious problems which are a key element in the plot."},
{"imdbId": "tt0114151", "storyLine": "\nLily is a sheltered art student from Michigan going to school in California. She finds an apartment and her roommates aren't quite normal. One day she finds a box of items belonging to a girl she's never met before. But in the box are nude pictures of the girl and her diary. Lily begins reading the diary and realizes that she's going to change her life and become a wild woman! She begins dating a guy and at the same time her art instructor begins to lust after her. The struggle begins when her boyfriend thinks she's unfaithful to him and her art teacher becomes obsessed."},
{"imdbId": "tt0114069", "storyLine": "\nIn July of 1967, In Motaba River Valley, Zaire, a virus with a 100% mortality rate starts infecting people. The virus becomes known as the Motaba virus, and it's so deadly that it causes severe bleeding and liquefies internal organs, killing within 3 days. The virus wipes out Motaba River Valley, and a devastatingly huge fire bomb is dropped onto Motaba River Valley in order to reduce the chances of further infection. The bomb was dropped on the orders of corrupt General Donald McClintock, even though an army surgeon, General Bill Ford, was against the idea. 27 years later, in 1994, there is another outbreak in Motaba River Valley. At the United States Army Medical Research Institute of Infectious Diseases (USAMRIID), located at Fort Detrick in Maryland, Colonel Sam Daniels is doing research on the Motaba virus, and so is his ex-wife Roberta Keough, who works at the Center for Disease Control and Prevention (CDC) in Atlanta, Georgia. A monkey carrying the Motaba virus stows away on a ..."},
{"imdbId": "tt0110413", "storyLine": "\nAfter her father, mother, older sister and little brother are killed by her father's employers, the 12-year-old daughter of an abject drug dealer is forced to take refuge in the apartment of a professional hitman who at her request teaches her the methods of his job so she can take her revenge on the corrupt DEA agent who ruined her life by killing her beloved brother."},
{"imdbId": "tt0114113", "storyLine": "\nIn an attempt to secure a sponsor, an unlikely group of Cuban refugees become a \"family\" as the U.S. Immigration and Naturalization Service gives families priority over others. In the process, a political prisoner who hasn't seen his wife for twenty years and a disaffected sugarcane cutter fall in love. An excitable brother and a lovestruck cop contribute to the general confusion. The inevitable humorous romantic entaglements ensue as a final confrontation is set up."},
{"imdbId": "tt0114210", "storyLine": "\nA pastry boy and the son of a hair-piece mogul become involved in an arson scandal. Sergio is offered a bribe in exchange for taking the blame for the fire that destroys his workplace. Garet, the real arsonist, is apalled that someone else would try to take credit for his act of love. Before long, Sergio and Garet become entangled in a zany love-quadrangle involving Hattie and Stephanie."},
{"imdbId": "tt0110912", "storyLine": "\nJules Winnfield ("},
{"imdbId": "tt0110889", "storyLine": "\nFather Greg Pilkington (Linus Roache) is torn between his call as a conservative Catholic priest and his secret life as a homosexual with a gay lover, frowned upon by the Church. Upon hearing the confession of a young girl of her incestuous father, Greg enters an intensely emotional spiritual struggle deciding between choosing morals over religion and one life over another."},
{"imdbId": "tt0110932", "storyLine": "\nAn idealistic young lawyer working for a Congressional subcommittee in the late 1950s discovers that TV quiz shows are being fixed. His investigation focuses on two contestants on the show \"Twenty-One\": Herbert Stempel, a brash working-class Jew from Queens, and Charles Van Doren, the patrician scion of one of America's leading literary families. Based on a true story."},
{"imdbId": "tt0114129", "storyLine": "\nThe story of 16-year-old Riyo who journeys to Hawaii in 1918 to marry a man she has never met, except through photographs and letters they have exchanged. Hoping to escape a troubled past and to start anew, Riyo is bitterly disappointed upon her arrival: her husband is twice her age and Hawaii is not the paradise she expected. As Riyo comes to terms with her new home, she discovers a land full of hardship, struggle--and unexpected joy."},
{"imdbId": "tt0110963", "storyLine": "\nThe night of August 24, 1572, is known as the Massacre of St. Bartholomew. In France a religious war is raging. In order to impose peace a forced wedding is arranged between Margot de Valois, sister of the immature Catholic King Charles IX, and the Hugenot King Henri of Navarre. Catherine of Medici maintains her behind-the-scenes power by ordering assaults, poisonings, and instigations to incest."},
{"imdbId": "tt0114214", "storyLine": "\nEllen, an unknown female gunslinger rides into a small, dingy and depressing prairie town with a secret as to her reason for showing up. Shortly after her arrival, a local preacher, Cort, is thrown through the saloon doors while townfolk are signing up for a gun competition. The pot is a huge sum of money and the only rule: that you follow the rules of the man that set up the contest, Herod. Herod is also the owner, leader, and \"ruler\" of the town. Seems he's arranged this little gun-show-off so that the preacher (who use to be an outlaw and rode with Herod) will have to fight again. Cort refuses to ever use a gun to kill again and Herod, acknowledging Cort as one of the best, is determined to alter this line of thinking ... even if it gets someone killed ..."},
{"imdbId": "tt0114296", "storyLine": "\nMichael Holeczak has a most unusual roommate, his grandfather, Rocky. Now Rocky's a bit strange but loves Michael and only has his best interest. Michael would live with Rocky after his parents died. Michael would grow up go to school, become a doctor, Rocky would live alone abut when Rocky's about to be thrown out and placed in a retirement home, he refuses. Michael then takes him in. They would stay together even when Michael got married and had a family. And Rocky would always be there for Michael and Michael for him."},
{"imdbId": "tt0110907", "storyLine": "\nA fashion show in Paris draws the usual bunch of people; designers, reporters, models, magazine editors, photographers. Lots of unconnected stories which all revolve around this show, and an all-star cast."},
{"imdbId": "tt0111495", "storyLine": "\nValentine is a young model living in Geneva. Because of a dog she ran over, she meets a retired judge who spies his neighbours' phone calls, not for money but to feed his cynicism. The film is the story of relationships between some human beings, Valentine and the judge, but also other people who may not be aware of the relationship they have with Valentine or/and the old judge. Redemption, forgiveness and compassion..."},
{"imdbId": "tt0108394", "storyLine": "\nThe first part of Kieslowski's trilogy on France's national motto: Liberty, Equality, and Fraternity. 'Blue' is the story of Julie who loses her husband, an acclaimed composer and her young daughter in a car accident. The film's theme of liberty is manifested in Julie's attempt to start life anew, free of personal commitments, belongings, grief or love. She intends to numb herself by withdrawing from the world and living completely independently, anonymously and in solitude in the Parisian metropolis. Despite her intentions, people from her former and present life intrude with their own needs. However, the reality created by the people who need and care about her, a surprising discovery and the music around which the film revolves heal Julie and draws her back to the land of the living."},
{"imdbId": "tt0111507", "storyLine": "\nKarol (Polish) marries Domininque (French) and moves to Paris. The marriage breaks down and Dominique divorces Karol, forcing him into the life of a metro beggar and eventually back to Poland. However, he never forgets Dominique and while building a new life for himself in Warsaw he begins to plot..."},
{"imdbId": "tt0110769", "storyLine": "\nA woman inherits her father's fireworks factory, as he had no son. The business does well and everything works in an orderly fashion until one day, an itinerant painter is hired to decorate the doors and vases at the factory. The woman, forbidden to marry and thereby involve outsiders in the factory ownership, finds herself drawn to the headstrong painter. When they fall in love, the situation throws her entire life into disarray."},
{"imdbId": "tt0114571", "storyLine": "\nStuart Smalley, the Saturday Night Live character, comes to the big screen. Stuart, the disciple of the 12 step program, is challenged by lifes injustices. He loses his Public Access Cable Television Show, must beg his manipulative overbearing boss for his job back, rehabilitate his alcoholic father and drug abuser brother, and support his over-weight mother and sister in their lack of ability in handling their relationships with their husbands. Stuart is supported by his 12 step sponsors as a he regresses back to his negative behaviors each time he faces these challenges."},
{"imdbId": "tt0111333", "storyLine": "\nAs children, Prince Derek and Princess Odette are forced to spend their summers together by their widowed parents, who hope that the two will eventually fall in love and marry, so their two kingdoms will be united. As children and adolescents, Derek and Odette can't stand each other, but as young adults they begin to see each other in a different light and fall in love with each other. But one night things take a bad turn when Derek unintentionally offends Odette, who then refuses to marry him if he can't prove that he loves her for who she is and not just her beauty. Odette and her father are then attacked by Lord Rothbart, a vengeful sorcerer who was cast out of William's kingdom when he plotted against the king. In the form of a beast, Rothbart mortally wounds William, and kidnaps Odette then places her under a spell. Now it is up to Derek to rescue Odette by showing his undying love. But will he be in time?"},
{"imdbId": "tt0111112", "storyLine": "\n10-year-old Fiona is sent to live with her grandparents in a small fishing village in Donegal, Ireland. She soon learns the local legend that an ancestor of hers married a Selkie - a seal who can turn into a human. Years earlier, her baby brother washed out to sea in a cradle shaped like a boat; someone in the family believes the boy is being raised by the seals. Then Fiona catches sight of a naked little boy on the abandoned Isle of Roan Inish and takes an active role in uncovering he secret of Roan Inish."},
{"imdbId": "tt0111255", "storyLine": "\nRay Quick is a bomb expert who worked for the CIA along with a guy named Ned Trent, who's extremely demented. When they have a falling out, Ray becomes a freelancer who lives off the grid. A woman named May Munro contacts and wants him to kill the three men who killed her family years ago, who work for the Leon crime family. Ray does it and after killing the first one, the Leons need to find the one who did it and it turns out Ned is now working for them and they task him with finding the bomber. The Leons get him to work with the police and he looks for the bomber. In the meantime Ray, while working on getting the others, can't help but follow May wherever she goes."},
{"imdbId": "tt0111282", "storyLine": "\nIn 1928, in Egypt, a strange device is found by an expedition. In the present days, the outcast linguist Dr. Daniel Jackson is invited by a mysterious woman to decipher an ancient hieroglyph in a military facility. Soon he finds that the device was developed by an advanced civilization and opens a portal to teletransport to another planet. Dr. Jackson is invited to join a military team under the command of Colonel Jonathan 'Jack' O'Neil that will explore the new world. They find a land that recalls Egypt and humans in a primitive culture that worship and are slaves to Ra, the God of the Sun. But soon they discover the secret of the mysterious \"stargate\"."},
{"imdbId": "tt0111070", "storyLine": "\nDivorcee Scott Calvin is disgusted to learn that his ex and her husband have tried - and failed - to break it easy to their 6-year-old son Charlie that Santa isn't real. On Christmas Eve, Scott reads The Night Before Christmas... then receives an unexpected visitor on his roof. When he's startled by Scott's calling out and falls, the Santa impersonator disappears, leaving only an 8-reindeer sleigh and a suit with instructions to put it on if he's involved in an accident. Scott does, and is transported around the town dropping gifts through chimneys until he's taken to the North Pole and informed by a group who claim they're elves that he is now Santa. Charlie is proud of his dad's new job, though Scott's convinced it's a dream. Until his hair turns white, his beard refuses to stay shaved, he gains weight inexplicably, even for his sudden love of junk food... Now he's accepted it, there's just one problem: how to keep it secret from his disbelieving family?"},
{"imdbId": "tt0111161", "storyLine": "\nChronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he did not commit. The film portrays the man's unique way of dealing with his new, torturous life; along the way he befriends a number of fellow prisoners, most notably a wise long-term inmate named Red."},
{"imdbId": "tt0111149", "storyLine": "\nThe new flatmate of three preexisting roommates turns up mysteriously dead but in possession of a large sum of money. When the roommates decide to keep it for themselves, their action sets in motion a destructive chain of events that spiral out of control."},
{"imdbId": "tt0108260", "storyLine": "\nBrothers Vincent (rich) and Clay (poor) meet up for the first time after their father's funeral and remark on how similar they look. But unknown to Clay, who thinks his life is taking a turn for the better, Vince is actually plotting to kill him with a car bomb and pass the corpse off as his own, planning to start a new life elsewhere with his father's inheritance. But Clay survives the blast and has his face, memory and identity restored in hospital... but are they the right ones?"},
{"imdbId": "tt0106966", "storyLine": "\nDiego, a cultivated, homosexual and skeptical young man, falls in love with a young heterosexual communist full of prejudices and doctrinal ideas. First come rejection and suspicion, but also fascination. Fresa y chocolate is a coming-of-age story, told through the development of a great friendship which overcomes incomprehension and intolerance."},
{"imdbId": "tt0114594", "storyLine": "\nA young Hollywood executive becomes the assistant to a big time movie producer who is the worst boss imaginable: abusive, abrasive and cruel. But soon things turn around when the young executive kidnaps his boss and visits all the cruelties back on him."},
{"imdbId": "tt0111309", "storyLine": "\nSet in Sydney, Australia. A (heterosexual) father and his gay son are trying to find Ms/Mr Right respectively. The film shows their relationships with one another and the objects of their affection as tradgedy strikes. There is no overt 'message' in the film, just a very natural, entertaining story-telling."},
{"imdbId": "tt0113936", "storyLine": "\nWhile on detention, a group of misfits and slackers have to write a letter to the President explaining what is wrong with the education system. There is only one problem, the President loves it! Hence, the group must travel to Washington to meet the Main Man."},
{"imdbId": "tt0110081", "storyLine": "\nFugui and Jiazhen endure tumultuous events in China as their personal fortunes move from wealthy landownership to peasantry. Addicted to gambling, Fugui loses everything. In the years that follow he is pressed into both the nationalist and communist armies, while Jiazhen is forced into menial work. They raise a family and survive, managing \"to live\" from the 40's to the 70's in this epic, but personal, story of life through an amazing period."},
{"imdbId": "tt0114614", "storyLine": "\nTank Girl (Rebecca) and her friends are the only remaining citizens living in the wasteland that is Earth, where all the remaining water is controlled by Water and Power, the mega corporation/government that runs the territory. While incarcerated at W + P, Tank Girl and her new friend Jet Girl break out and steal... a tank and a jet. After meeting some mutant kangaroo/humans, and rescuing her little girl (adopted by her friends), the kangaroos and the girls kick Water and Powers' butt."},
{"imdbId": "tt0114608", "storyLine": "\nBrayker is a man who carries the last of seven keys, special containers which held the blood of Christ and were scattered across the universe to prevent the forces of evil from taking over. If The Collector gets the last key, the universe will fall into Chaos, and he has been tracking Brayker all the way to a small inn in a nowhere town. And now the final battle for the universe begins......"},
{"imdbId": "tt0111280", "storyLine": "\nIn the late 23rd century, the gala maiden voyage of the newly-christened Enterprise-B boasts such luminaries as Pavel Chekov, Montgomery Scott and the legendary Captain James T. Kirk as guests. But her maiden voyage turns into a disaster as the unprepared starship is forced to rescue two transport ships from a mysterious energy ribbon. The Enterprise manages to save a handful of the ships' passengers and barely succeeds out intact... but at the cost of Captain Kirk's life. 78 years later, Captain Jean-Luc Picard and the Enterprise-D crew find themselves at odds with renegade scientist Dr. Tolian Soran... who is destroying entire star systems. Only one man can help Picard stop Soran's scheme... and he has been dead for 78 years."},
{"imdbId": "tt0114609", "storyLine": "\nFour short, moralistic horror vignettes (a la EC Comics) that deal with mostly black characters. The framing story introduces three youths out to pick up a drug shipment at a funeral parlor from the strange director, Mr. Simms. As the three punks wind their way through the parlor, Mr. Simms tells them the last stories of some of his more interesting clients."},
{"imdbId": "tt0111454", "storyLine": "\nIn 1915, T.S. (Tom) Eliot and Vivienne Haigh-Wood elope, but her longstanding gynecological and emotional problems disrupt their planned honeymoon. Her father is angry because Tom's poetry doesn't bring in enough to live on, but her mother is happy Viv has found a tender and discreet husband."},
{"imdbId": "tt0114852", "storyLine": "\nAn American village is visited by some unknown life form which leaves the women of the village pregnant. Nine months later, the babies are born, and they all look normal, but it doesn't take the \"parents\" long to realize that the kids are not human or humane."},
{"imdbId": "tt0114694", "storyLine": "\nTommy Callahan Jr. is a slow-witted, clumsy guy who recently graduated college after attending for seven years. His father, Big Tom Callahan, owns an auto parts factory in Ohio. When Tommy arrives back home, he finds he has a position at the factory waiting for him. His dad also introduces Tommy to the new brake pad division of the factory and to Tommy's soon-to-be stepmother, Beverly, and her son Paul. But when Big Tom dies, the factory threatens to go under unless the new brake pads are to be sold. Therefore, Tommy must go on the road to sell them, along with the assistance of Richard, Big Tom's right-hand man. Will Tommy save the company, or will the factory, and the town, go under?"},
{"imdbId": "tt0111590", "storyLine": "\nAn uniterrupted rehersal of Chekhov's \"Uncle Vanya\" played out by a company of actors. The setting is their run down theater with an unusable stage and crumbling ceiling. The play is shown act by act with the briefest of breaks to move props or for refreshments. The lack of costumes, real props and scenery is soon forgotten."},
{"imdbId": "tt0114788", "storyLine": "\nMichael Chambers returns home to celebrate his mother's marriage. Michael had been ousted from his home town due to his gambling indiscretions and had left his wife to deal with the mess he created. He now must reassimilate back into the town, renew his relationships with his family and friends (and enemies) and, most of all, seek out his ex-wife to woo her again. In the process, he obtains a job working with his mother's new husband as an armored car driver. He almost seems the perfect prodigal son as he finds his niche back in the community and his way back into his ex's heart. His troubles surmount when he and his wife are caught in the act by her hoodlum boyfriend/fiancé. To get out of this predicament, Michael must concoct a plan to heist of a payroll being carried by his armored car company."},
{"imdbId": "tt0114888", "storyLine": "\nIn 1972 Vietnam, a group of United States Marines are sent in to rescue several POW officers. The Landing Zone (LZ) which should have been \"cold\" actually turns out to indeed be very \"hot\" (characterized by violent and forceful activity or movement ; very intense). Soon, after a short fight, only four of the soldiers are left alive. Later, the platoon which they were to meet the next day is entirely wiped out with the exception of one nut-case. The small group then arrives at the conclusion that they are all expendable decoys. Between all of the walking, talking, arguing and assaulting between the four soldiers, there are flashbacks to all of their contrite lives before serving in the Corps."},
{"imdbId": "tt0108550", "storyLine": "\nWhat's Eating Gibert Grape is a beautifully shot movie of tenderness, caring and self-awareness that is set amongst the fictional working class one street town Endora. Centred around the Grape family Ellen and Amy and their two brothers Arnie and Gilbert, who, along with their morbidly obese widowed mother Bonnie Grape are striving to survive and coexist with the absence of a father figure, low wage work and seventeen-year-old Arnie's severe mental condition. It is in this awkward and extremely one sided affair that the unfortunate Gilbert has to constantly, while working for the town's slowly dying convenience store, take care of his younger brother Arnie. Gilbert's life, his future, is thwarted he knows this, but it is in this guardian angel that his love and bond for Arnie cannot, and will not, be let go. That is until the free spirit of Becky arrives in town, and with her grandmother are stranded for the week while waiting for parts for their vehicle. This realization unties new ..."},
{"imdbId": "tt0114857", "storyLine": "\nThe Law Enforcement Technology Advancement Centre (LETAC) has developed SID version 6.7: a Sadistic, Intelligent, and Dangerous virtual reality entity which is synthesized from the personalities of more than 150 serial killers. LETAC would like to train police officers by putting them in VR with SID, but they must prove the concept by using prisoners as test subjects. One such prisoner is ex-cop Parker Barnes. When SID manages to inject his personality into a nano-machine android, it appears that Barnes might be the only one who can stop him."},
{"imdbId": "tt0114924", "storyLine": "\nLucy's life consists of constant loneliness that is until she saves Peter's life. Now she is a part of his family, and with a strong heart and fate on her side, others begin to realize what a terrific person she is, especially Jack, Peter's brother. An extraordinarily true-to-life sequence of events begin to take place as Lucy and Jack become closer and learn more about each other and themselves than one would ever expect from such coincidental, yet believable events."},
{"imdbId": "tt0111667", "storyLine": "\nVietnam War vet Stephen Simmons must deal with a war of a different sort between his son and their friends, and a rival group of children. He also must deal with his own personal and employment problems that have resulted from his Vietnam experiences."},
{"imdbId": "tt0109655", "storyLine": "\nTwenty-two year old Chinese-Canadian Jade Li comes from a traditional Chinese family, who try to put on the perfect public persona at all cost so as to \"save face\". One primary part of this persona is prosperity. Jade's father hopes that true financial prosperity will become reality through penny stocks. Because of its instability, Jade's parents don't understand or widely publicize Jade's aspirations to be an actress. Their main want for Jade is to date and marry a nice Chinese boy, a goal for which Jade's extended family also strives as they are always trying to introduce her to Chinese boys. They believe that *the* boy is Andrew, with whom Jade even agrees to go out. But Jade, beyond wanting to be an actress, wishes her family had more western sensibilities. She is attracted to a slightly awkward but persistent Caucasian English graduate student named Mark. Jade has to figure out how to both please her family, who would not approve of her dating a Caucasian, and be true to herself."},
{"imdbId": "tt0110598", "storyLine": "\nMuriel finds life in Porpoise Spit, Australia dull and spends her days alone in her room listening to Abba music and dreaming of her wedding day. Slight problem, Muriel has never had a date. Then she steals some money to go on a tropical vacation, meets a wacky friend, changes her name to Mariel, and turns her world upside down."},
{"imdbId": "tt0112435", "storyLine": "\nBased on the bestselling book series about seven friends whose babysitting business leads to one adventure after another. When tomboy Kristy, president of the club, has a brilliant idea to run a summer day camp, the girls all agree it's the perfect way to spend their summer--together! But life gets complicated as budding romance, family problems and a trio of scheming snobs all conspire to ruin the club. The BSC gang learn for themselves the amazing power of friendship."},
{"imdbId": "tt0109040", "storyLine": "\nTo be a Pet Detective, you have to understand both the criminals and animals. Ace Ventura goes even further... He behaves like a criminal animal. When a football team's mascot (a dolphin) is stolen just before the Superbowl, Ace Ventura is put on the case. Now, who would want to steal a dolphin, and why?"},
{"imdbId": "tt0109045", "storyLine": "\nTwo drag-queens (Anthony/Mitzi and Adam/Felicia) and a transgender woman contract to perform a drag show at a resort in Alice Springs, a resort town in the remote Australian desert. They head west from Sydney aboard their lavender bus, Priscilla. En route, it is discovered that the woman they've contracted with is Anthony's wife. Their bus breaks down, and is repaired by Bob, who travels on with them."},
{"imdbId": "tt0106339", "storyLine": "\nA pre-fame Beatles head for the seedy clubs of Hamburg in search of success. The band meet up with a group of trendy German beatniks, one of whom (Astrid Kircherr) bass guitarist Stuart Sutcliffe falls in love with. Whilst best friend John Lennon can only watch, Sutcliffe has to choose between rock 'n roll and a new life in Germany..."},
{"imdbId": "tt0104779", "storyLine": "\nBritish couple Fiona and Nigel Dobson are sailing to Istanbul en route to India. They encounter a beautiful French woman, and that night Nigel meets her while dancing alone in the ship's bar. Later he meets her crippled American husband Oscar, who tells him their story. While living in Paris for several years trying to be a writer, he becomes obsessed with a woman he met by chance on a bus. He tracks her down and they start a steamy love affair. Soon Oscar finds himself enslaved body and soul by her love, and continues to tell Nigel the details of this relationship in various stages over a number of visits to Oscar's cabin."},
{"imdbId": "tt0109348", "storyLine": "\n1920s Broadway. Playwright David Shayne considers himself an artist, and surrounds himself with like minded people, most struggling financially as they create art for themselves, not the masses. David, however, believes the failure of his first two plays was because he gave up creative control to other people who didn't understand the material. As such, he wants to direct his just completed third play, \"God of Our Fathers\", insider scuttlebutt being that it may very well make David the toast of Broadway. With David having no directing history, David's regular producer, Julian Marx, can't find any investors,... until a single investor who will finance the entire production comes onto the scene. He is Nick Valenti, a big time mobster, with the catch being that his dimwitted girlfriend, non-actress Olive Neal, get the lead role. A hesitant David and Julian, who are able to talk Nick into them giving Olive one of the two female supporting roles instead, go along with the scheme hoping ..."},
{"imdbId": "tt0109444", "storyLine": "\nJack Ryan is back and this time the bad guys are in his own government. When Admiral James Greer becomes sick with cancer, Ryan is appointed acting CIA Deputy Director of Intelligence. Almost before he can draw a breath in his new position, one of the president's closest friends and his family are murdered in their sleep by what appears to by drug cartels. Ryan is called in to investigate, but unknown to him the CIA has already sent a secret field operative to lead an illegal paramilitary force in Colombia against cartels. Things get even more complicated when his team is set up and he loses an agent in the field and a friend of his wife's, who was the murdered agent's secretary, is murdered that same day. Ryan must then risk not only his career, but his life to expose the truth behind the mystery."},
{"imdbId": "tt0109446", "storyLine": "\nMark Sway is an 11 year old boy who lives with his mother and brother in a trailer. One day he and his brother are hanging out when a car pulls over beside them. The driver then sticks a hose in his exhaust and puts the other end into the car. Mark pulls it out. But the man sees him and grabs him and takes inside the car. The man talks to Mark then later shoots himself. The shock sends Mark's brother into a catatonic state. The police question him and slips out some stuff that makes them think he's saying more than he knows. Roy Foltrigg, a prosecutor with political ambitions tells Mark he wants to talk to him tomorrow. Mark feeling that he needs a lawyer, sees Reggie Love. Mark tells her about the man who killed himself. Reggie tells him he's a mob lawyer. And one of his clients is a member of a mob family who is suspected of killing a Senator who was trying to take down his family. But because the Senator's body is missing, they can't prosecute him. Reggie thinks Foltrigg thinks the..."},
{"imdbId": "tt0109484", "storyLine": "\nWhen Manny Singer's wife dies, his young daughter Molly becomes mute and withdrawn. To help cope with looking after Molly, he hires sassy housekeeper Corrina Washington, who coaxes Molly out of her shell and shows father and daughter a whole new way of life. Manny and Corrina's friendship delights Molly and enrages the other townspeople."},
{"imdbId": "tt0109504", "storyLine": "\n"},
{"imdbId": "tt0109506", "storyLine": "\nA poetic guitarist Eric Draven is brought back to life by a crow a year after he and his fiancée are murdered. The crow guides him through the land of the living, and leads him to his killers: knife thrower Tin-tin, drugetic Funboy, car buff T-Bird, and the unsophisticated Skank. One by one, Eric gives these thugs a taste of their own medicine. However their leader Top-Dollar, a world-class crime lord who will dispatch his enemies with a Japanese sword and joke about it later, will soon learn the legend of the crow and the secret to the vigilante's invincibility."},
{"imdbId": "tt0109450", "storyLine": "\nAl Stump is a famous sports-writer chosen by Ty Cobb to co-write his official, authorized 'autobiography' before his death. Cobb, widely feared and despised, feels misunderstood and wants to set the record straight about 'the greatest ball-player ever,' in his words. However, when Stump spends time with Cobb, interviewing him and beginning to write, he realizes that the general public opinion is largely correct. In Stump's presence, Cobb is angry, violent, racist, misogynistic, and incorrigibly abusive to everyone around him. Torn between printing the truth by plumbing the depths of Cobb's dark soul and grim childhood, and succumbing to Cobb's pressure for a whitewash of his character and a simple baseball tale of his greatness, Stump writes two different books. One book is for Cobb, the other for the public."},
{"imdbId": "tt0109813", "storyLine": "\nThe Flintstones and the Rubbles are modern stone-age families. Fred and Barney work at Slate and Company, mining rock. Fred gives Barney some money so he and Betty can adopt a baby. When Fred and Barney take a test to determine who should become the new associate vice president, Barney returns the favor by switching his test answers for Fred's, whose answers aren't very good. Fred gets the executive position, but little does he know that he's being manipulated by his boss to be the fall guy for an embezzlement scheme."},
{"imdbId": "tt0109830", "storyLine": "\nForrest Gump is a simple man with a low I.Q. but good intentions. He is running through childhood with his best and only friend Jenny. His 'mama' teaches him the ways of life and leaves him to choose his destiny. Forrest joins the army for service in Vietnam, finding new friends called Dan and Bubba, he wins medals, creates a famous shrimp fishing fleet, inspires people to jog, starts a ping-pong craze, creates the smiley, writes bumper stickers and songs, donates to people and meets the president several times. However, this is all irrelevant to Forrest who can only think of his childhood sweetheart Jenny Curran, who has messed up her life. Although in the end all he wants to prove is that anyone can love anyone."},
{"imdbId": "tt0109831", "storyLine": "\nThe film follows the fortunes of Charles and his friends as they wonder if they will ever find true love and marry. Charles thinks he's found \"Miss Right\" in Carrie, an American. This British subtle comedy revolves around Charlie, his friends and the four weddings and one funeral which they attend."},
{"imdbId": "tt0113305", "storyLine": "\nYoungsters from different countries, races, and social background are forced to integrate when they all enroll in Columbus University. They all have their own problems, such as finance, harrassment, personal safety, and self doubt. Additionally, campus life seems to be causing a problem for everyone: racism. Students, already under pressure to perform in the classroom, on the track, or in front of their friends, are strained to the breaking point by prejudice, inexperience, and misunderstanding."},
{"imdbId": "tt0110093", "storyLine": "\nVeteran reporter Peter Brackett is enjoying new found fame after his book, \"White Lies\" is published. When he is asked by his newspaper \"The Chicago Chronicle\" to report on a train crash, he notices new reporter Sabrina Peterson. Brackett's complacency gets rudely shocked by Peterson's report for the rival \"Chicago Globe.\" What follows next is a mad race between the reporters who then cook up possible events that lead up to the crash. After an initial spate of mad reporting, both settle down to get the facts straight, which leads them to uncover opposing information. When each gets setup to be killed at the same place, they escape, and then agree to work together. While they initially do not trust one another, they eventually come to work together to uncover the truth behind the train crash."},
{"imdbId": "tt0110167", "storyLine": "\nCharlie and Muriel Lang have led simple lives - for most of their existance. That's until they win $4 million on the lottery! There is a problem, however. Prior to winning the lottery, Charlie had eaten at a cafe and hadn't been able to tip the waitress. He had promised her, jokingly, that if he won the lottery he'd give her half of it. This is why his wife, Muriel decides to leave him. She doesn't want the waitress to get a cent of their money. Infact she wants all $4 million for herself!"},
{"imdbId": "tt0110213", "storyLine": "\nAn adaptation of Rudyard Kipling's classic tale of Mowgli the jungle boy who is raised by wolves after being lost when a tiger attacked an encampment and killed his father. Years later he finds himself re-united with his childhood love Kitty and back in the \"civilization\" of Colonial India which he finds far less civilized then his jungle haunts. The search for a lost treasure shows who the truly civilized members of society are."},
{"imdbId": "tt0107472", "storyLine": "\nThis documentary recounts the life and work of one of most famous, and yet reviled, German film directors in history, Leni Riefenstahl. The film recounts the rise of her career from a dancer, to a movie actor to the most important film director in Nazi Germany who directed such famous propaganda films as Triumph of the Will and Olympiad. The film also explores her later activities after Nazi Germany's defeat in 1945 and her disgrace for being so associated with it which includes her amazingly active life over the age of 90."},
{"imdbId": "tt0110357", "storyLine": "\nA young lion Prince is cast out of his pride by his cruel uncle, who claims he killed his father. While the uncle rules with an iron paw, the prince grows up beyond the Savannah, living by a philosophy: No worries for the rest of your days. But when his past comes to haunt him, the young Prince must decide his fate: will he remain an outcast, or face his demons and become what he needs to be?"},
{"imdbId": "tt0107426", "storyLine": "\nLama Norbu comes to Seattle in search of the reincarnation of his dead teacher, Lama Dorje. His search leads him to young Jesse Conrad, Raju, a waif from Kathmandu, and an upper class Indian girl. Together, they journey to Bhutan where the three children must undergo a test to prove which is the true reincarnation. Interspersed with this, is the story of Siddharta, later known as the Buddha. It traces his spiritual journey from ignorance to true enlightenment."},
{"imdbId": "tt0111686", "storyLine": "\nIt's nearing the 10th Anniversary of the film 'A Nightmare on Elm Street' and one of the stars, Heather Langenkamp is being scared by a voice on a phone, sounding very similar to the film's villain, Freddy Krueger. When Heather's husband is killed in a car accident and is discovered with slash marks on him, Heather starts to wonder something. Especially when she discovers that Wes Craven is writing another 'Nightmare' film. Soon, she realizes that Freddy has now entered the real world, and the only way to defeat him is to become Nancy Thompson once again."},
{"imdbId": "tt0110475", "storyLine": "\nStanley Ipkiss ("},
{"imdbId": "tt0110478", "storyLine": "\nMaverick is recreated from the character James Garner created in the 1950s TV program. Maverick is a gambler who would rather con someone than fight them. He needs an additional three thousand dollars in order to enter a Winner Take All poker game that begins in a few days. He tries to win some, tries to collect a few debts, and recover a little loot for the reward, all with a light hearted air. He joins forces with a woman gambler with a marvelous, though fake, southern accent as the two both try and enter the game."},
{"imdbId": "tt0110588", "storyLine": "\nDorothy Parker remembers the heyday of the Algonquin Round Table, a circle of friends whose barbed wit, like hers, was fueled by alcohol and flirted with despair."},
{"imdbId": "tt0110622", "storyLine": "\nOscar night. Who will win? Who will lose? And will someone please kick that numbskull off stage? Wait! That's no ordinary numbskull. That's Lt. Frank Drebin, crashing the ceremonies to stop a terrorist plot that could mean curtains for him -- or will a simple window shade be enough?"},
{"imdbId": "tt0110771", "storyLine": "\nHenry Hackett is the editor of a New York City tabloid. He is a workaholic who loves his job, but the long hours and low pay are leading to discontent. Also, publisher Bernie White faces financial straits, and has hatchetman Alicia Clark, Henry's nemesis, impose unpopular cutbacks. Henry's wife Martha, a hugely pregnant former reporter of his, is fed up because he has so little time for his family. He is therefore considering an offer from Paul Bladden to edit a paper like the New York Times, which would mean more money, shorter hours, more respectability...but might also be a bit boring for his tastes. But a hot story soon confronts Henry with tough decisions."},
{"imdbId": "tt0110950", "storyLine": "\nIn this study of Generation X manners, Lelaina, the valedictorian of her college class, camcords her friends in a mock documentary of posteducation life. Troy is her best friend, a perpetually unemployed musical slacker. Vickie is a manager at the Gap who worries about the results of an AIDS test, while Sammy has problems grappling with his sexuality. When Lelaina meets Michael, an earnest video executive who takes her homemade video to his MTV-like station, she must decide what she values--the materialism of yuppie Michael or the philosophical musings of Troy."},
{"imdbId": "tt0105226", "storyLine": "\nWhen a promised job for Texan Michael fails to materialise in Wyoming, Mike is mistaken by Wayne to be the hitman he hired to kill his unfaithful wife, Suzanne. Mike takes full advantage of the situation, collects the money and runs. During his getaway, things go wrong, and soon get worse when he runs into the real hitman, Lyle."},
{"imdbId": "tt0110989", "storyLine": "\nThe richest kid in the world, Richie Rich, has everything he wants, except companionship. While representing his father at a factory opening, he sees some kids playing baseball across the street. Richie wants to join in, but they don't want him around. When a plot to kill the Rich family is devised by Rich Industries' top executive, Laurence Van Dough, Richie must take over control of the company while searching for his lost parents with the help of some new friends."},
{"imdbId": "tt0111054", "storyLine": "\nA mother with seven sons feels like she's losing control of her life and her family. But personal pain and a troubled marriage fade into the background as news comes that one of her sons might have died in an accident."},
{"imdbId": "tt0110997", "storyLine": "\nGail, an expert at white water rafting, takes her family on a trip down a river on which she used to be a guide. Along the way, the family encounters two men who are unexperienced rafters that need to find their friends down river. Later, the family finds out that the pair of men are armed robbers. The men then physically force the family to take them down the river to meet their accomplices. The rafting trip for the family is definitely ruined, but most importantly, their lives are at stake."},
{"imdbId": "tt0111257", "storyLine": "\nBomber terrorist's elevator plan backfires, so he rigs a bomb to a LA city bus. The stipulation is: once armed, the bus must stay above 50 mph to keep from exploding. Also if LAPD Officer tries to unload any passengers off, Payne will detonate it. Joe Morton co-stars as Jack's superior, and Jeff Daniels supports Jack helping him try to defuse the bomb."},
{"imdbId": "tt0111256", "storyLine": "\nTwo political speechwriters fall in love before they find out they are working for candidates on opposite sides.            "},
{"imdbId": "tt0111438", "storyLine": "\nWhen the ability to travel through time is perfected, a new type of law enforcement agency is formed. It's called Time Enforcement Commission or TEC. A cop, Max Walker, is assigned to the group. On the day he was chosen, some men attack him and kill his wife. Ten years later Max is still grieving but has become a good agent for the TEC. He tracks down a former co-worker who went into the past to make money. Max brings him back for sentencing but not after telling Max that Senator McComb, the man in charge of TEC, sent him. Max has his eye on McComb."},
{"imdbId": "tt0111503", "storyLine": "\nHarry Tasker ("},
{"imdbId": "tt0111693", "storyLine": "\nThe seemingly perfect relationship between a man and his wife is tested as a result of her alcoholism.            "},
{"imdbId": "tt0111742", "storyLine": "\nWorn down and out of luck, aging publisher Will Randall is at the end of his rope when a younger co-worker snatches both his job and wife out from under his nose. But after being bitten by a wolf, Will suddenly finds himself energized, more competitive than ever, and possessed with amazingly heightened senses. Meanwhile, the beautiful daughter of his shrewd boss begins to fall for him - without realizing that the man she's begun to love is gradually turning into the creature by which he was bitten."},
{"imdbId": "tt0111756", "storyLine": "\nWyatt Earp is a movie about a man and his family. The movie shows us the good times and the bad times of one of the West's most famous individuals."},
{"imdbId": "tt0112443", "storyLine": "\nNelson Crowe is a CIA operative under the thumb of the Company for a disputed delivery of $50,000 in gold. They blackmail him into working for the Grimes Organization, which is set up as a private company for hire, to blackmail prominent individuals. Crowe, working with Margaret Wells (another former Covert Operations operative), blackmails and bribes a State Supreme Court judge, but the deal sours. One of Crowe's co-workers, Tod Stapp, discovers Crowe's current CIA involvement in a plot to overthrow Grimes, and blackmails him to be cut in on the deal. More blackmail occurs as Wells manipulates Crowe to kill Grimes, then the CIA uses that discovery to blackmail Wells into killing Crowe. Who can you trust???"},
{"imdbId": "tt0110399", "storyLine": "\nA black detective becomes embroiled in a web of danger while searching for a fortune in missing drug money.During the course of his investigation, he encounters various old connections, ultimately confronting the criminal responsible for Shame's expulsion from the force. He must also deal with two women, Angela, a beautiful old flame, and Peaches, his energetic but annoying sidekick."},
{"imdbId": "tt0112570", "storyLine": "\nEach of the three short films in this collection presents a young gay man at the threshold of adulthood. In \"Pool Days,\" Justin is a 17-year old Bethesda lad, hired as the evening life guard at a fitness center. In the course of the summer, he realizes and embraces that he's gay. In \"A Friend of Dorothy,\" Winston arrives from upstate for his freshman year at NYU. He has to figure out, with some help from Anne, a hometown friend, how to build a social life as a young gay man in the city. In \"The Disco Years,\" Tom looks back on 1978, the year in high school that he came out of the closet after one joyful and several painful encounters."},
{"imdbId": "tt0109454", "storyLine": "\nColonel Chabert has been severely wounded in the French-Russian Napoleonic war to the point that the medical examiner has signed his death certificate. When he regains his health and memory, he goes back to Paris, where his \"widow\", Anne has married the Count Ferraud and is financing his rise to power using Chabert's money. Chabert hires a lawyer to help him get back his money and his honor."},
{"imdbId": "tt0059170", "storyLine": "\nThree strippers seeking thrills encounter a young couple in the desert. After dispatching the boyfriend, they take the girl hostage and begin scheming on a crippled old man living with his two sons in the desert, reputedly hiding a tidy sum of cash. They become houseguests of the old man and try and seduce the sons in an attempt to locate the money, not realizing that the old man has a few sinister intentions of his own."},
{"imdbId": "tt0110186", "storyLine": "\nThe story of a young man, Jason (Allen Payne) who must confront his trauma-induced insecurity about love, as well as a sense of owed responsibility to his mother and troubled brother Joshua (Bokeem Woodbine). Jason, an assistant manager and sales clerk at an electronics store, falls in love with Lyric (Jada Pinkett Smith) and finds happiness, but his family history and mentally ill war veteran father, Maddog (Forest Whitaker) plague his life's plans before he can leave it all for a better life."},
{"imdbId": "tt0108069", "storyLine": "\nA boy born the size of a small doll is kidnapped by a genetic lab and must find a way back to his father in this inventive adventure filmed using stop motion animation techniques. Tom meets a variety of strange creatures and eventually discovers a race of miniature humans like himself."},
{"imdbId": "tt0111301", "storyLine": "\nCol. William Guile leads an army of soldiers into the country of Shadaloo to find traces to lead him to General M. Bison, who has captured many people including three missing soldiers. Among them is Carlos \"Charlie\" Blanka, in which Bison decides to turn into a hideous mutant. On the other hand, Chun Li is a reporter who seeks revenge against Bison for the death of her father years ago. Then two small time hustlers Ryu and Ken, are arrested along with Sagat, a powerful arms dealer and Vega for dealing of illegal weapons. Guile recruits them in order to find Bison's base. Now Guile, T. Hawk, Cammy, Ryu, Ken, Chun Li, Balrog and E. Honda have three days before Bison murders the hostages and takes over the world."},
{"imdbId": "tt0113827", "storyLine": "\nMatteo Juarez is a retired detective hired by a local businessman to follow his wife Jennifer. She has a split personality and seems to be putting herself in danger without knowing it."},
{"imdbId": "tt0110027", "storyLine": "\nThe third Highlander movie takes place at 1994, which means it's a prequel of the second film. After the death of his beloved wife Heather some centuries ago, Connor MacLeod left the highlands of Scotland and wandered around the world. Finally, he got to Japan, where he met the famous sorcerer Nakano, who was an Immortal too. Soon, they became friends, and Nakano taught Conor some tricks. But one day, an old enemy, Kane, came to Japan willing to find Nakano's cave and kill him. Although he succeeded, after cutting Nakano's head the mountain collapsed and Kane was trapped. Now, centuries after, an excavation reveals Nakano's cave..."},
{"imdbId": "tt0113409", "storyLine": "\nWith the disappearance of hack horror writer Sutter Cane, all Hell is breaking loose...literally! Author Cane, it seems, has a knack for description that really brings his evil creepy-crawlies to life. Insurance investigator John Trent is sent to investigate Cane's mysterious vanishing act and ends up in the sleepy little East Coast town of Hobb's End. The fact that this town exists as a figment of Cane's twisted imagination is only the beginning of Trent's problems."},
{"imdbId": "tt0109021", "storyLine": "\nThis film chronicles the life of Lane Frost, 1987 PRCA Bull Riding World Champion, his marriage and his friendships with Tuff Hedeman (three-time World Champion) and Cody Lambert."},
{"imdbId": "tt0109035", "storyLine": "\nStory of Kyle-Lee Watson, a promising high school basketball star, and his relationships with Birdie, a powerful drug dealer, and Birdie's brother, Thomas 'Shep' Sheppard, himself once a promising high school star at Kyle's school, now employed as a security guard."},
{"imdbId": "tt0106220", "storyLine": "\nWhen an adorable baby boy is added to the Addams household, Wednesday and Pugsley do not hate the baby, they just aren't necessarily excited about his existence. Ok, yeah they do hate the baby. So Wednesday and Pugsley must get rid of the new addition one way or another. Meanwhile a new nanny is added to the household who overtakes Fester. The Addams must stop the nanny, but how?            "},
{"imdbId": "tt0106226", "storyLine": "\nSociety scion Newland Archer is engaged to May Welland, but his well-ordered life is upset when he meets May's unconventional cousin, the Countess Olenska. At first, Newland becomes a defender of the Countess, whose separation from her abusive husband makes her a social outcast in the restrictive high society of late-19th Century New York, but he finds in her a companion spirit and they fall in love."},
{"imdbId": "tt0109068", "storyLine": "\nThree would be rockers Chazz, Rex and Pip, known as The Lone Rangers plan to play their demo on a recording company, but then they're turned down rudely. Then they decide to try the famous rock n' roll radio station, but are not accepted either. Then they decide arm themselves with squirt guns and take the station hostage for not playing their demo. But the three get more than what they have bargained for."},
{"imdbId": "tt0109067", "storyLine": "\nJimmy Dolan is a college basketball coach who wants a big promotion. To get it, he needs to make a dramatic find. He ends up deep in Africa, hoping to recruit Saleh, a huge basketball prodigy Jimmy glimpsed in a home movie. But Saleh is the chief's son and has responsibilities at home, since the tribe's land is threatened by a mining company with its own hotshot basketball team."},
{"imdbId": "tt0106292", "storyLine": "\nChris and Bill are called upon for their excellent surveillance record to stakeout a lakeside home where a Mafia trial witness is believed to be heading or already hiding. Unlike their earlier _Stakeout_, this time they are accompanied by Gina Garret from the DA's office and her pet rottweiler 'Archie'; their cover, husband and wife with son Bill."},
{"imdbId": "tt0109198", "storyLine": "\nWhen saloon prostitute Cody Zamora rescues her friend Anita from an abusive customer by killing him, she is sentenced to hang. However, Anita and their two friends Eileen and Lilly rescue Cody and the four make a run for Texas, pursued by Graves and O'Brady, two Pinkerton detectives hired to track them. When Cody withdraws her savings from a Texas bank, the women believe they can now start a new life in Oregon. But Cody's old partner Kid Jarrett takes Cody's money when his gang robs the bank, and so the four so-called \"Honky- Tonk Harlots\" set out to recover the money, with the Pinkertons hot on their trail."},
{"imdbId": "tt0109219", "storyLine": "\nTed, a stuffy white guy from Illinois working in sales for the Barcelona office of a US corporation, is paid an unexpected visit by his somewhat less stuffy cousin Fred, who is an officer in the US Navy. Over the next few months, both their lives are irrevocably altered by the events which follow Fred's arrival, events which are the trivial stuff of a comedy of manners at first but which gradually grow increasingly dramatic."},
{"imdbId": "tt0106379", "storyLine": "\nFive bittersweet vignettes that span the entire human history about five different men, all called Hector and played by the same actor (Robin Williams), who find themselves at a critical juncture in their lives. In prehistoric times, Hector lives in peace with his wife and their little son and daughter in a cave on a quite uninhabited island somewhere in the north. His world is shattered when a group of foreign pagan raiders led by a young chieftain and a somewhat pacifistic priest arrive there. In Ancient Rome, Hector is a loyal well-treated slave of Lucinnius, a somewhat naive big trader with political connections. When his latest shipment fails to arrive and the local corrupt governor Cyprion refuses to lend him money for his further endeavors due to bad omen that a professional soothsayer saw while reading the future from a chicken liver, he is ruined. To make things worse, just as Hector plans to ask his master for freedom and elope with his master's female African slave Thalia, ...            "},
{"imdbId": "tt0106400", "storyLine": "\nJed Clampett and kin move from Arkansas to Beverly Hills when he becomes a billionaire, after an oil strike. The country folk are very naive with regard to life in the big city, so when Jed starts a search for a new wife there are inevitably plenty of takers and con artists ready to make a fast buck."},
{"imdbId": "tt0109254", "storyLine": "\nIn Detroit, Axel Foley leads a raid on a chop shop. When they go in, the people inside start shooting at them. Foley's boss, Inspector Todd, joins them. Someone shoots Todd and before dying Todd tells Foley to get him. Foley tries to catch him but some Feds stop him. They don't tell him why they're letting him get away. Based on things the shooters left behind, leads Foley to believe that the shooters have ties to an amusement park in Beverly Hills. So Foely goes there and asks his old friend, Billy Rosewood who's been promoted to a \"prestigious position\" for help. He meets Billy's new partner, Jon Flint. He asks if they know anyone at the amusement park and Flint tells him he knows the head of security, Ellis DeWald. Foley goes to the park and after a little misadventure, he meets DeWald and recognizes him as the man who killed Todd. But everybody including Flint tells Foley DeWald is a good guy. But Axel knows he's the one. He would be approached a park employee who tries to help ..."},
{"imdbId": "tt0109279", "storyLine": "\nBlack Beauty, a beautiful black stallion in 1870s England, recalls his life from his birth through his carefree life as a colt to the many hardships he suffered after achieving maturity. He goes through many owners, both good and bad, until he finally finds happiness and contentment."},
{"imdbId": "tt0109297", "storyLine": "\nEmma is an attractive girl in her 20s who has been blind for 20 years. A new type of eye operation partially restores her sight, but she is having problems: sometimes she doesn't \"remember\" what she's seen until later. One night she is awakened by a commotion upstairs. Peering out of her door, she sees a shadowy figure descending the stairs. Convinced that her neighbour has been murdered she approaches the police, only to find that she is unsure if it was just her new eyes playing tricks on her."},
{"imdbId": "tt0109303", "storyLine": "\nJimmy Dove works for the bomb squad in Boston and he is always the one who is on the tough jobs. One day he decides to quit the force and to become a teacher for the rookies of the squad. A few days later his former partner is killed by a bomb and Jimmy becomes suspicious that maybe this bomb could have been built by a former friend of himself. He begins to investigate and finds out that his worst nightmare has returned from his past."},
{"imdbId": "tt0109305", "storyLine": "\nPete Bell, a college basketball coach is under a lot of pressure. His team isn't winning and he cannot attract new players. The stars of the future are secretly being paid by boosters. This practice is forbidden in the college game, but Pete is desperate and has pressures from all around."},
{"imdbId": "tt0109306", "storyLine": "\nIt's the early 1960s. Nuclear engineer Hank Marshall is a major in the US Army, he who works on top secret nuclear testing projects. Trouble follows him from posting to posting largely because of his mentally unstable wife, Carly Marshall, who is bipolar. During her manic phases, her already overt sexuality, which she models after such sex symbols as "},
{"imdbId": "tt0106452", "storyLine": "\nFamily moves to military base for the summer, but the soldiers are behaving even more strangely than usual. Is it a toxic spill as suggested or is it something more sinister?"},
{"imdbId": "tt0106471", "storyLine": "\nA top surgeon is besotted with a beautiful woman who once ditched him. Unable to come to terms with life without her, he tries to convince her that they need each other. She has other ideas, but an horrific accident leaves her at his mercy. The plot is bizarre and perhaps sick at times, ending abruptly and with a twist."},
{"imdbId": "tt0106489", "storyLine": "\nGangster Sonny is the big man in the Bronx neighborhood of an Italian small boy named Calogero. A shooting witnessed by the boy (nicknamed C) is the starting point of a lasting bond between the gangster and the boy. Father (bus driver Lorenzo), however, disapproves. C grows up under the wing of both men, torn between his own natural honesty and his fascination with Sonny. C's neighborhood cronies get involved in theft, use of guns, and racial fights. When C falls for an African American girl, things don't get any easier. C's leap to manhood is marked by tragedy, but also by his recognition of the many faces of love."},
{"imdbId": "tt0109361", "storyLine": "\nSnobby school boy goes left and mistakes the \"Filthy Whore\" for his millionaire dad's yacht. He joins four filthy fishermen for hijinx on the high seas."},
{"imdbId": "tt0106519", "storyLine": "\nA Puerto Rican ex-con pledges to stay away from his former drug dealing ways but finds himself being dragged back by his past connections and the naive machinations of his lawyer and best friend. Hoping to raise enough money to get away from New York, Carlito Brigante takes on the job of running a nightclub, renews an affair with a dancer but old associates and old instincts suck him back into a world of violence and mistrust."},
{"imdbId": "tt0109439", "storyLine": "\nThe second part of City Slickers begins after the death of Curly. It is the 40th birthday of Mitch Robbins and the day begins quite good until he returns home (after a hard day at the radio station) and finds his brother Glen, the black sheep of the family, in his sofa. Nevertheless he is about to have a wonderful birthday-night with his wife when he discovers a treasure map of Curly by chance. Together with Phil (from the first part) and unfortunately with Glen he tries to find the hidden gold of Curly's father in the desert of Arizona instead of attending a meeting in Las Vegas. The adventurous journey reveals many surprises until everything seems to be over when the map gets lost..."},
{"imdbId": "tt0109443", "storyLine": "\nPogue is a private eye with a problem: every morning when he wakes up, he has total amnesia, waking up with a 'blank slate'. Since he is in the middle of a hot investigation and has a developing romance, this is less than convenient."},
{"imdbId": "tt0106582", "storyLine": "\nWhilst crossing a ledge, 4000 feet above the earth, Gabe's friend's equipment fails to work and she slips out of his hand, falling to the ground. Almost a year later, Gabe is asked to go back to the same mountain range and rescue a group of 'stranded' people. The only catch is that these so called 'stranded' people are in fact looking for three boxes filled with $100,000,000 and they need a mountain ranger to lead them to them!!"},
{"imdbId": "tt0106598", "storyLine": "\nAn alien couple known as Beldar and Prymatt with cone-shaped heads from the planet called Remulak is mistakingly ditched on earth, during a scouting mission for planet conquest. While here, they dodge the INS, have a child and discover that life on Earth is quite good. But unfortunately they are being chased by the government who knows something is not quite right with the Conehead family. After they are rescued and taken back to their planet, Belder vows to return to earth and conquer it!"},
{"imdbId": "tt0109456", "storyLine": "\nPsychologist Bill Capa gives up his practise when he unintentionally pushes a patient to commit suicide. In an effort to come to terms with this tragedy he visits an old colleague, Bob Moore, who is subsequently murdered. The quest to catch the killer centres around a group of Moore's psychologically disturbed patients, however equally as important is an affair which develops between Capa and the mysterious Rose."},
{"imdbId": "tt0109480", "storyLine": "\nWhen police discover that a mob hitman has moved in next door to the Robbersons, they want to find out what he is up to. So they set up a stakeout in the Robbersons' home. Hard-nosed, tough-as-nails Jake Stone is assigned to the stakeout. But now it's a question of whether Jake can last long enough to capture the bad guys. The Robbersons want to help so they are driving him crazy."},
{"imdbId": "tt0109493", "storyLine": "\nBuddies Pepper Lewis ("},
{"imdbId": "tt0106660", "storyLine": "\nEddie Israel is a moviemaker. He is beginning the shooting of \"The mother of mirrors\", starring Francis Burns and Sarah Jennings. \"The mother of mirrors\" is the story of the last night of a couple falling into decay. Eddie is very demanding with the actors, and the heavy atmosphere of the film acts upon the daily life of the protagonists."},
{"imdbId": "tt0106673", "storyLine": "\nBill Mitchell is the philandering and distant President of the United States. Dave Kovic is a sweet-natured and caring Temp Agency operator, who by a staggering coincidence looks exactly like the President. As such, when Mitchell wants to escape an official luncheon, the Secret Service hires Dave to stand in for him. Unfortunately, Mitchell suffers a severe stroke whilst having sex with one of his aides, and Dave finds himself stuck in the role indefinitely. The corrupt and manipulative Chief of Staff, Bob Alexander, plans to use Dave to elevate himself to the White House - but unfortunately, he doesn't count on Dave enjoying himself in office, using his luck to make the country a better place, and falling in love with the beautiful First Lady..."},
{"imdbId": "tt0106677", "storyLine": "\nIt's the last day of school at a high school in a small town in Texas in 1976. The upperclassmen are hazing the incoming freshmen, and everyone is trying to get stoned, drunk, or laid, even the football players that signed a pledge not to."},
{"imdbId": "tt0106697", "storyLine": "\nFrozen in 1996, Simon Phoenix, a convicted crime lord, is revived for a parole hearing well into the 21st century. Revived into a society free from crime, Phoenix resumes his murderous rampage, and no one can stop him. John Spartan, the police officer who captured Phoenix in 1996, has also been cryogenically frozen, this time for a crime he did not commit. In 2032, the former cities of Los Angeles, San Diego and Santa Barbara have merged into peaceful, utopian San Angeles. Unable to stop him with their non-violent solutions, the police release Spartan to help recapture Phoenix. Now after 36 years, Spartan has to adapt himself to the future society he has no knowledge about."},
{"imdbId": "tt0109729", "storyLine": "\nBruce Brown, king of surfing documentaries, returns after nearly thirty years to trace the steps of two young surfers to top surfing spots around the world. Along the way we see many of the people and locales Bruce visited during the filming of Endless Summer (1966)."},
{"imdbId": "tt0106834", "storyLine": "\nSissy Hankshaw is born with enormous thumbs that help her hitchhiking through the U.S. from a young age. She becomes a model in advertising, and her New York agent, \"the Countess\", sends her to his ranch in California to shoot a commercial, set against the background of mating whooping cranes. There, she befriends Bonanza Jellybean, one of the cowgirls at the beauty ranch. The cowgirls take command of the ranch from the Countess, and drug the cranes with peyote. The police besiege the ranch."},
{"imdbId": "tt0106873", "storyLine": "\nA spoof of the late 80s and early 90s suspense thrillers and murder mysteries, including Basic Instinct, Sleeping With The Enemy, Cape Fear and others. A cop/attorney (yes he's both) is seduced by a woman while his wife is having an affair with a mechanic. Lots of other sublots and visual gags in the style of Naked Gun. Check the rating !"},
{"imdbId": "tt0106332", "storyLine": "\n\"Farewell, My Concubine\" is a movie with two parallel, intertwined stories. It is the story of two performers in the Beijing Opera, stage brothers, and the woman who comes between them. At the same time, it attempts to do no less than squeeze the entire political history of China in the twentieth century into a three-hour time-frame."},
{"imdbId": "tt0109783", "storyLine": "\nKathy is married to Peter. Now she can't help but wonder how things could have been if she got together with her old boyfriend, Tom. Being married prevents from doing that so she asks her friend, Emily to go to him and see if she can sleep with him then tell Kathy how it was. When Emily tells Kathy that things were awesome, their friendship suffers, at the same so does Kathy's marriage. Things get even more complicated when Emily learns she's pregnant, and she's not certain if it's Tom's or her boyfriend, Elliot."},
{"imdbId": "tt0106881", "storyLine": "\nAfter a terrible air disaster, survivor Max Klein emerges a changed person. Unable to connect to his former life or to wife Laura, he feels godlike and invulnerable. When psychologist Bill Perlman is unable to help Max, he has Max meet another survivor, Carla Rodrigo, who is racked with grief and guilt since her baby died in the crash which she and Max survived."},
{"imdbId": "tt0106880", "storyLine": "\nA mockumentary chronicling the rise and fall of NWH, a not particularly talented--or particularly bright but always controversial--hip-hop group.            "},
{"imdbId": "tt0111732", "storyLine": "\nMonty is a student, and when his computer crashes, he's left with only a single paper copy of his thesis. Frightened of losing it, he immediately rushes out to photocopy it, only to stumble and drop it down a grate. Searching the basement of the building, he discovers that it has been found by Simon, a squatter. Simon makes a deal with Monty: for every day's accomodation and food that Monty gives him, he will give a page of the thesis in return."},
{"imdbId": "tt0106926", "storyLine": "\nSome thirty years after Arlis witnesses his father murdering a family, he runs into Kay, who happens to be the family's baby who was spared. Kay and Arlis suspect nothing about each other, but when his father returns, old wounds are reopened."},
{"imdbId": "tt0111712", "storyLine": "\nEdwina has just moved into the neighborhood known as \"Widows' Peak,\" so called due to the prevalent marital status of the residents, who tend to be a rather exclusive bunch. The residents are all curious about their new neighbor, but no one can seem to get much information about her, including queen bee Mrs. DC, whose son is busy wooing Edwina. Miss O'Hare and Edwina have an immediate dislike for each other, however, and soon some accidental encounters begin to look like Edwina is trying to ruin her new rival. The problems escalate and the town is in an uproar, but they get no closer to solving the mystery of the newcomer."},
{"imdbId": "tt0106941", "storyLine": "\nDoug is a young man who works all day as a concierge at a luxurious hotel, saving money to make his own business. Unfortunately, when he finds the financial supporter he needs, he discovers that his \"saviour\" is having an affair with the woman he loves! Now, he must choose between money and love..."},
{"imdbId": "tt0106918", "storyLine": "\nMitch McDeere is a young man with a promising future in Law. About to sit his Bar exam, he is approached by 'The Firm' and made an offer he doesn't refuse. Seduced by the money and gifts showered on him, he is totally oblivious to the more sinister side of his company. Then, two Associates are murdered. The FBI contact him, asking him for information and suddenly his life is ruined. He has a choice - work with the FBI, or stay with the Firm. Either way he will lose his life as he knows it. Mitch figures the only way out is to follow his own plan..."},
{"imdbId": "tt0106965", "storyLine": "\nFishermen separate a young orca whale (Willy) from his parents and he ends up in a fish bowl at a marina. Meanwhile, a street kid runs afoul of the law and gets caught vandalising the marina, but his social worker gets him off the hook (so to speak) provided he cleans up his mess at the marina. While there, he befriends the whale and teaches him tricks, something the trainer hasn't been able to do. But when Willy is a dud in front of the audience, the marina owner plans some bad things, and the boy and his friends must try to (*** MAJOR SPOILERS ***) free Willy."},
{"imdbId": "tt0109842", "storyLine": "\nFresh (Sean Nelson) is a 12-year-old drug dealer who finds himself trapped in a web of poverty, corruption and racial tension in Brooklyn, New York. When his drug-addict sister Nichole (N'Bushe Wright) starts sleeping with local drug lord Esteban (Giancarlo Esposito), Fresh calls upon the skills he learned playing chess with his alcoholic father and speed-chess champion Sam (Samuel L. Jackson) and devises a complex strategy that will free both himself and his sister."},
{"imdbId": "tt0106977", "storyLine": "\nA well respected Chicago surgeon Dr. Richard Kimble has found out that his wife, Helen, has been murdered ferociously in her own home. The police found Kimble and accused him of the murder. Then, Kimble (without Justifiable Reason) was tried, convicted, and sentenced to death. However, on the way to prison, Kimble's transport crashed. Kimble escapes and is now on the run. Deputy Samuel Gerard from Chicago takes charge of the chase of Kimble. Meanwhile, Kimble takes up his own investigation to find who really killed his wife, and to lure Gerard and his team into it as well."},
{"imdbId": "tt0107004", "storyLine": "\nThe Apache Indians have reluctantly agreed to settle on a US Government approved reservation. Not all the Apaches are able to adapt to the life of corn farmers. One in particular, Geronimo, is restless. Pushed over the edge by broken promises and necessary actions by the government, Geronimo and thirty or so other warriors form an attack team which humiliates the government by evading capture, while reclaiming what is rightfully theirs."},
{"imdbId": "tt0109890", "storyLine": "\nDoc McCoy is put in prison because his partners chickened out and flew off without him after exchanging a prisoner with a lot of money. Doc knows Jack Benyon, a rich \"business\"-man, is up to something big, so he tells his wife (Carol McCoy) to tell him that he's for sale if Benyon can get him out of prison. Benyon pulls some strings and Doc McCoy is released again. Unfortunately he has to cooperate with the same person that got him to prison."},
{"imdbId": "tt0109891", "storyLine": "\nRay, an ex-con and widower, is planning a coin heist with two accomplices to help him to buy his own bakery. However, he doesn't expect his son Timmy, who was living with Ray's sister, to show up at the house right in the middle of planning. Timmy is ignored and Ray and his buddies pull off the heist. Timmy gets his father's attention by stealing the coins and hiding them. To get them back, his father must take him to a number of different places and treat him like he enjoys his presence. They grow fond of each other but Timmy won't stay with his dad unless he gives up the coins."},
{"imdbId": "tt0109913", "storyLine": "\nMax is a trendy, pretty, young lesbian, who is having trouble finding love. A friend sets her up with Ely, whom Max likes, but Ely is frumpy, homely, and older. Nor do they have much in common. Can Max learn to look past the packaging?"},
{"imdbId": "tt0107057", "storyLine": "\nA man accused of murdering his wife approaches a hotshot female criminal attorney to take his case. The man is a self-professed womaniser, and his alleged motive would be the large sum of money his wife left him. The attorney begins to have second thoughts about representing him when he starts making it look like they're having an affair and tells her things she can't reveal because of lawyer/client privilege, so she starts her own investigation of him, which threatens her career and the safety of her friends and herself."},
{"imdbId": "tt0107076", "storyLine": "\nNatasha Binder comes to New Orleans looking for her father, who has gone missing. In doing so, she meets a very hard man called Chance. He helps her find out that her father was killed by an organisation who sell the opportunity to hunt human prey. They are taking advantage of a police strike in New Orleans. Will the Muscles from Brussels win through?"},
{"imdbId": "tt0107096", "storyLine": "\nThe final movie in Oliver Stone's Vietnam trilogy follows the true story of a Vietnamese village girl who survives a life of suffering and hardship during and after the Vietnam war. As a freedom fighter, a hustler, young mother, a sometime prostitute, and the wife of a US. marine, the girl's relationships with men suggests an analogy of Vietnam as Woman and the U.S. as Man."},
{"imdbId": "tt0107144", "storyLine": "\nTopper Harley is found working as an odd-job-man in a monastery. The CIA wants him to lead a rescue mission into Iraq, to rescue the last rescue team, who went in to rescue the last rescue team who... who went in to rescue hostages left behind after Desert Storm. The President is Tug Benson, who also likes to be in on the action. Basically, it's a send-up of all the big shoot-em-up Rambo/Robocop/T2/Commando-type movies."},
{"imdbId": "tt0113674", "storyLine": "\nGeorgina throws a sleepover party for her friend Jamie, a moderately successful actress, on the night of Jamie's fiancée's bachelor party. Jill, Jamie, Marcy, Rachel, and Georgina have been friends since childhood, and as the evening progresses they talk about a variety of topics: Georgina's heterosexual fantasies and her uncertainties about Chris, her live-in lover; Jamie's doubts and insecurities about marriage; and all of their attitudes toward sex and sexual fantasies."},
{"imdbId": "tt0112966", "storyLine": "\nTwo English cartographers visit the small South Wales village of Ffynnon Garw, to measure what is claimed to be the \"first mountain inside of Wales\". It's 1917, and the war in Europe continues. The villagers are very proud of their \"mountain\", and are understandably disappointed and furious to find that it is in fact a \"hill\". Not to be outwitted by a rule (and the Englishmen who enforce it), the villagers set out to make their hill into a mountain, but to do so they must keep the English from leaving, before the job is done."},
{"imdbId": "tt0107151", "storyLine": "\nChile, second half of the 20th century. The poor Esteban marries Clara and they get a daughter, Blanca. Esteban works hard and eventually gets money to buy a hacienda, eventually to become a local patriarch. He becomes very conservative and is feared by his workers. When Blanca grows up, she falls in love with a young revolutionary, Pedro, who urges the workers to fight for socialism. It is unavoidable that Pedro and Esteban are pitted against each other. Esteban tries to stop the love affair between Pedro and his daughter by all means possible but soon Blanca becomes pregnant and has a daughter. The void between father and daughter seems unbridgeable when Blanca moves in with Pedro."},
{"imdbId": "tt0110064", "storyLine": "\nCome to a new House Party, where Kid, after a lifetime 'playing the field', falls in love and is about to get married. 'Play' plans to throw the rockin'est bachelor party ever - until 'Kid's' three wise-crackin' nephews come to town, intent on showing 'Kid' and 'Play' what parties are all about..."},
{"imdbId": "tt0110074", "storyLine": "\nWhen Waring Hudsucker, head of hugely successful Hudsucker Industries, commits suicide, his board of directors, led by Sidney Mussberger, comes up with a brilliant plan to make a lot of money: appoint a moron to run the company. When the stock falls low enough, Sidney and friends can buy it up for pennies on the dollar, take over the company, and restore its fortunes. They choose idealistic Norville Barnes, who just started in the mail room. Norville is whacky enough to drive any company to ruin, but soon, tough reporter Amy Archer smells a rat and begins an undercover investigation of Hudsucker Industries."},
{"imdbId": "tt0110097", "storyLine": "\nMatt Hobbs is a talented but unsuccessful actor. When estranged (and strange) ex-wife Beth dumps their daughter Jeannie on Matt, father and daughter have a lot of adjusting to do. His budding relationship with attractive production assistant Cathy Breslow is made complicated, while the precocious child is overly accustomed to getting her own way. Matt eventually faces the choice of family vs career in a particularly difficult way."},
{"imdbId": "tt0110123", "storyLine": "\nBones and Jack are two guys with very little going right in their lives. The two decide to join the Army as part of the water purification team and eventually find themselves on the front lines in the conflict between the northern African countries of Chad and Libya. The two men, along with a few companions, have it upon themselves to save the day in combat, something they know little about."},
{"imdbId": "tt0107206", "storyLine": "\nFrank Horrigan is a secret service agent who keeps thinking back to November 22, 1963, when, as a hand-picked agent by President Kennedy, he became one of the few agents to have lost a President to an assassin when Kennedy died. Now, former CIA assassin Mitch Leary is stalking the current President, who is running for re-election. Mitch has spent long hours studying Horrigan, and he taunts Horrigan, telling him of his plans to kill the President. Leary plans to kill the president because Leary feels betrayed by the government -- Leary was removed from the CIA, and the CIA is now trying to have him killed. After talking to Leary, Horrigan makes sure he is assigned to presidential protection duty, working with fellow secret service agent Lilly Raines. Horrigan has no intention of failing his President this time around, and he's more than willing to take a bullet. White House Chief of Staff Harry Sargent refuses to alter the President's itinerary, while Horrigan's boss, Secret Service ..."},
{"imdbId": "tt0107207", "storyLine": "\nA small time thief from Belfast, Gerry Conlon, is falsely implicated in the IRA bombing of a pub that kills several people while he is in London. Bullied by the British police, he and four of his friends are coerced into confessing their guilt. Gerry's father and other relatives in London are also implicated in the crime. He spends 15 years in prison with his father trying to prove his innocence with the help of a British attorney, Gareth Peirce. Based on a true story."},
{"imdbId": "tt0110137", "storyLine": "\nIn 1976, Drew Tate is a young teenager who has trouble dealing with life after he accidentally sets his house on fire. His parents Kenny and Brenda decide to go to Martha's Vineyard to spend Fourth of July weekend with Brenda's sister Francis, Francis' black Republican husband Spencer and their son Junior. While there Drew falls for a self centered girl named Lauren and befriends a married lady named Heather. While on their vacation, Drew deals with his parents attempts to save their marriage as well as with his own troubles. Eventually all of this leads to a life changing event for Drew as well as his parents."},
{"imdbId": "tt0108551", "storyLine": "\nAnna Mae Bullock always had a special voice. Soon after arriving in St. Louis to live with the mother who had walked out when she was small, the now teenage Anna Mae soon attracts the attention of pop group leader Ike Turner. She becomes the band's singer, his wife, and mother to his children - not all hers. In love with Ike and determined not to leave in the way her mother had, she finds herself the target of increasing violence from her unstable husband who can't see who is making the band such a success."},
{"imdbId": "tt0107286", "storyLine": "\nFour pals are on their way to a boxing match, but get stuck in heavy traffic. To get to the boxing match in time they take the first exit they find to find another way to the venue. As they are driving around lost in gang-land they get stuck and witness a brutal murder. The killer wants no witnesses and tries to kill them too. The four pals get away the first time, but the killer is soon back on their tail again while they are trying to find help in the middle of nowhere."},
{"imdbId": "tt0107290", "storyLine": "\nHuge advancements in scientific technology have enabled a mogul to create an island full of living dinosaurs. John Hammond has invited four individuals, along with his two grandchildren, to join him at Jurassic Park. But will everything go according to plan? A park employee attempts to steal dinosaur embryos, critical security systems are shut down and it now becomes a race for survival with dinosaurs roaming freely over the island."},
{"imdbId": "tt0107302", "storyLine": "\nBrian Kessler, a journalist researching serial killers, and his photographer girlfriend Carrie set out on a cross-country tour of the sites of the killings. Sharing the ride and their expenses are Early Grayce, a paroled white trash criminal, and his girlfriend Adele. As the trip progresses, Early begins to appear more and more unstable, and Brian and Carrie begin to fear that they may have a real-life killer in the back seat of their car."},
{"imdbId": "tt0110265", "storyLine": "\nZed has only just arrived in the beautiful Paris and already he's up to no good. Having just slept with a call girl, he spends a night on the town with his dangerous friends. They all decide to rob a bank the following day. There's only one problem: Zed's call-girl, Zoe, just happens to work at the bank which is to be robbed!"},
{"imdbId": "tt0107322", "storyLine": "\nA boy whose mother is forced into a sanitarium and father gets a job as a traveling salesman. The boy fends for himself in a seedy SRO hotel."},
{"imdbId": "tt0110305", "storyLine": "\nThe dog everyone loves now leaps into the '90s in this all-new exciting, updated version of Lassie! Determined to start a new life in the country, the Turner Family - Dad, stepmom, little Jennifer and teenager Matt - leaves the city for the wilds of Virginia. The move creates problems for everyone, especially Matt, who feels lost and alone in his new surroundings. Fortunately, the Turners are helped by a homeless collie who becomes part of their lives - and Matt does a lot of growing up as a result of the dog's unflinching loyalty. Watch the extraordinary collie protect Matt from a snarling wolf, rescue him from a raging waterfall or just nuzzle up for affection, and you'll know Lassie is more than a story of a boy and his dog - it's the story of a boy and the most remarkable dog in the world!"},
{"imdbId": "tt0107362", "storyLine": "\nYoung Danny Madigan is a big fan of Jack Slater, a larger-than-life action hero played by Arnold Schwarzenegger. When his best friend, Nick the projectionist, gives him a magic ticket to the new Jack Slater film, Danny is transported into Slater's world, where the good guys always win. One of Slater's enemies, Benedict the hitman, gets hold of the ticket and ends up in Danny's world, where he realises that if he can kill Schwarzenegger, Slater will be no more. Slater and Danny must travel back and stop him."},
{"imdbId": "tt0107413", "storyLine": "\nMichael Chapman was once a child TV star. But when he grew up, he couldn't get work. So he and his brother, Ed start their own talent agency that specializes in child acts. They can't seem to find the next big thing and they have to deal with another agency who's not above bribery to get the kids to sign with them. One day Michael meets a girl named Angie and she's a real spitfire. Michael thinks she could be what they are looking for. Problem is that she has a big chip on her shoulder."},
{"imdbId": "tt0110353", "storyLine": "\nLightning Jack Kane is an Australian outlaw in the wild west. During a bungled bank robbery he picks up mute Ben Doyle as a hostage. The two become good friends, with Jack teaching Ben how to rob banks, while they plan Jack's last heist."},
{"imdbId": "tt0107468", "storyLine": "\nDuring the Cultural Revolution in China in the mid-1960s, a French diplomat falls in love with a singer in the Beijing Opera. Interwoven with allusions to the Puccini opera \"Madama Butterfly\", a story of love and betrayal unfolds."},
{"imdbId": "tt0107478", "storyLine": "\nA young black woman discovers that her father was a sperm donor, and if that weren't bad enough, he's white.            "},
{"imdbId": "tt0107497", "storyLine": "\nA tale about a happily married couple who would like to have children. Tracy teaches children, Andy's a college professor. Things are never the same after she is taken to hospital and operated upon by Jed, a \"know it all\" doctor."},
{"imdbId": "tt0107501", "storyLine": "\nThe story of a relationship between a teacher and his troubled pupil. Justin McLeod is a former teacher who lives as a recluse on the edge of town. His face is disfigured from an automobile accident and fire ten years before in which a boy was incinerated and for which he was convicted of involuntary manslaughter. He is also suspected of being a pedophile. He is befriended by Chuck, igniting the town's suspicion and hostility. McLeod instills in his protégé a love of justice and freedom from prejudice which sustains Chuck beyond the end of the film."},
{"imdbId": "tt0107507", "storyLine": "\nLarry and Carol are fairly normal New Yorkers who have sent their son off to college. They meet an elderly couple down the hall and later in the week find that the wife has suddenly died. Carol becomes suspicious of Paul who seems to be too cheerful and too ready to move on. She begins her investigation. Larry insists she is becoming too fixated on their neighbor as all of the irregularities seem to have simple non-homicidal explanations. Ted, a recently divorced friend helps her investigation and Larry begins to become jealous of their relationship and agrees to help her."},
{"imdbId": "tt0107554", "storyLine": "\nThis urban nightmare chronicles several days in the life of Caine Lawson, following his high-school graduation, as he attempts to escape his violent existence in the projects of Watts, CA."},
{"imdbId": "tt0116253", "storyLine": "\nTerrorists take over a 747 bound from Athens to Washington D.C., supposedly to effect the release of their leader. Intelligence expert David Grant suspects another reason and convinces the military that the 'plane should not be allowed to enter U.S. airspace. An assault mission is devised, using a specially equipped 'plane designed for mid-air crew transfers, and Grant finds himself aboard the 747 with a team of military anti-terrorists who have to defuse a bomb and overpower the terrorists."},
{"imdbId": "tt0074102", "storyLine": "\nBased on a true story set in pre-war Japan, a man and one of his servants begin a torrid affair. Their desire becomes a sexual obsession so strong that to intensify their ardor, they forsake all, even life itself."},
{"imdbId": "tt0111689", "storyLine": "\nThis darkly humorous film explores the personal psychic landscape of two lonely New Yorkers. Jackie and Michael are coworkers at a large law firm, who decide to meet at Jackie's for dinner one night. As this 'first date' plays out, the audience is guided through a mental minefield of disappointment, desolation, and desperation. Their conversation, with its awkward 'small talk', slowly reveals their unhappy lives...."},
{"imdbId": "tt0107616", "storyLine": "\nYoung lovers Hero and Claudio are to be married in one week. To pass the time, they conspire with Don Pedro to set a \"lover's trap\" for Benedick, an arrogant confirmed bachelor, and Beatrice, his favorite sparring partner. Meanwhile, the evil Don Jon conspires to break up the wedding by accusing Hero of infidelity. In the end, though, it all turns out to be \"much ado about nothing.\""},
{"imdbId": "tt0107611", "storyLine": "\nThe story about the relationship between a manic depressive man, Mr Jones, and the female doctor who takes more than a professional interest in his treatment."},
{"imdbId": "tt0107613", "storyLine": "\nElectrician Gus gets the chance to fulfill a childhood dream by buying an old bowling-alley with some of his friends. Unfortunately, due to the alimony payments he has to make to his ex-wife Leonora, the bank refuses to loan him the down payment. Knowing that when she marries again she loses her alimony rights, Gus tries to speed things up by bringing Leonora together with all the potential husbands he can find. Although this approach isn't very successful, it awakens feelings in both of them they didn't know they still had."},
{"imdbId": "tt0107614", "storyLine": "\nEccentric actor Daniel Hillard is an amusing and caring father. But after a disastrous birthday party for his son, Daniel's wife Miranda draws the line and files a divorce. He can see his three children only once a week which doesn't sit well with him. Daniel also holds a job at a TV studio as a shipping clerk under the recommendation of his liason. But when Miranda puts out an ad for a housekeeper, Daniel takes it upon himself to make a disguise as a Scottish lady named Mrs Doubtfire. And Daniel must also deal with Miranda's new boyfriend Stu Dunemyer."},
{"imdbId": "tt0107653", "storyLine": "\nJohnny flees Manchester for London, to avoid a beating from the family of a girl he has raped. There he finds an old girlfriend, and spends some time homeless, spending much of his time ranting at strangers, and meeting characters in plights very much like his own."},
{"imdbId": "tt0110657", "storyLine": "\nDuring a commemoration for Japanese soldiers fighting in the US Army during World War II, Mr. Miyagi meets the widow of his commanding officer. He gets to know her granddaughter Julie, an angry teenager who is still feeling the pain of losing both her parents in an accident and is having problems with her grandmother and her fellow pupils. Mr. Miyagi decides to teach her karate to get her through her pain and issues and back on the right path."},
{"imdbId": "tt0110678", "storyLine": "\nRobbins is sentenced to prison for the assassination of his general officer, a prison you leave only when you die. Since nobody ever leaves the prison, nobody knows what the prison is like. The prison manager realizes this and buys himself an island playground called \"Absolom,\" where the worst prisoners are free to create an isolated barbaric society, and where the strongest men rule...a living hell. Robbins is sent to Absolom after he almost kills the prison manager."},
{"imdbId": "tt0110687", "storyLine": "\nEleven-year-old North has had it with his parents. They are always busy with their careers and don't give North the attention he needs, so he files a lawsuit against them. The judge rules that North should either find new parents or return to his own parents within two months. Thus north starts off on an hilarious journey around the world to find the parents that really care about him."},
{"imdbId": "tt0107756", "storyLine": "\nYoung nobleman Orlando is commanded by Queen Elizabeth I to stay forever young. Miraculously, he does just that. The film follows him as he moves through several centuries of British history, experiencing a variety of lives and relationships along the way, and even changing sex."},
{"imdbId": "tt0107808", "storyLine": "\nAfter escaping from a Huntsville prison, convict Butch Haynes and his partner Terry Pugh kidnap a young boy, Philip Perry, and flee across Texas. As they travel together, Butch and Philip discover common bonds and suffer the abuses of the outside \"Perfect World.\" In pursuit is Texas Ranger \"Red\" Garnett and criminologist Sally Gerber."},
{"imdbId": "tt0107818", "storyLine": "\nAndrew Beckett, a gay, HIV positive lawyer, is fired from his law firm in fear that they might contract HIV from him. After Andrew is fired, in a last attempt for peace, he sues his former law firm with the help of a homophobic lawyer, Joe Miller. During the court battle, Miller sees that Beckett is no different than anyone else on the gritty streets of the city of brotherly love, sheds his homophobia and helps Beckett with his case before AIDS overcomes him."},
{"imdbId": "tt0107822", "storyLine": "\nIt is the mid-nineteenth century. Ada is a mute who has a young daughter, Flora. In an arranged marriage she leaves her native Scotland accompanied by her daughter and her beloved piano. Life in the rugged forests of New Zealand's North Island is not all she may have imagined and nor is her relationship with her new husband Stewart. She suffers torment and loss when Stewart sells her piano to a neighbour, George. Ada learns from George that she may earn back her piano by giving him piano lessons, but only with certain other conditions attached. At first Ada despises George but slowly their relationship is transformed and this propels them into a dire situation."},
{"imdbId": "tt0107840", "storyLine": "\nAfter witnessing the murder of her first and only boyfriend, young Justice decides to forget about college and become a South Central Los Angeles hairdresser. Avoiding friends, the only way for her to cope with her depression is by composing beautiful poetry. On her way to a convention in Oakland, she is forced to ride with an independent-minded postal worker whom she has not gotten along with in the past. After various arguments between them and their friends, they start to discover that their thoughts on violence, socially and domestically, are the same. Justice may finally feel that she is not as alone as before."},
{"imdbId": "tt0107889", "storyLine": "\nA college football coach is told by his bosses that unless they do better this season it could be his last. To bolster the team he recruits a talented tail back. A female student is assigned to help him assimilate with college life and that includes doing his studies because he spent his whole life just playing football. And he finds himself attracted to her and she already has a boyfriend who is also on the team but he might be more concern about losing his position than losing her to him. And the coach has to deal with his other players' situations like the team's quarterback who deals with his father being distant by drinking and it eventually gets him in trouble. And one of the team's defensive players is obviously using steroids but passes the drug tests."},
{"imdbId": "tt0111003", "storyLine": "\nStrange aliens land in the Midwest, taking over people's minds in order to spread their dominion. Sam Nivens and Andrew Nivens, aided by Mary Sefton, are part of a government agency who must stop the the aliens before the aliens get to them..."},
{"imdbId": "tt0110939", "storyLine": "\nIn 1939, WBN, a fourth radio network, is about to take to America's airwaves. As if the confusion of the premiere night wasn't enough, Penny Henderson, the owner's secretary, must deal with an unhappy sponsor, an overbearing boss and a soon-to-be ex-husband who desperately wants her back. As the broadcast begins, a mysterious voice breaks the broadcast and suddenly members of the cast turn up dead. It's up to her husband Roger, to find out whodunit as the police chase him through the halls of WBN."},
{"imdbId": "tt0110955", "storyLine": "\nDenis Leary plays an unfortunate cat burglar, who is abandonded by his partner in the middle of a heist, and is forced to take an irritating Connecticut couple (Kevin Spacey, Judy Davis) hostage. He soon finds that he took more than he bargained for when the couple's blackmailing son and despicable in-laws step into the picture. Before long they're driving him nuts with their petty bickering and family problems. The only way for him to survive is to be their referee and resolve their differences, before he can be nabbed by the police."},
{"imdbId": "tt0107943", "storyLine": "\nA rule bound head butler's world of manners and decorum in the household he maintains is tested by the arrival of a housekeeper who falls in love with him in pre-WWII Britain. The possibility of romance and his master's cultivation of ties with the Nazi cause challenge his carefully maintained veneer of servitude."},
{"imdbId": "tt0110971", "storyLine": "\nA down-on-his-luck businessman desperately takes the only job offered - a teacher in the U.S. Army. His mission: keep a ragtag bunch of underachieving misfits from flunking out of basic training! Be on alert as this unlikely new teacher and his underdog class unexpectedly inspire each other to be all they can be!"},
{"imdbId": "tt0107969", "storyLine": "\nAt the offices of a Japanese corporation, during a party, a woman, who's evidently a professional mistress, is found dead, apparently after some rough sex. A police detective, Web Smith is called in to investigate but before getting there, he gets a call from someone who instructs him to pick up John Connor, a former police Captain and expert on Japanese affairs. When they arrive there Web thinks that everything is obvious but Connor tells him that there's a lot more going on."},
{"imdbId": "tt0111001", "storyLine": "\nA madcap portrayal of William Lightbody's stay at the health farm run by cereal king Dr. John Harvey Kellogg. William's wife, Eleanor, has persuaded him to go to Kellogg to have his system cleaned of impurities. Kellogg is very unconventional, and almost barbaric in his treatments."},
{"imdbId": "tt0107978", "storyLine": "\nThe mega corporation Omni Consumer Products is still bent on creating their pet project, Delta City, to replace the rotting city of Detroit. Unfortunately, the inhabitants of the area have no intention of abandoning their homes simply for desires of the company. To this end, OCP have decided to force them to leave by employing a ruthless mercenary army to attack and harass them. An underground resistance begins and in this fight, Robocop must decide where his loyalties lie."},
{"imdbId": "tt0107977", "storyLine": "\nRobin of Locksley, known as the most skilled archer of the land, has just returned to England after fighting in the Holy Crusades, where King Richard the Lionhearted is also fighting. Robin finds that much of what he knew of England has gone to ruin, including his longtime family home having been taken away, all at the hands of the evil Prince John, Richard's brother who has assumed the throne in Richard's absence. Neurotic John is basically being controlled by the equally evil Sheriff of Rottingham, everything they doing to fatten their own coffers at the expense of the commoners and peasants. As such, Robin recruits a band of merry men to help him battle Prince John and the Sheriff, they who include: Blinkin, his blind longtime servant; Ahchoo, the misguided son of Asneeze, the man who helped him escape from prison while fighting in the Crusades; Little John, who seems to think that being called Little is only coincidental to the fact of he being a hulking man; and Little John's ..."},
{"imdbId": "tt0107983", "storyLine": "\nDetective Jack Grimaldi (Gary Oldman) takes us through his shattered life after encountering the most deadly (and deceptive) criminal he has ever had to deal with. It doesn't help that Grimladi is playing both sides against the middle. When he encounters Demarkov (Lena Olin) he thinks he can play her as he has all the other women in his life...including his wife. But Demarkov knows Jack better than he knows himself. She plays him mercilessly, all the while threatening to kill him when she tires of the game."},
{"imdbId": "tt0105275", "storyLine": "\nNazi skinheads in Melbourne take out their anger on local Vietnamese, who are seen as threatening racial purity. Finally the Vietnamese have had enough and confront the skinheads in an all-out confrontation, sending the skinheads running. A woman who is prone to epileptic seizures joins the skins' merry band, and helps them on their run from justice, but is her affliction also a sign of impurity?"},
{"imdbId": "tt0108000", "storyLine": "\nRuby, a young woman, arrives in a Florida resort town during the off season to make a fresh start. She gets work as a sales clerk in a souvineer shop run by Mildred Chambers. She dates, and sleeps with, Ricky Chambers, Mildred's conceited son, but breaks off with him when she finds she's just another conquest. She gets involved with Mike, a left-wing greenhouse worker. As the seasons change, Ruby's relationships with others and herself go through metamorphoses as she makes choices and discoveries establishing her own identity. A character study."},
{"imdbId": "tt0108002", "storyLine": "\nRudy grew up in a steel mill town where most people ended up working, but wanted to play football at Notre Dame instead. There were only a couple of problems. His grades were a little low, his athletic skills were poor, and he was only half the size of the other players. But he had the drive and the spirit of 5 people and has set his sights upon joining the team."},
{"imdbId": "tt0105032", "storyLine": "\nJean is young, gay, and promiscuous. Only after he meets one or two women, including Laura does he come to realize his bisexuality. Jean has to overcome a personal crisis (he is HIV-positive) and a tough choice between Laura and his male lover Samy."},
{"imdbId": "tt0108052", "storyLine": "\nOskar Schindler is a vainglorious and greedy German businessman who becomes an unlikely humanitarian amid the barbaric German Nazi reign when he feels compelled to turn his factory into a refuge for Jews. Based on the true story of Oskar Schindler who managed to save about 1100 Jews from being gassed at the Auschwitz concentration camp, it is a testament to the good in all of us."},
{"imdbId": "tt0111094", "storyLine": "\nAl Percolo is a major league baseball scout sent to scout in Mexico as a punishment. However, he eventually stumbles across Steve Nebraska, a young American who can pitch AND hit better than anyone else can do either. He signs Steve and returns home in glory. It soon becomes obvious, though, that Steve is immature and possibly unstable, and Al turns to psychiatrist Doctor H. Aaron, whom he picks for her name, for help."},
{"imdbId": "tt0108065", "storyLine": "\nJosh Waitzkin is just a typical American boy interested in baseball when one day he challenges his father at chess and wins. Showing unusual precocity at the outdoor matches at Washington Square in New York City, he quickly makes friends with a hustler named Vinnie who teaches him speed chess. Josh's parents hire a renowned chess coach, Bruce, who teaches Josh the usefulness of measured planning. Along the way Josh becomes tired of Bruce's system and chess in general and purposely throws a match, leaving the prospects of winning a national championship in serious jeopardy."},
{"imdbId": "tt0108071", "storyLine": "\nLiving in India, Mary Lennox, a young, privileged girl, is left orphaned when her parents are killed in an earthquake. She is sent back to England where she goes to live on her uncle's estate. It is a fairly isolated existence and she has to find things to keep herself occupied. She finds a sickly young boy...and a secret garden."},
{"imdbId": "tt0111127", "storyLine": "\nA picture perfect middle class family is shocked when they find out that one of their neighbors is receiving obscene phone calls. The mom takes slights against her family very personally, and it turns out she is indeed the one harassing the neighbor. As other slights befall her beloved family, the body count begins to increase, and the police get closer to the truth, threatening the family's picture perfect world."},
{"imdbId": "tt0111143", "storyLine": "\nBased on the 1930's pulp fiction and radio drama series, the film pits the hero against his arch enemy, Shiwan Khan, who plans to take over the world by holding a city ransom using an atom bomb. Using his powers of invisibility and \"The power to cloud men's minds\", the Shadow comes blazing to the city's rescue with explosive results."},
{"imdbId": "tt0108101", "storyLine": "\n"},
{"imdbId": "tt0108122", "storyLine": "\nWhile helicopters overhead spray against a Medfly infestation a group of Los Angeles lives intersect, some casually, some to more lasting effect. Whilst they go out to concerts and jazz clubs and even have their pools cleaned, they also lie, drink, and cheat. Death itself seems never to be far away, even on a fishing trip."},
{"imdbId": "tt0111194", "storyLine": "\nMichael McCann is a man who feels totally betrayed by the world, after his wife revealed to him that their child was not his. A few years after his break-up we find him living alone in a small town. But, everything in his miserable life changes when he adopts a little girl whose mother died outside his house. After several years, the real father returns to claim the girl from Michael, thinking that she will be an advantage for his political career."},
{"imdbId": "tt0111201", "storyLine": "\nA young reverend and his wife are on the way from England to Australia to minister to their flock. The bishop asks him to visit an eccentric artist prone to sexual depictions and requests that he voluntarily withdraw a controversial work call \"Crucified Venus\" from his show. The minister, who considers himself a progressive, is shocked at the amoral atmosphere surrounding the painter, his wife, and the three models living at his estate. The minister's wife is troubled also, and has to deal with latent sexual urges while trying to remain loyal to her husband."},
{"imdbId": "tt0108149", "storyLine": "\nNew Yorkers Ouisa and Flan Kittredge are upper class private art dealers, pretentious but compassionate. Their prized possession is a double sided Kandinsky, one side that represents control, the other side chaos. They relay a story to their friends and acquaintances that over time becomes legendary. It is their encounter with a young black man who they had never met or heard of but who comes stumbling upon their front door one evening as they are courting an important investor, Geoffrey Miller, who could make them wealthy beyond what they could have dreamed. That black man is Paul Poitier, who has just arrived in the city, was just mugged outside their building and is sporting a minor knife wound to the abdomen. He is a friend of the Kittredge's children, who are attending Harvard, but more importantly is the son of actor/director "},
{"imdbId": "tt0108160", "storyLine": "\nAfter his wife Maggie passes away, Sam Baldwin and his 8-year-old son Jonah relocate from Chicago to Seattle to escape the grief associated with Maggie's death. Eighteen months later Sam is still grieving and can't sleep. Although Jonah misses his mother, he wants his father to get a new wife despite Sam having not even contemplated dating again. On Christmas Eve, Sam (on Jonah's initiative) ends up pouring his heart out on a national radio talk show about his magical and perfect marriage to Maggie, and how much he still misses her. Among the many women who hear Sam's story and fall in love with him solely because of it is Annie Reed, a Baltimore-based newspaper writer. Annie's infatuation with Sam's story and by association Sam himself is despite being already engaged. But Annie's relationship with her straight-laced fiancé Walter is unlike her dream love life in the movie "},
{"imdbId": "tt0108162", "storyLine": "\nCarly Norris is a book editor living in New York City who moves into the Sliver apartment building. In the apartment building, Carly meets two of her new neighbors, author Jack Lansford who writes thriller novels and Zeke Hawkins, the handsome owner of the apartment building. Carly finds that some of the women living in the apartment building have been murdered and the police suspect that there is a serial killer in the apartment building. Carly has a passionate and seductive love affair with Zeke, unaware Zeke has secretly wired the apartment building with hidden cameras and he has been watching the lives of each tenant living in the apartment building including Carly. Carly begins to suspect Zeke or Jack may be the serial killer responsible for the murders in the apartment building and she may be the killer's next victim."},
{"imdbId": "tt0083658", "storyLine": "\nIn the futuristic year of 2019, Los Angeles has become a dark and depressing metropolis, filled with urban decay. Rick Deckard, an ex-cop, is a \"Blade Runner\". Blade runners are people assigned to assassinate \"replicants\". The replicants are androids that look like real human beings. When four replicants commit a bloody mutiny on the Off World colony, Deckard is called out of retirement to track down the androids. As he tracks the replicants, eliminating them one by one, he soon comes across another replicant, Rachel, who evokes human emotion, despite the fact that she's a replicant herself. As Deckard closes in on the leader of the replicant group, his true hatred toward artificial intelligence makes him question his own identity in this future world, including what's human and what's not human."},
{"imdbId": "tt0108186", "storyLine": "\nCountry girl Rebecca begins college in Los Angeles. There she meets Crawl, a student who is crazy, unpredictable and wild. During the holidays she brings him with her home. Her parents have never seen anything like him and are shocked when Rebecca tells them that they are engaged to be married. Two different worlds collide..."},
{"imdbId": "tt0108174", "storyLine": "\nCharlie, a poet, hasn't had much luck with women, but then he meets Harriet, the girl of his dreams.. or is it his nightmares. Charlie begins to suspect that Harriet is Ms X, a woman who marries then kills her husbands."},
{"imdbId": "tt0108238", "storyLine": "\nA serial killer is back in Pittsburgh to torment the former homicide detective who was on his trail years before. Tom Hardy, who has been relegated to water-way duty, along with new partner Jo Christman, navigate the three rivers looking for clues and discovering bodies. This time the victims are women Tom knows, he must find the killer to prove his innocence."},
{"imdbId": "tt0108255", "storyLine": "\nCan you make a movie out of a video game? That's the question that is answered by this film. Mario Mario and Luigi Mario, two hard working plumbers find themselves in an alternate universe where evolved dinosaurs live in medium hi-tech squalor. They find themselves the only hope to save the Earth from invasion."},
{"imdbId": "tt0111323", "storyLine": "\nMason, who lives on the streets, wants to cease his life when on the same day his two best friends die: His dog and an older man with whom he shared his food and roof. Just in time Cole, from a charity organization, can prevent his suicide and also offers him a quite well paid job as servant for a hunting party in the Rocky Mountains. Mason accepts the job and flies with them to a hut in the wilderness where they prepare everything for the four rich businessmen who want to hunt something special. Mason does not yet know that he is the victim of their sports that should lead to the basic insticts of man, but they did not count with his cleverness..."},
{"imdbId": "tt0111400", "storyLine": "\nDitch Brodie is a maverick skydiving instructor. One day, a beautiful girl comes in, wanting to take her first jump. Up in the air, Ditch takes his eyes off her momentarily, then looks back to find out that she has fallen out, dying on impact. Ditch is suspicious that all is not as it seems, because he distinctly remembers hooking her static line on..."},
{"imdbId": "tt0108328", "storyLine": "\nAs the title suggests, this dramatised documentary about the eccentric Canadian pianist Glenn Gould is broken up into thirty-two short films (mirroring the thirty-two part structure of Bach's 'Goldberg Variations', the recording that Gould made famous), each giving us an insight into some aspect of Gould's life and career. Out of respect for the music lead actor Colm Feore is never seen playing the piano, merely reacting to Gould's own recordings, which are extensively featured"},
{"imdbId": "tt0111418", "storyLine": "\nEddy and Stuart share two-thirds of a dormitory suite. Due to bureaucratic error, a woman named Alex is added to their room. At first, relations among the three are tense. Soon, however, Alex falls for Eddy, and Stuart lusts after Alex. Eddy comes to realize not only that he's gay, but that he's attracted to Stuart. The three pledge not to act on any romantic (or lustful) feelings with each other, and become close friends . . . while bottling up a lot of sexual tension."},
{"imdbId": "tt0107688", "storyLine": "\nJack Skellington, the pumpkin king of Halloween Town, is bored with doing the same thing every year for Halloween. One day he stumbles into Christmas Town, and is so taken with the idea of Christmas that he tries to get the resident bats, ghouls, and goblins of Halloween town to help him put on Christmas instead of Halloween -- but alas, they can't get it quite right."},
{"imdbId": "tt0108333", "storyLine": "\nThe three best of the disbanded Musketeers - Athos, Porthos, and Aramis - join a young hotheaded would-be-Musketeer, D'Artagnan, to stop the Cardinal Richelieu's evil plot: to form an alliance with enemy England by way of the mysterious Milady. Rochefort, the Cardinal's right-hand man, announces the official disbanding of the King's Musketeers. Three, however, refuse to throw down their swords - Athos the fighter and drinker, Porthos the pirate and lover, and Aramis the priest and poet. Arriving in Paris to join the Musketeers, D'Artagnan uncovers the Cardinal's plans, and the four set out on a mission to protect King and Country."},
{"imdbId": "tt0108358", "storyLine": "\nAfter success cleaning up Dodge City, Wyatt Earp moves to Tombstone, Arizona, and wishes to get rich in obscurity. He meets his brothers there, as well as his old friend Doc Holliday. A band of outlaws that call themselves The Cowboys are causing problems in the region with various acts of random violence, and inevitably come into confrontation with Holliday and the Earps, which leads to a shoot-out at the OK Corral."},
{"imdbId": "tt0111488", "storyLine": "\nValerie is a juror in the trail of a mob boss. When her young son's life is threatened, she has no option other than to see that justice isn't done.            "},
{"imdbId": "tt0108399", "storyLine": "\nIn Detroit, Clarence Worley goes to the movie theater alone on the day of his birthday to watch some movies. The gorgeous Alabama Whitman accidentally drops her popcorn on Clarence and they watch the movie together. Later they go to a diner for pie, and end up having a one night stand. In the morning, Alabama confesses that she is a call-girl hired to spend the night with him, but she has fallen in love with him. In the morning they get married and Clarence goes to the club where she worked to bring her some clothes. However, her pimp Drexl Spivey and his partner beat up Clarence and he reacts by killing them both. Clarence asks for Alabama's suitcase with her clothes and the other girls mistakenly give another one with cocaine. When Clarence discovers the mistake, he decides to travel with Alabama to the house of his friend, the aspiring actor Dick Ritchie, to sell the drug and travel to Mexico. He visits his father Clifford Worley and gives his address to him. But the Sicilian Mafia..."},
{"imdbId": "tt0108515", "storyLine": "\nA behind-the-scenes documentary about the Clinton for President campaign, focusing on the adventures of spin doctors James Carville and George Stephanopoulos. Bill Clinton himself is almost never seen."}
]